{
    "id": "clockworks/tiktok-hashtag-scraper",
    "url": "https://apify.com/clockworks/tiktok-hashtag-scraper",
    "title": "♪ Tiktok Hashtag Scraper · Apify",
    "name": "Tiktok Hashtag Scraper",
    "pricing": "Pay $5.00 for 1,000 videos",
    "description": "Scrape TikTok hashtags the fast and easy way. Just add one or more hashtags and the scraper will extract TikTok data on each video that mentions it: URLs, likes, country of creation, video and music metadata, TikTok creator data. Download data as JSON, HTML and use it in your apps and data projects.",
    "author_name": "Clockworks",
    "maintained_by": "Maintained by Apify",
    "count_users": "491 users",
    "count_runs": "3.1k runs",
    "last_modified": "Modified about 16 hours ago",
    "categories": "Marketing\nSocial media\nVideos",
    "full_readme": "What is TikTok Hashtag Scraper?\n\nTikTok Hashtag Scraper is a powerful and easy-to-use tool that allows you to extract data from TikTok videos that use a particular hashtag. Using this tool, you will be able to scrape:\n\nAll TikToks posted with chosen hashtags: caption, video URL, number of plays, hearts, comments, shares, country of creation, timestamp, paid or non-paid status, video- and music-related metadata.\nBasic creator info from TikToks posted with chosen hashtags: name, ID, avatar, bio, account status, total followers/following numbers, given/received likes count, etc.\nTotal number of views for a chosen hashtag\nHow to use data extracted from TikTok hashtags?\n\nThe data extracted from TikTok Hashtag Scraper can be used for a variety of purposes, including:\n\n\n✨ Conducting sentiment analysis and finding authentic product reviews\n\n\n👩‍🔬 Obtaining data for research and social listening experiments\n\n\n🦠 Analyzing trends, and viral campaigns\n\n\n🥸 Identifying unverified content and inaccurate information with high public value\n\n\n📚 Preparing for or analyzing a TikTok marketing campaign\n\nHow do I use TikTok Hashtag Scraper?\n\nTikTok Hashtag Scraper is designed to be user-friendly, even for those who have never extracted data from the web before! Here’s how you can use TikTok Hashtag Scraper to extract hashtag data:\n\nCreate a free Apify account using your email.\nOpen TikTok Hashtag Scraper.\nAdd one or more TikTok hashtags to scrape data.\nClick the “Start” button and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\nInput\n\nThe input for TikTok Hashtag Scraper should be a TikTok hashtag (with or without the # symbol) and a number of videos. If you add more than one hashtag, the results will be split evenly. For instance, if you have 3 hashtags and set the total number of videos to 99, you'll get 33 results per each hashtag.\n\nClick on the input tab for a full explanation of an input example in JSON.\n\n{\n  \"hashtags\": [\n    \"#booktok\",\n    \"#tiktoktravel\",\n    \"#tiktokviral\"\n  ],\n  \"resultsPerPage\": 99\n}\n\nIf you set resultsPerPage to 15 or lower, the scraper will be significantly faster because it doesn't need to support scrolling.\n\nOutput sample\n\nThe results will be wrapped into a dataset which you can always find in the Storage tab. Here's an excerpt from the data you'd get if you apply the input parameters above:\n\nAnd here is the same data but in JSON. You can choose in which format to download your TikTok hashtag data: JSON, JSONL, Excel spreadsheet, HTML table, CSV, or XML.\n\n\n[{\n  \"id\": \"7197570602176220458\",\n  \"text\": \"It’s a beautifully written thriller on Amazon 🥹❤️ #stonemaidens #booktok #authorsoftiktok #thrillerbooks #books \",\n  \"createTime\": 1675815005,\n  \"createTimeISO\": \"2023-02-08T00:10:05.000Z\",\n  \"locationCreated\": \"US\",\n  \"isAd\": false,\n  \"isMuted\": false,\n  \"authorMeta\": {\n    \"id\": \"7197549560411227182\",\n    \"name\": \"stonemaidens\",\n    \"nickName\": \"lloyd\",\n    \"verified\": false,\n    \"signature\": \"Stone Maidens is a bestselling thriller\\n✨account run by his daughter😌❤️\",\n    \"bioLink\": null,\n    \"avatar\": \"https://p16-sign-va.tiktokcdn.com/tos-maliva-avt-0068/532fc8b1bd240ad334013ea12efc4625~c5_720x720.jpeg?x-expires=1679054400&x-signature=NM6hc5KRAka6RXDMPagm3l9%2ByYg%3D\",\n    \"privateAccount\": false,\n    \"roomId\": \"\",\n    \"ttSeller\": false,\n    \"following\": 135,\n    \"fans\": 391400,\n    \"heart\": 15600000,\n    \"video\": 14,\n    \"digg\": 182\n  },\n  \"musicMeta\": {\n    \"musicName\": \"original sound\",\n    \"musicAuthor\": \"e\",\n    \"musicOriginal\": true,\n    \"musicAlbum\": \"\",\n    \"playUrl\": \"https://v77.tiktokcdn.com/2a49965f3ee4ea0c08b1861a30bf9e84/6411c6b9/video/tos/useast2a/tos-useast2a-v-27dcd7/087f3967d9254562993bd0baea46be8d/?a=1233&ch=0&cr=0&dr=0&er=2&cd=0%7C0%7C0%7C0&br=250&bt=125&ft=d2A~l-Inz7Tqm1Qfiyq8Z&mime_type=audio_mpeg&qs=6&rc=OzlnN2VnPDhlOjs0aTpnZEBpM25tazt5bm15NTMzNzU8M0A1Xl9gNl8uNWAxYmEtXy0xYSMyY25icy00XzZgLS1kMTZzcw%3D%3D&l=20230315122223890A34FC035DFC0C9096&btag=80000&cc=13&download=true\",\n    \"coverMediumUrl\": \"https://p16-sign-sg.tiktokcdn.com/aweme/720x720/tos-alisg-avt-0068/3b8cf578d154dbef816de11b2e7e8523.jpeg?x-expires=1679054400&x-signature=qu2ynSR8ITDgXegsc6s66QvmBso%3D\",\n    \"musicId\": \"7182615980223662849\"\n  },\n  \"webVideoUrl\": \"https://www.tiktok.com/@stonemaidens/video/7197570602176220458\",\n  \"mediaUrls\": [\n    \"https://v16-webapp-prime.tiktok.com/video/tos/maliva/tos-maliva-ve-0068c799-us/500fcf02e5084425bc16d2671813d244/?a=1988&ch=0&cr=0&dr=0&lr=tiktok_m&cd=0%7C0%7C1%7C0&cv=1&br=2220&bt=1110&cs=0&ds=3&ft=TYOI3113vjVQ9-~ltJTsdOcw4i_a7uwQAmy5dbSyJE&mime_type=video_mp4&qs=0&rc=ZTQ2ZTRmaGRpPGQ0M2dpN0BpajdpbWc6ZndoaTMzZzczNEA1L2MzNi8uNTIxYmAwYC8zYSNsLmBzcjQwY2VgLS1kMS9zcw%3D%3D&btag=80000&expire=1678904561&l=20230315122223890A34FC035DFC0C9096&ply_type=2&policy=2&signature=8b08a9d00de906f77995c8cfe4848860&tk=tt_chain_token\"\n  ],\n  \"videoMeta\": {\n    \"height\": 1024,\n    \"width\": 576,\n    \"duration\": 17,\n    \"coverUrl\": \"https://p19-sign.tiktokcdn-us.com/obj/tos-useast5-p-0068-tx/23b8f55d3189470284431a64fde53dbb?x-expires=1678903200&x-signature=g6LnfcJfnzirPo3XrX5PLjUTH%2Bw%3D\",\n    \"definition\": \"720p\",\n    \"format\": \"mp4\"\n  },\n  \"diggCount\": 10700000,\n  \"shareCount\": 54100,\n  \"playCount\": 50700000,\n  \"commentCount\": 44100,\n  \"mentions\": [],\n  \"hashtags\": [\n    {\n      \"id\": \"7142528998826835994\",\n      \"name\": \"stonemaidens\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"1622962893630470\",\n      \"name\": \"booktok\",\n      \"title\": \"Dive into the biggest book club on the planet with reviews and recommendations for just about every genre you could imagine.\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"1631897085131782\",\n      \"name\": \"authorsoftiktok\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"1635852931447813\",\n      \"name\": \"thrillerbooks\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"17861\",\n      \"name\": \"books\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    }\n  ],\n  \"effectStickers\": [],\n  \"searchHashtag\": {\n    \"views\": \"116.5B\",\n    \"name\": \"booktok\"\n  }\n}\n]\n...\n...\n\nHow many results can you scrape with TikTok Hashtag scraper?\n\nTikTok Hashtag scraper can return up to 1000 results per hashtag on average. This is a hard limit by the TikTok website that cannot be overcome.\n\nHowever, you have to keep in mind that scraping tiktok.com has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping TikTok Hashtags cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nWant to scrape TikTok profiles or search results?\n\nIf you want to extract specific TikTok data other than hashtags, you can use one of the specialized scrapers below, each built particularly for the relevant TikTok data scraping case, whether it's profiles, comments, search results, or all data at once:\n\n🕹 Tiktok Video Scraper\t🎙 TikTok Comments Scraper\t🔎 Tiktok Search Scraper\n🧛 TikTok Profile Scraper\t🎶 TikTok Scraper\t#️⃣ TikTok Hashtag Scraper\nNot your cup of tea? Build your own scraper!\n\nTikTok Hashtag scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nIntegrations and TikTok Hashtag Scraper\n\nLast but not least, Tiktok Hashtag Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nOr you can use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Tiktok Hashtag Scraper successfully finishes a run.\n\nUsing TikTok Hashtag Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nYou can use the apify-client NPM package to access the API using Node.js, or the apify-client PyPI package to access the API using Python.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nIs it legal to scrape data from TikTok hashtags?\n\nOur TikTok scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They can only extract what the user has chosen to share publicly. However, you should be aware that your results might contain personal data.\n\nPersonal data is protected by GDPR in the European Union and other laws and regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you’re unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for TikTok Hashtag scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/ZvWe3lOniBzl0BydrYGtM9bz0e-B8uoRtJWmpjPcExo/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9mMVplUDBLNThpd2xxRzJwWS92N0ZmdXFtU0dyb01lN0VHei1UaWt0b2tfSGFzaHRhZ19TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/clockworks",
    "author_avatar": "https://images.apifyusercontent.com/tAphEAAetE8rASX0RNFeJQiwqhcYDGhtm_LHgtB71lI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS84V3JkTVBpTDROcDJrZzdGQy9KcGZFRHFZeUg3V0Zld1kyQy1jbG9ja3dvcmtzLnBuZw.webp",
    "readme_summary": "Scrape TikTok hashtags the fast and easy way. Just add one or more hashtags and the scraper will extract TikTok data on each video that mentions it: URLs, likes, country of creation, video and music metadata, TikTok creator data. Download data as JSON, HTML and use it in your apps and data projects."
}