{
    "id": "apify/instagram-hashtag-scraper",
    "name": "Instagram Hashtag Scraper",
    "description": "Scrape Instagram hashtags the fast and easy way. Just add one or more hashtags and the scraper will extract posts, images, URLs, comments, likes, users, locations, timestamps, and more. Download structured data in JSON, CSV, XML, Excel, and HTML to use in applications, reports, and spreadsheets.",
    "users": "7.1k",
    "run": "333.7k",
    "author": "Apify",
    "full_readme_text": "Instagram Hashtag Scraper\n\napify/instagram-hashtag-scraper\nModified 4 days ago\nUsers 7.1k\nRuns 333.7k\nCreated by Apify\n\nScrape Instagram hashtags the fast and easy way. Just add one or more hashtags and the scraper will extract posts, images, URLs, comments, likes, users, locations, timestamps, and more. Download structured data in JSON, CSV, XML, Excel, and HTML to use in applications, reports, and spreadsheets.\n\nSocial media\n\nTry for free\n\nNo credit card required\n\nCustomize me!\nReport an issue\n\nInstagram Hashtag Scraper\n\nTry for free\n\nCustomize me!\nReport an issue\nREADME\nInput\nAPI\nChangelog\nRelated Actors\n\nWhat is Instagram Hashtag Scraper?\n\nIt's a simple tool that allows you to web scrape full data from Instagram posts based on hashtag search. To scrape every post that mentions a specific hashtag, just indicate the hashtag, the number of posts to scrape, and click the \"Save & Start\" button at the bottom of the page.\n\nHow to scrape Instagram hashtags\n\nInstagram Hashtag Scraper is designed to be fast and easy to use, so there aren't too many parameters or settings. Just follow the steps below:\n\nCreate a free Apify account.\nOpen Instagram Hashtag Scraper.\nAdd one or more Instagram hashtags to scrape.\nClick \"Save & Start\" and wait for the datasets to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\n\nInstagram Hashtag Scraper tutorial\n\nIf you want detailed guidance on how to use Instagram Hashtag Scraper, follow this video tutorial - it will show you exactly how to extract data from Instagram hashtags in just a few minutes:\n\nHow many results can you scrape with Instagram Hashtag Scraper?\n\nInstagram Hashtag Scraper can return tens of thousands of results on average. However, you have to keep in mind that scraping Instagram has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping Instagram Hashtags cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nInput\n\nThe input for Instagram Hashtag Scraper should be the Instagram hashtag or hashtags you want to scrape and number of results for each. Click on the input tab for an input example in JSON.\n\nOutput\n\nYou can download the resulting datasets in various structured formats such as JSON, HTML, CSV or Excel. Each item in the dataset will contain a separate Instagram post (which mentions your hashtag) following this format:\n\n[ { \"id\": \"2968381439079951049\", \"type\": \"Image\", \"shortCode\": \"CkxzzESOSrJ\", \"caption\": \"Something to walk with… warm.. ‘to go’.⁠\\n#WinterWarmer #Pastry & #Coffee ☕️🤍⁠\\n⁠\\n⁠\\n#coffeeshop #walking #coffeelover #bakery #latte #cafe #coffeetime #coffeeaddict #latteart #coffeegram #barista #caffeine #instacoffee #coffeelovers #cappuccino #coffeelove #pastry #butcher #baker #savoury #sweet #artisan #artisanbakery\", \"hashtags\": [ \"WinterWarmer\", \"Pastry\", \"Coffee\", \"coffeeshop\", ], \"mentions\": [], \"url\": \"https://www.instagram.com/p/CkxzzESOSrJ/\", \"commentsCount\": 0, \"firstComment\": \"\", \"latestComments\": [], \"dimensionsHeight\": 1334, \"dimensionsWidth\": 1080, \"displayUrl\": \"https://instagram.ftpa1-2.fna.fbcdn.net/v/t51.2885-15/314813380_3353123594960112_7939201600927436601_n.jpg?stp=dst-jpg_e35&_nc_ht=instagram.ftpa1-2.fna.fbcdn.net&_nc_cat=100&_nc_ohc=vQbODwsDgF0AX83Zh0w&edm=AA0rjkIBAAAA&ccb=7-5&oh=00_AfCr7AxXzveU1ZeAUWswNEG_KxrrR9b5tQJIjNcKJQ-bKw&oe=637255A2&_nc_sid=d997c6\", \"images\": [], \"alt\": null, \"likesCount\": 0, \"timestamp\": \"2022-11-10T11:11:15.000Z\", \"childPosts\": [], \"ownerId\": \"51571511280\" }, ] ...\n\nWant to scrape Instagram profiles, videos, or comments?\n\nYou can use the dedicated scrapers below if you want to scrape specific Instagram data. Each of them is built for a relevant Instagram scraping case, e.g. comments, video, followers, or profile.\n\nInstagram Post Scraper\nInstagram Profile Scraper\nQuick Instagram Posts Checker\nInstagram Tagged Scraper\nInstagram Reel Scraper\nInstagram Comment Scraper\n\n\nNeed something more advanced?\n\nTry our more advanced Instagram Scraper or Instagram API Scraper if you need more options and are comfortable with changing settings.\n\nLet us know if you need a custom Instagram scraping solution.\n\nWhat can I use the extracted data from Instagram hashtags for?\n\nScraping Instagram hashtags is the fastest, most efficient way to get datasets that you can use anywhere. Data from posts based on hashtags can help to follow and predict trends, assist in tracking brand awareness, direct you in how to improve your Instagram performance, and help to keep an eye on competing influencers.\n\nIs it legal to scrape Instagram hashtags data?\n\nOur Instagram scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. However, you should be aware that your results could contain personal data. You should not scrape personal data unless you have a legitimate reason to do so.\n\nIf you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nCan I integrate Instagram Hashtag Scraper with other apps?\n\nInstagram Hashtag Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Instagram Hashtag Scraper successfully finishes a run.\n\nCan I use Instagram Hashtag Scraper with the Apify API?\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more. To access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nNot your cup of tea? Build your own scraper.\n\nInstagram Hashtag Scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Instagram Hashtag Scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.\n\nON THIS PAGE\n\nWhat is Instagram Hashtag Scraper?\nHow to scrape Instagram hashtags\nInstagram Hashtag Scraper tutorial\nHow many results can you scrape with Instagram Hashtag Scraper?\nHow much will scraping Instagram Hashtags cost you?\nInput\nOutput\nWant to scrape Instagram profiles, videos, or comments?\nNeed something more advanced?\nWhat can I use the extracted data from Instagram hashtags for?\nIs it legal to scrape Instagram hashtags data?\nCan I integrate Instagram Hashtag Scraper with other apps?\nCan I use Instagram Hashtag Scraper with the Apify API?\nNot your cup of tea? Build your own scraper.\nYour feedback\n\nWhere next?\n\nBuild new tools\n\nAre you a developer? Build your own Actors and run them on Apify.\n\n\nGet a custom solution\n\nGet a custom web scraping or RPA solution.\n\n\n\nJoin our developer community on Discord\n\n\nCookie settingsTerms of usePrivacy policyCookie policy\n\n© 2023 Apify"
  }