{
    "id": "clockworks/free-tiktok-scraper",
    "url": "https://apify.com/clockworks/free-tiktok-scraper",
    "title": "Free TikTok Scraper · Apify",
    "name": "Free TikTok Scraper",
    "pricing": "No credit card required",
    "description": "This free version of TikTok Scraper will get you up to 20 videos and 5 comments per run. Use it to extract data about videos, users, and channels based on hashtags or scrape full user profiles including posts, total likes, name, nickname, numbers of comments, shares, followers, following, and more.",
    "author_name": "Clockworks",
    "maintained_by": "Maintained by Apify",
    "count_users": "7.6k users",
    "count_runs": "597.8k runs",
    "last_modified": "Modified about 17 hours ago",
    "categories": "Social media\nVideos",
    "full_readme": "What does TikTok Scraper Free do?\n\nOur free TikTok scraper allows you to extract data about videos from the TikTok social media site. It gives you detailed TikTok information in structured formats such as Excel, XML, HTML, JSON, and CSV, which you can use in your own reports, spreadsheets, and applications. TikTok Scraper allows you to scrape:\n\nResults from a TikTok hashtag search.\nNumbers of comments and shares, followers and following, total likes.\nIndividual posts and full user profiles - by using a URL for a specific profile or video.\n\nNote that the output for TikTok Scraper Free is limited to a maximum of 20 results and 5 comments.\n\nNeed more TikTok data?\n\nUse TikTok Scraper Unlimited to enjoy the full potential of scraping TikTok. Scrape TikTok hashtags, numbers of comments and shares, followers and following, user profiles, and individual posts without limitations.\n\nWhy use TikTok Scraper?\n\nTikTok Scraper creates an unofficial TikTok API. TikTok now has an estimated one billion users, and many of those users spend as much as 80 minutes per day on the app. With a TikTok API, you can build your own products and applications on top of the TikTok platform.\n\nHow to scrape TikTok - tutorial and video guide\n\nIf you've never done any web scraping before - worry not; just follow our step-by-step guide on how to scrape TikTok and you'll be up to speed in no time. Or simply follow our quick video tutorial on YouTube:\n\nHow to use extracted TikTok data\nBoost brand awareness or spread the message about social issues and causes.\nForecast upcoming trends and influences on social media across the new generation.\nGet data for research and social listening experiments.\nGet authentic product reviews and back up sentiment analysis with real data.\nPlan commercial campaigns on TikTok or other social media platforms.\nSimplify market research for hashtag challenges and marketing campaigns.\nInput parameters\n\nIf this actor is run on the Apify platform, our simple interface will help you to configure all the necessary and optional parameters of this scraper before running it. This scraper recognizes the following input parameters:\n\nhashtags - scrapes TikTok for hashtags. You can duplicate this parameter to scrape several hashtags simultaneously.\nprofiles - scrapes TikTok profiles. You can copy this parameter to scrape several profiles simultaneously.\npostURLs- scrapes specific TikTok posts. You can duplicate this parameter to scrape several posts at the same time.\nresultsPerPage - sets the maximum limit for the amount of scraped results; default is 20.\nmaxRequestRetries - indicates the limit of scraper retries in case of any errors.\nExample\n{ \n  \"resultsPerPage\": 20,\n  \"hashtags\": [\"podcast\"],\n  \"maxRequestRetries\": 10 \n}\n\nOutput\n\nThe output from TikTok Scraper is stored in a dataset. Each item is information about a video and user or channel. Here's an example of some of the output you would get if you used the input parameters above to scrape the hashtag \"comfortfood\":\n\nExample\n{\n \"id\": \"6885142885939825925\",\n \"text\": \"Best Mashed Potatoes! #tiktokcooks #hellofall #comfortfood #homecooking #cookingwithshereen #fyp\",\n \"createTime\": 1603072290,\n \"authorMeta\": {\n  \"id\": \"6746332443361739782\",\n  \"name\": \"cookingwithshereen\",\n  \"nickName\": \"COOKING with SHEREEN\",\n  \"verified\": true,\n  \"signature\": \"YouTube & Insta ⤴️\\n⬇️ My CookBook & Merch! ⬇️\",\n  \"avatar\": \"https://p16-sign-va.tiktokcdn.com/tos-maliva-avt-0068/750f43c1845b5a556207821b1a0d72c1~c5_720x720.jpeg?x-expires=1639000800&x-signature=gl7OpbhX1L9yhC6e2rm4rajLvZg%3D\",\n  \"following\": 27,\n  \"fans\": 4400000,\n  \"heart\": 72300000,\n  \"video\": 185,\n  \"digg\": 910\n },\n \"musicMeta\": {\n  \"musicName\": \"original sound\",\n  \"musicAuthor\": \"COOKING with SHEREEN\",\n  \"musicOriginal\": true,\n  \"musicAlbum\": \"\",\n  \"playUrl\": \"https://sf16-ies-music-va.tiktokcdn.com/obj/musically-maliva-obj/6885142857766669062.mp3\"\n },\n \"webVideoUrl\": \"https://www.tiktok.com/@cookingwithshereen/video/6885142885939825925\",\n \"videoUrl\": \"https://v16-web.tiktok.com/video/tos/useast2a/tos-useast2a-ve-0068c001/aaa32cd10cfc49d297adb7900f680551/?a=1988&br=3442&bt=1721&cd=0%7C0%7C1&ch=0&cr=0&cs=0&cv=1&dr=0&ds=3&er=&expire=1638937586&ft=wUyFfFGgkag3-I&l=202112072225270101890660492361F572&lr=tiktok_m&mime_type=video_mp4&net=0&pl=0&policy=3&qs=0&rc=Mzw2d2RobzZpeDMzNjczM0ApPDMzOzRpPDw6NzllNmlmNGdwLm9wZ2FyLzNfLS0vMTZzcy0yYy0xNDE1NDQvX2E2NGE6Yw%3D%3D&signature=30e50cb1af44c4eec84bca1b761180b9&tk=0&vl=&vr=\",\n \"videoMeta\": {\n  \"height\": 1024,\n  \"width\": 576,\n  \"duration\": 59\n },\n \"diggCount\": 3100000,\n \"shareCount\": 91600,\n \"playCount\": 21500000,\n \"commentCount\": 24900,\n \"downloaded\": false,\n \"mentions\": [],\n \"hashtags\": [\n  { \n\nHow much will scraping TikTok cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nWant to scrape TikTok creator data or hashtags?\n\nYou can use the dedicated scrapers below if you want to scrape specific TikTok data. Each of them is built particularly for the relevant TikTok data scraping case, be it sounds, search results, profiles, or all data at once. Feel free to browse them:\n\n🧛 TikTok Profile Scraper\t#️⃣ TikTok Hashtag Scraper\t🎙 TikTok Comments Scraper\n🔎 Tiktok Search Scraper\t🕹 Tiktok Video Scraper\t🎵 TikTok Sound Scraper\nIntegrations and TikTok Scraper Free\n\nLast but not least, TikTok Scraper Free can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Instagram API Scraper successfully finishes a run.\n\nUsing TikTok Scraper Free with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nTo access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nPersonal data\n\nYou should be aware that your results might contain personal data. Personal data is protected by GDPR in the European Union and other laws and regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. You can read the basics of ethical web scraping in our blog post on the legality of web scraping.\n\nNot your cup of tea? Build your own scraper\n\nTikTok scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for TikTok scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/9Q5Byqb4wgabw6OyDgGWkopaEZgo05GJF9STqP1Ug-s/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9PdHpZZksxbmRFR2R3V0ZLUS95dHVpeFA1UnRQelNhQjdiNy1GcmVlX1Rpa1Rva19TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/clockworks",
    "author_avatar": "https://images.apifyusercontent.com/tAphEAAetE8rASX0RNFeJQiwqhcYDGhtm_LHgtB71lI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS84V3JkTVBpTDROcDJrZzdGQy9KcGZFRHFZeUg3V0Zld1kyQy1jbG9ja3dvcmtzLnBuZw.webp",
    "readme_summary": "The TikTok Scraper Free is an Apify actor that allows you to extract data about videos, users, and channels from TikTok. It provides detailed TikTok information in structured formats such as Excel, XML, HTML, JSON, and CSV. The scraper can extract results from a TikTok hashtag search, numbers of comments and shares, followers and following, total likes, individual posts, and full user profiles. However, the output is limited to a maximum of 20 results and 5 comments per run. The scraper accepts input parameters such as hashtags, profiles, postURLs, resultsPerPage, and maxRequestRetries. The output is stored in a dataset, with each item being information about a video and user or channel. The scraper can be integrated with almost any cloud service or web app thanks to integrations on the Apify platform. It can also be accessed programmatically via the Apify API. Note that the results might contain personal data, which is protected by GDPR and other laws and regulations."
}