{
    "id": "apify/facebook-likes-scraper",
    "url": "https://apify.com/apify/facebook-likes-scraper",
    "title": "❤︎ Facebook Likes Scraper · Apify",
    "name": "Facebook Likes Scraper",
    "pricing": "Pay $5.00 for 1,000 Likers",
    "description": "Extract Facebook likes data from one or multiple Facebook posts. Get post URL, reaction type (like, love, care, sad, angry, laugh), and basic liker info such as Facebook name and profile URL. Download the data in JSON, CSV Excel and use it in apps, spreadsheets, and reports.",
    "author_name": "Apify",
    "maintained_by": "Maintained by Apify",
    "count_users": "250 users",
    "count_runs": "1k runs",
    "last_modified": "Modified 1 day ago",
    "categories": "Social media\nMarketing\nLead generation",
    "full_readme": "What is Facebook Likes Scraper?\n\nIt's a simple and powerful tool that allows you to extract data about reactions to Facebook posts. To get that data, just insert the post URL and click \"Save & Start\" button.\n\nWhat Facebook likes data can I extract?\n\nWith this Facebook API, you will be able to extract the following likes data from Facebook:\n\n🔗 Post URL\t😢 Reaction type (like, love, care, angry, sad, laugh)\n🖼 Liker Profile URL\t💂‍♀️ Basic liker info\n👍 Facebook ID\t✍️ Post ID\nWhy scrape Facebook likes?\n\n🤬 Analyze social media and identify hot spots of misinformation or hate speech\n\n\n🔎 Conduct market research or product analysis\n\n\n🤺 Monitor competition\n\n\n🤔 Track brand sentiment and shifts in customer engagement\n\n\nHow do I use Facebook Likes Scraper?\n\nFacebook Likes Scraper was designed to be easy to start with even if you've never extracted data from the web before. Here's how you can scrape Facebook data with this tool:\n\nCreate a free Apify account using your email.\nOpen Facebook Likes Scraper.\nAdd one or more Facebook post URLs to scrape its likes and other reactions.\nClick \"Start\" and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\nInput\n\nThe input for Facebook Likes Scraper should be URLs of Facebook posts you want to scrape reactions from. Click on the input tab for a full explanation of input in JSON.\n\n{\n  \"startUrls\": [\n    {\n      \"url\": \"https://www.facebook.com/humansofnewyork/posts/pfbid0BbKbkisExKGSKuhee9a7i86RwRuMKFC8NSkKStB7CsM3uXJuAAfZLrkcJMXxhH4Yl\"\n    }\n  ]\n}\n...\n\nOutput sample\n\nThe results will be wrapped into a dataset which you can find in the Storage tab. Here's an excerpt from the dataset you'd get if you apply the input parameters above:\n\nAnd here is the same data but in JSON. You can choose in which format to download your Facebook data: JSON/JSONL, Excel, HTML table, CSV, or XML.\n\n[{\n  \"facebookUrl\": \"https://www.facebook.com/humansofnewyork/posts/pfbid0BbKbkisExKGSKuhee9a7i86RwRuMKFC8NSkKStB7CsM3uXJuAAfZLrkcJMXxhH4Yl\",\n  \"reaction\": \"love\",\n  \"name\": \"Michelle Smith\",\n  \"profileUrl\": null,\n  \"profilePicture\": \"https://scontent-man2-1.xx.fbcdn.net/v/t1.18169-1/22800_10207336193869748_1821910971530943054_n.jpg?stp=cp0_dst-jpg_p40x40&_nc_cat=105&ccb=1-7&_nc_sid=7206a8&_nc_ohc=_6ChvYNvDBMAX-J2bUl&_nc_oc=AQmF-nSdG94uKGQzDb_IHiQyu97QPNKqfndGF7uG_O950jt8L36m0o6DOhDmQPFtVqvwvqGsqGfcoFVXUvpgRrLx&_nc_ht=scontent-man2-1.xx&oh=00_AfB2hFdjSrD6F7ZsGHJoOSPgaGeMbIGeKW0PgGnO6hhguA&oe=64649844\",\n  \"facebookId\": \"6375219342552112\",\n  \"postId\": \"6375219342552112\"\n},\n{\n  \"facebookUrl\": \"https://www.facebook.com/humansofnewyork/posts/pfbid0BbKbkisExKGSKuhee9a7i86RwRuMKFC8NSkKStB7CsM3uXJuAAfZLrkcJMXxhH4Yl\",\n  \"reaction\": \"like\",\n  \"name\": \"Sarah Dampson\",\n  \"profileUrl\": \"https://www.facebook.com/people/Sarah-Dampson/pfbid0VQgN3GwLtyQLXMjxKc1TM9ion7B7r9oHAcVbM4EkCZwRNbh12FbpNs6neZhHm7dFl/\",\n  \"profilePicture\": \"https://scontent-man2-1.xx.fbcdn.net/v/t39.30808-1/324069204_843562506947134_5065400659853604584_n.jpg?stp=cp0_dst-jpg_p40x40&_nc_cat=111&ccb=1-7&_nc_sid=7206a8&_nc_ohc=etfsyQ9lpW8AX8fIjHb&_nc_ht=scontent-man2-1.xx&oh=00_AfA5iEcJ7IU_yGK-cZyvJWEOSqGUv2Z31Eq4xDBQEC8OhA&oe=644230AF\",\n  \"facebookId\": \"6375219342552112\",\n  \"postId\": \"6375219342552112\"\n},\n{\n  \"facebookUrl\": \"https://www.facebook.com/humansofnewyork/posts/pfbid0BbKbkisExKGSKuhee9a7i86RwRuMKFC8NSkKStB7CsM3uXJuAAfZLrkcJMXxhH4Yl\",\n  \"reaction\": \"like\",\n  \"name\": \"Caroline Paavola\",\n  \"profileUrl\": null,\n  \"profilePicture\": \"https://scontent-man2-1.xx.fbcdn.net/v/t39.30808-1/340095828_2223834257819881_2999023177662489964_n.jpg?stp=cp0_dst-jpg_p40x40&_nc_cat=110&ccb=1-7&_nc_sid=7206a8&_nc_ohc=a95c1A4ZAKIAX8Jy8sL&_nc_ht=scontent-man2-1.xx&oh=00_AfBXtH73Wi1cC6pDuprFD_RF-aAK1KKnL4-V1yEOyoNTnA&oe=64427771\",\n  \"facebookId\": \"6375219342552112\",\n  \"postId\": \"6375219342552112\"\n},\n{\n  \"facebookUrl\": \"https://www.facebook.com/humansofnewyork/posts/pfbid0BbKbkisExKGSKuhee9a7i86RwRuMKFC8NSkKStB7CsM3uXJuAAfZLrkcJMXxhH4Yl\",\n  \"reaction\": \"love\",\n  \"name\": \"Penny Brill\",\n  \"profileUrl\": null,\n  \"profilePicture\": \"https://scontent-man2-1.xx.fbcdn.net/v/t31.18172-1/209387_1863556022561_7170678_o.jpg?stp=c0.0.40.40a_cp0_dst-jpg_p40x40&_nc_cat=100&ccb=1-7&_nc_sid=7206a8&_nc_ohc=yZ9FmYzoqBsAX_mDZVJ&_nc_ht=scontent-man2-1.xx&oh=00_AfBsMxH5CKqlEslCQLbzT1YPN9RjWbKksqu9pCyv561o-A&oe=64647994\",\n  \"facebookId\": \"6375219342552112\",\n  \"postId\": \"6375219342552112\"\n}]\n...\nHow many results can you scrape with Facebook Likes scraper?\n\nFacebook Likes scraper can currently return 20 results on average - the preview of likes (reactions) you see per every post. However, you have to keep in mind that scraping facebook.com has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping Facebook Likes cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nWant to scrape Facebook Pages or comments?\n\nYou can use the dedicated scrapers below if you want to scrape specific Facebook data. Each of them is built particularly for the relevant Facebook scraping case be it group posts, reviews, events, or images. Feel free to browse them:\n\n🚩 Facebook Pages Scraper\t📝 Facebook Posts Scraper\n👥 Facebook Groups Scraper\t🌟 Facebook Reviews Scraper\n🗓 Facebook Events Scraper\t💬 Facebook Comments Scraper\nNot your cup of tea? Build your own scraper\n\nFacebook Likes Scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nIntegrations and Facebook Likes Scraper\n\nLast but not least, Facebook Likes Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with LangChain, Make, Trello, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, Asana, and more.\n\nYou can also use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Facebook Likes Scraper successfully finishes a run.\n\nUsing Facebook Likes Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more. To access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nIs it legal to scrape Facebook Likes data?\n\nOur Facebook scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. However, you should be aware that your results could contain personal data. You should not scrape personal data unless you have a legitimate reason to do so.\n\nIf you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Facebook Likes Scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/lNx9L3yLH4Kc2di-FycZ0lbwhX7pdAfDH93gAwvXJPg/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9YS1FJMEpyOWxUVlN4MEJpSC9RVHNxeUJpaHROZVlEODRHRC1GYWNlYm9va19saWtlc19TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/apify",
    "author_avatar": "https://images.apifyusercontent.com/lI97nKRfQNn-301fZooeDiLELKwBtOreoKdvb-R9XnI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9ac2NNd0ZSNUg3ZUN0V3R5aC9ZcXRrUW1FeFpwbU1kNmRKUS1hcGlmeV9zeW1ib2xfd2hpdGVfYmcucG5n.webp",
    "readme_summary": "Extract Facebook likes data from one or multiple Facebook posts. Get post URL, reaction type (like, love, care, sad, angry, laugh), and basic liker info such as Facebook name and profile URL. Download the data in JSON, CSV Excel and use it in apps, spreadsheets, and reports."
}