{
    "id": "qbie/kickstarter-scraper",
    "url": "https://apify.com/qbie/kickstarter-scraper",
    "title": "Kickstarter Scraper · Apify",
    "name": "Kickstarter Scraper",
    "pricing": "No credit card required",
    "description": "Search Kickstarter projects based on your selected criteria and get structured data on matching projects. Download your data as HTML table, JSON, CSV, Excel, XML, and RSS feed. Forked from misceres/kickstarter-search.",
    "author_name": "Matt Warwick",
    "maintained_by": "Maintained by Community",
    "count_users": "52 users",
    "count_runs": "7k runs",
    "last_modified": "Modified 6 months ago",
    "categories": "Business",
    "full_readme": "Since the official Kickstarter API does not provide structured output of search results, you can get list of Kickstarter news and projects with this Kickstarter Scraper.\n\nThis Fork\n\nThis fork has the following fixes/changes:\n\nFixes an issue where the image/photo of a project is not included correctly. See https://console.apify.com/actors/h9kEJvo62ufE8PkSC#/issues/qNFoNx3PwZLS7bBGo/comments\nChanged 'photo' to 'image'\nAdds the image to the 'description' so that it can be parsed by RSS feed readers. I have only tested this with feedly but hopefully others should work too.\nFeatures\nscrape Kickstarter data up to 2400 items/per run\nget data from the most recent projects of any category and from any city\nsearch and scrape based on the amount of money aimed for, pledged and collected\nsort by status, recency or popularity\nname your Kickstarter datasets to keep track of all the various runs\nWhy scrape Kickstarter?\n\nKickstarter website is full of crowdfunding projects that are changing the world in many little ways. Here's what you can do with the data about them:\n\nMonitor both existing and upcoming Kickstarter projects in your country or city\nAnalyze which projects are the most likely to get supported and estimate the potential for success\nStrengthen your own crowdfunding campaign with real-time data\nFollow the projects competing in the same category all over the country\nOversee your own project and get notifications every time it gets funding\nBack up your Kickstarter investment analysis with the most recent data\nKeep track and archive the past successful projects in your city\nTutorial\n\nFor a more detailed explanation of how to scrape Kickstarter read a step-by-step tutorial on our blog.\n\nAnd for more ideas on how to use the extracted data, check out our industries pages for concrete ways web scraping results are already being used across businesses of various scale and direction - in NGO and Government work or Journalism, for instance.\n\nCost of usage\n\nOn average, scraping 1000 items from Kickstarter via Apify platform will cost you as little as 0.03 USD credits off your subscription plan. For more details about the plans we offer, platform credits and usage, see the platform pricing page.\n\nIf you're not sure how much credits you've got left on your plan and whether you might need to upgrade, you can always check your limits in the Settings -> Usage and Billing tab in your Console. The easiest way to know how many credits your actor will need is to perform a test run.\n\nInput\n\nInput of this actor should be JSON containing filter specification. Allowed filters are:\n\nField\tDescription\tAllowed values\nquery\tSearch term\tAny string value, e.g. Nimbus 2000 project\ncategory\tCategory to search in\tCategory slug from this list - anything from books to community gardens\nlocation\tLocation to search around\tName of the location, e.g. Prague\nstatus\tStatus of the project\tAll, Live or Successful\npledged\tAmount pledged\tOne of: All, <$1,000 pledged, $1,000 to $10,000 pledged, $10,000 to $100,000 pledged, $100,000 to $1,000,000 pledged and >$1,000,000 pledged\ngoal\tGoal amount\tOne of: All, <$1,000 goal, $1,000 to $10,000 goal, $10,000 to $100,000 goal, $100,000 to $1,000,000 goal and >$1,000,000 goal\nraised\tAmount % raised\tOne of: All, < 5% raised, 75% to 100% raised, >100% raised\nSort\tSort by\tPopularity, newest, end_date, most_funded or most_backed\nmaxResults\tMaximum number of projects in output\tHas to be a positive number, from 0 to 2400 results\ndatasetName\tName of dataset that will be overwritten with data on each run\tAlphabet characters, numbers and dash (e.q. my-dataset)\nInput example:\n{\n    \"query\":  \"Board games\",  \"\n    maxResults\":  100,  \n    \"category\":  \"games\",  \n    \"location\":  \"United States\",  \n    \"sort\":  \"newest\",  \"proxyConfig\":  \n    {  \"useApifyProxy\":  true  },  \n    \"status\":  \"Successful\",  \n    \"pledged\":  \"$1,000 to $10,000 pledged\",  \n    \"goal\":  \"$1,000 to $10,000 goal\",  \n    \"raised\":  \"All\",  \n    \"datasetName\":  \"\"\n}\nImportant considerations\n\nmaxResults - Kickstarter website can return a maximum of 200 pages, so at most, you will get 2400 results for any query. To get over 2400 results, run multiple instances of this actor with more specific search terms.\n\ndatasetName - If you provide name to a named dataset, every time you run this Kickstarter search actor, it will clear the existing dataset and rewrite it with new data. You can use this option if you want to use named dataset as RSS feed or if you are creating an API.\n\nLocation - You can also run another actor Kickstarter Location To Ids to find the specific ID associated with the location.\n\nDuring the run\n\nDuring the run, the actor will output messages letting the you know what is going on. If you provide incorrect input the Kickstarter search actor, it will immediately stop with Failure state and output an explanation of what is wrong.\n\nOutput\n\nOnce input is properly parsed the actor will load first page of results and output information about the number of found results and how many results are remaining. Every 10th page load will output prediction of how long it will take for the run to finish.\n\nOutput example\n{  \n\"id\":  1662550845,  \n\"photo\":  null,  \n\"name\":  \"Escape from HelL\",  \n\"blurb\":  \"A board game about getting to Manhattan from Williamsburg once the L train shuts down.\",  \n\"goal\":  2500,  \n\"pledged\":  7580,  \n\"state\":  \"successful\",  \n\"slug\":  \"escape-from-hell\",  \n\"disable_communication\":  false,  \n\"country\":  \"US\",  \n\"country_displayable_name\":  \"the United States\",  \n\"currency\":  \"USD\",  \n\"currency_symbol\":  \"$\",  \n\"currency_trailing_code\":  true,  \n\"deadline\":  1547854200,  \n\"state_changed_at\":  1547854200,  \n\"created_at\":  1543533003,  \n\"launched_at\":  1545138257,  \n\"staff_pick\":  false,  \n\"is_starrable\":  false,  \n\"backers_count\":  195,  \n\"static_usd_rate\":  1,  \n\"usd_pledged\":  \"7580.0\",  \n\"converted_pledged_amount\":  7580,  \n\"fx_rate\":  1,  \n\"usd_exchange_rate\":  1,  \n\"current_currency\":  \"USD\",  \n\"usd_type\":  \"international\",  \n\"spotlight\":  true,  \n\"creatorId\":  696946511,  \n\"creatorName\": \"Escape from Hell\",  \n\"creatorAvatar\": \"https://ksr-ugc.imgix.net/assets/023/572/288/d31afa951de00ed08ad0c8876cfbb0f2_original.png?ixlib=rb-4.0.2&w=160&h=160&fit=crop&v=1544981648&auto=format&frame=1&q=92&s=c7c176c48efa1a78213c52d58f7b5b98\",  \n\"creatorUrl\":  \"https://www.kickstarter.com/profile/escapefromhell\",  \n},\nKickstarter open source\n\nYou can manage search results in any language (Python, PHP, Node JS/NPM). See the FAQ or our API reference to learn more about getting results from this Kickstarter Search Actor. The code of this Kickstarter search actor is also open source, so you can create your own solution if you need.",
    "icon": "https://images.apifyusercontent.com/D3ntQ5WaL1kUxWvM5d0wQ-eGBeMcEbdxjwhHBaSAVik/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS8wanBPT1hRSUFqcGVaeHNFQy82NG0zbjh3bUx1a2NEaHRXQS1oRHdBaDNIU0RGWktlVDJXVy1raWNrc3RhcnRlci53ZWJw.webp",
    "author_url": "https://apify.com/qbie",
    "author_avatar": "https://images.apifyusercontent.com/_64SjAqs5ExQpFvdAvRiYEp4SflkMtXf5t44tfibZG4/rs:fill:192:192/aHR0cHM6Ly9saDMuZ29vZ2xldXNlcmNvbnRlbnQuY29tL2EtL0FPaDE0R2pIVWc0NGlpTXV3ZVVzYmxGVHNUbDZINFhWejFnT3JKM0N0UHZXdHc9czk2LWM.webp",
    "readme_summary": "Search Kickstarter projects based on your selected criteria and get structured data on matching projects. Download your data as HTML table, JSON, CSV, Excel, XML, and RSS feed. Forked from misceres/kickstarter-search. Features include scraping Kickstarter data up to 2400 items/per run, searching and scraping based on various criteria such as amount of money aimed for, pledged and collected, sorting by status, recency or popularity, and naming Kickstarter datasets to keep track of all the various runs. Input should be JSON containing filter specification. Output includes information about the number of found results and remaining results. The actor is open source and can be managed in any language."
}