{
    "id": "shanes/tweet-flash",
    "url": "https://apify.com/shanes/tweet-flash",
    "title": "Tweet Flash - Twitter Scraper (Working Again as of 10/18) · Apify",
    "name": "Tweet Flash - Twitter Scraper (Working Again as of 10/18)",
    "pricing": "Pay $0.10 for 1,000 tweets",
    "description": "Search, Filter, URL, User: This All-In-One Twitter Scraper delivers tweets at Blazing Fast Speeds with Historical Search and Other Unique Features. Search is no longer limited by date!",
    "author_name": "Jonathan Larson",
    "maintained_by": "Maintained by Community",
    "count_users": "1.8k users",
    "count_runs": "1.9M runs",
    "last_modified": "Modified 1 day ago",
    "categories": "Social media\nLead generation\nMarketing",
    "full_readme": "⚡ Tweet-Flash: The All-In-One Twitter Scraper ⚡\n\nWelcome to Tweet-Flash, your go-to Twitter scraper that offers low latency search, URL, and profile scraping capabilities, along with numerous filters for custom data extraction. Whether you're a researcher needing vast amounts of Twitter data for analysis, or a business looking to understand customer sentiment and trends, Tweet-Flash is your best ally. All of this for just $0.10 per 1000 tweets and 40-90 tweets per second!\n\n📑 Table of Contents\nDisclaimer\nFeatures\nMaximizing Value\nVS Competitors\nIdeal for a Range of Users\nCustom Time Frame\nCustomize Run\nMemory and Thread Usage\nFeature Requests\nTroubleshooting\nContact Us\n⚠️ Disclaimer\n\nFor full functionality including higher memory usage limits and detailed user info, please use Tweet Flash Plus\n\nWhile we strive to ensure the optimum functionality of Tweet-Flash, certain features such as image filtering may not always perform as expected due to external factors. Moreover, the tool's URL scraping functionality is not compatible with the filter option, as it utilizes search filters that are not an option for scraping specific URLs .\n\nThe stated speed of 75 tweets per second is an estimate and actual speeds may vary. Factors influencing the final speed include the type of content being scraped, the volume of data processed, and whether options such as additional user data collection or language detection are utilized. By using Tweet-Flash, users acknowledge these potential variations in performance.\n\n🌟 Features\n\nOur tool offers a range of features for custom data scraping. Here are just a few of them:\n\nOptional queries for focused data collection\nMultiple language support to cater to global needs\nCustom time frames for targeted data collection\nAdvanced user information for comprehensive data analysis\nMultithreading control for efficient resource utilization\nAdvanced filtering options in the interface for precise data extraction\n👀 VS Competitors\n\nThis chart compares the features of three different Twitter scrapers: Tweet-Flash (our service), Danielmilevski9 Twitter Search, and Quacker Twitter-scraper. Keep in mind that while the tests all included the same inputs (2gb ram, 50 inputs, 500 max results per input), recorded speeds and costs may vary and may not necessarily represent the actual metrics. (See further notes at the bottom of the page)\n\nFeature\tTweet-Flash\tQuacker Twitter-scraper\tDanielmilevski9 Twitter Search\nWorking Twitter Search\t✔️\t❌\t✔️\nSearch Data Range\tUnlimited\tN/A\t7 Last Days\nPrice Per 100k Results (Tweet URL)\t$10\t$9.56\t$500\nPrice Per 100k Results (Profile)\t$10\t$2.25\t$500\nPrice Per 100k Results (Profile with Filtering)\t$10\tN/A\t$500\nPrice Per 100k Results (Search)\t$10\tN/A\t$500\nTweets Per Second (URL)\t42\t7\t-\nTweets Per Second (Profile)\t93\t15\t-\nTweets Per Second (Search)\t77\tN/A\t-\nPricing Plan\t$0.10 per 1k results\tFree / Pay for Usage\t$5 per 1000 Results\nMaximum Tweets Per Input Limit\t✔️\t✔️\t✔️\nMaximum Tweets Total Limit\t✔️\t❌\t❌\nMaximum Profiles Scraped Limit\t❌\t✔️\t❌\nLanguage Detection\t✔️\t❌\t❌\nCollect Detailed User Info\t✔️\t✔️\t❌\nScrape Specific Profiles\t✔️\t✔️\t❌\nScrape From Tweet URLs\t✔️\t✔️\t❌\nScrape From Twitter List URLs\t❌\t✔️\t❌\nAdvanced User Information\t✔️\t✔️\t❌\nAdvanced Filtering Options in Interface\t✔️\t❌\t❌\nDate Range Interface\t✔️\t✔️\t❌\nMaximum Attempts\t✔️\t❌\t❌\nMultithreading Control\t✔️\t❌\t❌\nNo Proxy Required\t✔️\t❌\t❌\n🎯 Ideal for a Range of Users\n\nTweet-Flash is engineered to offer high efficiency, speed, and cost-effectiveness to a wide variety of users:\n\nLarge-Scale Data Analysts: If your work involves extensive link or user scraping tasks, Tweet-Flash is designed to handle large volumes of data with ease, making it an efficient and cost-effective solution.\nFiltered Data Enthusiasts: For those interested in detailed, filtered user scraping, Tweet-Flash's powerful filtering capabilities can help you narrow down and extract the data that matters most.\nDeep-Dive Researchers: If your research involves comprehensive search scraping, Tweet-Flash is equipped to delve deep into the data, enabling you to uncover valuable insights.\nTime-Conscious Users: If you have time-sensitive tasks that require quick results, Tweet-Flash's lightweight nature and quick startup time ensure you get the data you need, when you need it.\n\nWhile Tweet-Flash excels in handling these large-scale tasks, it's also a great tool for smaller projects due to its adjustable settings and scalability. Regardless of the size of your task, Tweet-Flash is built to deliver.\n\n🕐 Custom Time Frame\n\nTo set a custom time frame for tweets, use the Start and End options in the Custom Time Frame section. This will filter tweets published between the start (inclusive) and end (exclusive) dates. For instance, if you wish to scrape tweets from January 2023 to May 2023, simply set Start to '01/01/2023' and End to '05/01/2023'.\n\n⚙️ Customize Run\n\nYou can customize your scraping run by adjusting the maximum number of attempts and threads. The maximum number of attempts ensures that the tool tries to scrape a tweet multiple times before skipping it due to errors. The number of threads determines how many processes run concurrently. If the Manually Set Number of Threads/Workers field is left blank, the tool will automatically optimize based on available memory.\n\n📊 Memory and Thread Usage\n\nTweet-Flash uses highly efficient scraping techniques, minimizing the need for large amounts of memory and keeping costs low. For optimal performance, we recommend using no more than 150MB of memory per query or profile. If you're running multiple queries or profiles, or are collecting advanced user info, increase memory allocation proportionally. Note that the data parsing process does utilize extra threads, but the overall impact on performance is less than that of threads used for scraping.\n\n💡 Feature Requests\n\nWe're always looking to improve! Below is a list of potential future features. If you're interested in a particular feature or have your own suggestions, please reach out via our Feature Request Form.\n\nCustomizable queries per user.\nEnhanced input parsing for more forgiving input acceptance.\nCustom timeout settings for better control.\nRecursive replies for in-depth comment scraping.\n🔧 Troubleshooting\nMissing Outputs? Make sure to check all fields, not overview. If you are getting less tweets than total_tweets for a user, this is normal because total_tweets includes retweets while profile scraping does not.\nNo Results? Make sure your parameters are not too narrow.\nUnknown Image In Preview? It's likely that the image collected was from twitpic, which doesn't support previews.\nAn output type you need is missing? Send us a request via this form and we'll see what we can do.\nNot Collecting All Comments? Sensitive or spam-filtered comments are not available for scraping. Replies to replies may not be scraped in a surface-level run. A recursive scraper is currently a work in progress to tackle this.\nNot Getting New Tweets After a Large Amount? Check the log for \"Logging is too fast, some lines were skipped\". Consider scraping smaller total amounts if you hit this issue.\n📝 Notes\nQuacker Twitter-Scraper's Search Functionality: Please note that as of April 2023, Quacker Twitter-Scraper's search functionality has been affected due to Twitter's policy changes.\nTesting Danielmilevski9 Twitter Search: At this time, we do not have the resources to fully test the speed of Danielmilevski9 Twitter Search, as it does not provide a RAM input option. We are open to accepting run data from contributors who can assist with this.\nUser Info Availability: While Quacker provides more user information than Tweet-Flash, rest assured that both tools include essential information such as follower count.\nepcetx Twitter Search Scraper: This tool was not included in our comparison for the sake of brevity and is currently under maintenance.\nQuacker Twitter-Scraper's Replies Depth Input: While Quacker Twitter-Scraper lists a replies depth input under its information, this is not an available option in the input interface, hence it wasn't included in our comparison.\nTweets Per Second: The reported tweets per second metrics have been rounded to the nearest integer for simplicity.\n📞 Contact Us\n\nWe're here to help! If you have any questions or need further assistance, feel free to contact us at help.tweetflash@gmail.com. Let's make your Twitter data scraping experience as smooth and productive as possible!",
    "icon": "https://images.apifyusercontent.com/PFFzpZkqD4QrHkD0T5qnb5W81HFZqRNNpV3K9tTceZ8/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9UZmZraHFGTVhTdDJyVXRXTC9MVE1leUROTENUeldYZGhnbS1Kb25hdGhhbl9MYXJzb25fdHdpdHRlcl9hbmFseXRpY3NfeWVsbG93X3Bob2VuaXhfY29tcGFueV9sb2dvX3Nf.webp",
    "author_url": "https://apify.com/shanes",
    "author_avatar": "https://images.apifyusercontent.com/2d_Yn5pHPJZni1Y_yV7phgtyhE4hJQUWB6avEF6qS1U/rs:fill:192:192/aHR0cHM6Ly9saDMuZ29vZ2xldXNlcmNvbnRlbnQuY29tL2EvQUxtNXd1MEYxb1lmeUhMR3ZiVWRadEpveXNxajJPNk9ram1fRlhfRXIyVVM9czk2LWM.webp",
    "readme_summary": "# Tweet-Flash: The All-In-One Twitter Scraper\n\nTweet-Flash is a Twitter scraper that offers search, URL, and profile scraping capabilities, along with numerous filters for custom data extraction. It costs $0.10 per 1000 tweets and can deliver 40-90 tweets per second.\n\n## Features\n\n- Optional queries for focused data collection\n- Multiple language support\n- Custom time frames for targeted data collection\n- Advanced user information for comprehensive data analysis\n- Multithreading control for efficient resource utilization\n- Advanced filtering options in the interface for precise data extraction\n\n## Custom Time Frame\n\nTo set a custom time frame for tweets, use the `Start` and `End` options in the `Custom Time Frame` section.\n\n## Customize Run\n\nYou can customize your scraping run by adjusting the maximum number of attempts and threads. If the `Manually Set Number of Threads/Workers` field is left blank, the tool will automatically optimize based on available memory.\n\n## Memory and Thread Usage\n\nFor optimal performance, we recommend using no more than 150MB of memory per query or profile. If you're running multiple queries or profiles, or are collecting advanced user info, increase mem"
}