{
    "id": "natasha.lekh/gas-prices-scraper",
    "url": "https://apify.com/natasha.lekh/gas-prices-scraper",
    "title": "Free Gas Prices Scraper · Apify",
    "name": "Gas Prices Scraper",
    "pricing": "No credit card required",
    "description": "⛽ Find lowest gas prices and timestamps of price updates from gas stations in your area. Scrape gas station addresses, gas company names, open/closed status, website, reviews (stars), postal code and more. Download data scraped from Google Maps in various formats including HTML, JSON, and Excel.",
    "author_name": "Natasha Lekh",
    "maintained_by": "Maintained by Apify",
    "count_users": "243 users",
    "count_runs": "60.9k runs",
    "last_modified": "Modified 1 day ago",
    "categories": "Business\nTravel",
    "full_readme": "Whether you're trying to find the cheapest gas stations in your area or lowest gas prices in the US, you can't find all of them quickly without some automation tool. Try our free Gas Stations Scraper!\n\nThere's only two things you have to indicate to gas station details: the area you want to scrape, (e.g. Houston) and the number of gas stations you want to examine. Then hit the \"Save & Start\" button at the bottom of the page and get data on fuel prices, types, and companies anywhere in the world!\n\nCan I use gas station data to make a gas prices app?\n\nYes, you can use the data any way you like. The datasets produced by this scraper are extracted from Google Maps so the data stays relevant. Also, the Gas Station Scraper datasets you will extract can be downloaded in machine-readable formats (HTML, JSON, Excel, CSV) which are perfect for populating applications, reports, and other documents for data analysis.\n\nHere are just some ways scraping gas prices and stations can be useful:\n\nget live data on gas prices from Google Maps\nmonitor gas prices by state, city, or area\nfind details on all gas stations near you: address, phone, website, open/closed status and more\nsee the price range by fuel types: premium gas, midgrade gas, diesel\nautomate keeping an eye on different fuel supplier and gas company offers\n\nFor more inspiration on how to use the extracted Google Maps data, check out our industries pages. See how web scraping results are already being used by companies of all sizes, including manufacturing and logistics.\n\nHow much will it cost me to scrape gas prices?\n\nApify provides you with $5 free usage credits to use every month on the Apify Free plan. For that $5 you can get up to 2,000 data items from this Gas Station Scraper. So it will be completely free for 2,000 results!\n\nIf you need to scrape gas station data on a more regular basis, you should opt for an Apify subscription. We recommend our $49/month Starter plan - that one will cover 20,000 gas station results every month with the free $49 in monthly usage credits!\n\nInput example\n\nThere are just two fields to fill out: the area you want to get data from and the number of results you'd like to receive.\n\nLet's scrape 100 gas stations in Houston, Texas. \n\nThis is how it would look in JSON format:\n\n{\n  \"location\": \"Houston\",\n  \"maxCrawledPlaces\": 100\n}\nOutput example\n\nYou can view the extracted data as a table or change the format and go through all fields. You can manage your results in any language (Python, PHP, Node.js/NPM) and any format (CSV, JSON, HTML, Excel). Last but not least - you can download your data from the Apify platform onto your computer or integrate it with other apps directly with our great range of integrations.\n\nOr, as it would look in JSON format:\n\n[{\n  \"title\": \"Texaco Houston\",\n  \"subTitle\": null,\n  \"price\": null,\n  \"menu\": null,\n  \"categoryName\": \"Gas station\",\n  \"address\": \"5333 Katy Fwy, Houston, TX 77007\",\n  \"locatedIn\": null,\n  \"neighborhood\": \"5333 Katy Fwy\",\n  \"street\": \"5333 Katy Fwy\",\n  \"city\": \"Houston\",\n  \"postalCode\": \"77007\",\n  \"state\": \"Texas\",\n  \"countryCode\": \"US\",\n  \"plusCode\": \"QHGM+M2 Washington Avenue Coalition / Memorial Park, Houston, TX\",\n  \"website\": \"http://www.texaco.com/\",\n  \"phone\": \"(713) 861-7240\",\n  \"temporarilyClosed\": false,\n  \"location\": {\n    \"lat\": 29.7767003,\n    \"lng\": -95.4174596\n  },\n  \"permanentlyClosed\": false,\n  \"totalScore\": 3,\n  \"isAdvertisement\": false,\n  \"rank\": 21,\n  \"placeId\": \"ChIJl_XcfzbHQIYRgRBOGELqZ7c\",\n  \"categories\": [\n    \"Gas station\",\n    \"Auto repair shop\",\n    \"Convenience store\",\n    \"Diesel fuel supplier\",\n    \"Fuel pump\",\n    \"Gas company\"\n  ],\n  \"cid\": \"13215789201138520193\",\n  \"url\": \"https://www.google.com/maps/place/Texaco+Houston/@29.7767003,-95.4174596,17z/data=!3m1!4b1!4m5!3m4!1s0x8640c7367fdcf597:0xb767ea42184e1081!8m2!3d29.7766652!4d-95.4174594?hl=en\",\n  \"searchPageUrl\": \"https://www.google.com/maps/search/gas+station+in+Houston/@42.0839424,-72.0371712,14z?hl=en\",\n  \"searchString\": \"gas station in Houston\",\n  \"scrapedAt\": \"2022-07-12T16:37:36.783Z\",\n  \"reviewsCount\": 8,\n  \"reviewsDistribution\": {\n    \"oneStar\": 3,\n    \"twoStar\": 1,\n    \"threeStar\": 0,\n    \"fourStar\": 1,\n    \"fiveStar\": 3\n  },\n  \"imageUrls\": [\n    \"https://lh5.googleusercontent.com/p/AF1QipMktjTD6ylmcKfx5_urprrU775a0p4cFcDZGX4V=w1920-h1080-k-no\"\n  ],\n  \"reviews\": [],\n  \"orderBy\": [],\n  \"gasPrices\": [\n    {\n      \"priceTag\": \"$4.76\",\n      \"updatedAt\": \"2022-07-11T16:53:35.000Z\",\n      \"unit\": \"gallon\",\n      \"currency\": \"USD\",\n      \"price\": 4.76,\n      \"gasType\": \"Midgrade\"\n    },\n    {\n      \"priceTag\": \"$5.26\",\n      \"updatedAt\": \"2022-07-11T06:25:09.000Z\",\n      \"unit\": \"gallon\",\n      \"currency\": \"USD\",\n      \"price\": 5.26,\n      \"gasType\": \"Premium\"\n    }\n  ]\n},\n  ...\nFAQ\nCan I integrate Gas Prices Scraper with other apps?\n\nLast but not least, Gas Prices Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Gas Prices Scraper successfully finishes a run.\n\nCan I use Gas Prices Scraper with API?\n\nYes. The Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nTo access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nNeed to scrape emails from Google Maps?\n\nLooking to scrape contact information from Google Maps? Give our Google Maps Email Extractor a try! This email scraper allows you to extract almost any contact data from Google places: emails, addresses, phone numbers, and social media details. You can also follow this tutorial to get started.\n\nNeed a more advanced scraper for Google Maps?\n\nIf you need more detailed data from Google Maps, try our Google Maps Scraper. It's a little more complicated to set up but you can get almost any data from Google Maps. You can always just follow this comprehesive guide. Or try one of these other map scrapers:\n\n🧭 Google Maps Itinerary\t🍃 Easy Google Maps Scraper\n⭐️ Google Maps Reviews Scraper\t🤟 Google Datasets Translator\n🍎 Apple Maps Scraper\t📍 OCR for Google Map pins",
    "icon": "https://images.apifyusercontent.com/WCcQNlcSuJB5zTqmJVMjEnimNj_aXrN3xV488QyJRTs/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9TUmh3MGRGNTNwY25DaGR2TC9EQXIzckVLSHpuNWpwcGVoUC1pbWFnZS5wbmc.webp",
    "author_url": "https://apify.com/natasha.lekh",
    "author_avatar": "https://images.apifyusercontent.com/_dPH7fU_uWGm5PVsSCZvxHcStSWG_KRv2v1U31a8LmA/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9nd2lEZ21CbUdCTk42N2FYai9YNm1ZeUo0MlBQS0pyNUd0bi1uYXRhc2hhLmpwZw.webp",
    "readme_summary": "⛽ Find lowest gas prices and timestamps of price updates from gas stations in your area. Scrape gas station addresses, gas company names, open/closed status, website, reviews (stars), postal code and more. Download data scraped from Google Maps in various formats including HTML, JSON, and Excel."
}