{
    "id": "apify/instagram-reel-scraper",
    "url": "https://apify.com/apify/instagram-reel-scraper",
    "title": "Free Instagram Post Scraper · Apify",
    "name": "Instagram Reel Scraper",
    "pricing": "No credit card required",
    "description": "Use this no-code Instagram tool for scraping data from Instagram reels. Just add one or more Instagram usernames and get your data in seconds including hashtags, mentions, comments, images, likes, locations, and metadata. Download Instagram data in JSON, Excel, HTML and other formats.",
    "author_name": "Apify",
    "maintained_by": "Maintained by Apify",
    "count_users": "1.2k users",
    "count_runs": "59.2k runs",
    "last_modified": "Modified about 1 month ago",
    "categories": "Social media",
    "full_readme": "Have you ever wanted to scrape data from Instagram Reels, but it seemed too complicated or techie? Our Instagram Post Scraper has got you covered!\n\nJust decide whose Instagram reels you want to scrape (e.g. @nasa) and how many recent reels you need (let's say 314) and you're good to start scraping.\n\nWhat does Instagram Reel Scraper do?\n\nOur free Instagram Post Scraper allows you to scrape public reels from any Instagram user. Just enter one or more Instagram usernames and you can extract and download all their reels and their details onto your computer.\n\nYou can download that structured data in Excel, HTML, XML, CSV, Excel, and JSON to use in reports, data visualizations, spreadsheets, and applications.\n\nHow many results can you scrape with Instagram Reels scraper?\n\nInstagram Reels scraper can return up to 10k results - on a good day. (And of course, if there are that many.)\n\nYou have to keep in mind that scraping Instagram Reels is dynamic and subject to change. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors.\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping Instagram Reels cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nHow to scrape Instagram reels\n\nInstagram Post Scraper was created to be fast and easy to use. We've made two tutorials that should solve the learning question for you: a simple guide and a quick video ▷\n\nWant to scrape Instagram hashtags, profiles, or comments?\n\nUse our super fast and easy dedicated scrapers if you want to scrape specific Instagram data. There are fewer settings to change and faster results. Just enter one or more Instagram usernames or URLs and click Start to scrape Instagram.\n\nInstagram Hashtag Scraper\n\nInstagram Profile Scraper\n\nInstagram Comment Scraper\n\nNeed something more advanced?\n\nTry our more advanced Instagram Scraper if you need more options and are comfortable with changing settings. Let us know if you need a custom Instagram scraping solution.\n\nHow can you use Instagram reels data?\n\nSo what can you do with all that data you collect by web scraping? Here are just some ideas:\n\nimprove your market research\n\nhelp you optimize your marketing and PR\n\nassist with sentiment analysis\n\nhelp you understand audience engagement\n\ndatasets containing thousands or millions of Instagram reels can be used to train your AI models, monitor fake news, or fight hate speech.\n\nInput parameters\n\nThere are just two fields to fill out: an Instagram username (one or multiple) and the number of results you'd like to receive. Let's scrape the recent Instagram reels from Volodymyr Zelenskiy's Instagram account.\n\nOr, as it would look in JSON format:\n\n\n{\n\n\"username\": [\"zelenskiy_official\"],\n\n\"resultsLimit\": 10\n\n}\n\nInstagram output\n\nEach item will be a separate item in the dataset. You can view the extracted data as an overview table or see all fields in different formats. You can then export them from the platform onto your computer or integrate with other apps directly.\n\nOr, as it would look in JSON format:\n\n[{\n  \"id\": 2977396167815083500,\n  \"type\": \"ReelVideo\",\n  \"shortCode\": \"ClR1goqOjUm\",\n  \"caption\": \"We are rolling out our new \\\"Points of Invincibility\\\" project to support people across the country. As of this day, more than 4,000 such points have already been prepared. More are planned.\\n\\nIf massive Russian strikes take place again and if there is an understanding that the electricity supply cannot be restored within hours, the work of \\\"Points of Invincibility\\\" will be activated - all basic services will be there, including electricity, mobile communications and the Internet, heat, water, and a first-aid kit. Absolutely free and 24/7.\\n\\nPoints will necessarily work at all regional and district administrations, as well as at schools, buildings of the State Emergency Service, etc.\\n\\nA special website, nezlamnist.gov.ua, with a map of such points throughout the country is already available. It is constantly updated.\\n\\nOn the website and in all \\\"Points of Invincibility\\\" you will be able to find out where the nearest gas station, bank, pharmacy and grocery store are operating.\\n\\nAll of us must be prepared for any scenario, considering what terrorists are fighting against our people and what they are trying to do.\\nI am sure: by helping each other, we will all be able to get through this winter together.\",\n  \"hashtags\": [],\n  \"mentions\": [],\n  \"url\": \"https://www.instagram.com/reel/ClR1goqOjUm/\",\n  \"commentsCount\": 333,\n  \"dimensionsHeight\": 3000,\n  \"dimensionsWidth\": 1690,\n  \"images\": [\n    \"https://instagram.fuln1-2.fna.fbcdn.net/v/t51.2885-15/316400537_1487126755124325_6072039105868505731_n.jpg?stp=dst-jpg_e35_p828x828_sh0.08&_nc_ht=instagram.fuln1-2.fna.fbcdn.net&_nc_cat=1&_nc_ohc=yHUk8cd-GcEAX8xVByU&edm=ACHbZRIBAAAA&ccb=7-5&ig_cache_key=Mjk3NzM5NjE2NzgxNTA4MzMwMg%3D%3D.2-ccb7-5&oh=00_AfCrsoT9YxkVNGlanbRFPpRDXoqynuRQri2qQUV_WOk2qg&oe=63812BF4&_nc_sid=4a9e64\",\n    \"https://instagram.fuln1-2.fna.fbcdn.net/v/t51.2885-15/316400537_1487126755124325_6072039105868505731_n.jpg?stp=dst-jpg_e15_p320x320&_nc_ht=instagram.fuln1-2.fna.fbcdn.net&_nc_cat=1&_nc_ohc=yHUk8cd-GcEAX8xVByU&edm=ACHbZRIBAAAA&ccb=7-5&ig_cache_key=Mjk3NzM5NjE2NzgxNTA4MzMwMg%3D%3D.2-ccb7-5&oh=00_AfCcM55FdrSdFduyVO2NiAEXrKg_5ur2TkHg3Fzd74Y1Eg&oe=63812BF4&_nc_sid=4a9e64\"\n  ],\n  \"videoUrl\": \"https://instagram.fuln1-2.fna.fbcdn.net/v/t50.2886-16/10000000_650164979927338_5879441595623416367_n.mp4?_nc_ht=instagram.fuln1-2.fna.fbcdn.net&_nc_cat=110&_nc_ohc=qSRAaHhlIVsAX_9NixA&edm=ACHbZRIBAAAA&ccb=7-5&oh=00_AfA2mpXgIzhZT-TPjLYT6S339JAGn4oRbyQ1KT_kXHrFHg&oe=637EE950&_nc_sid=4a9e64\",\n  \"likesCount\": 22110,\n  \"videoViewCount\": 93699,\n  \"timestamp\": \"2022-11-22T21:42:42.000Z\",\n  \"ownerFullName\": \"Володимир Зеленський\",\n  \"ownerUsername\": \"zelenskiy_official\",\n  \"ownerId\": 4731970969,\n  \"productType\": \"clips\",\n  \"isSponsored\": false,\n  \"videoDuration\": 380.459\n}]\n\n\nYou can manage the results in any language (Python, PHP, Node.js/NPM). See the Apify API docs to learn more about getting results from the scraper.\n\nIs it legal to scrape Instagram?\n\nOur Instagram scrapers are ethical and do not extract any private user data such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. We therefore believe that our scrapers, when used for ethical purposes by Apify users, are safe. However, you should be aware that your results could contain personal data. Personal data is protected by the GDPR in the European Union and by other regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping.\n\nIntegrations and Instagram Reel Scraper\n\nLast but not least, Instagram Reel Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Instagram API Scraper successfully finishes a run.\n\nUsing Instagram Reel Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nTo access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nNot your cup of tea? Build your own scraper\n\nInstagram Reels Scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Instagram Reels Scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/mGtmMJUveUWbohfsajEatWSoLZ_4ELedJW9xDYV3WF4/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS94TWM1R2Exb0NPTlBtV0pJYS9jZ2JLeHpyQjN4MkR4eXNRYi1JbnN0YWdyYW1fUmVlbF9TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/apify",
    "author_avatar": "https://images.apifyusercontent.com/lI97nKRfQNn-301fZooeDiLELKwBtOreoKdvb-R9XnI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9ac2NNd0ZSNUg3ZUN0V3R5aC9ZcXRrUW1FeFpwbU1kNmRKUS1hcGlmeV9zeW1ib2xfd2hpdGVfYmcucG5n.webp",
    "readme_summary": "Use this no-code Instagram tool for scraping data from Instagram reels. Just add one or more Instagram usernames and get your data in seconds including hashtags, mentions, comments, images, likes, locations, and metadata. Download Instagram data in JSON, Excel, HTML and other formats."
}