{
    "id": "yin/yelp-scraper",
    "url": "https://apify.com/yin/yelp-scraper",
    "title": "Free Yelp Web Scraper - get reviews and more · Apify",
    "name": "Yelp Scraper",
    "pricing": "No credit card required",
    "description": "Free Yelp web scraper to extract data from Yelp. Fast Yelp review scraper, but also gets business details and ratings without using the Yelp API.",
    "author_name": "Matej Gagyi",
    "maintained_by": "Maintained by Apify",
    "count_users": "2.2k users",
    "count_runs": "92k runs",
    "last_modified": "Modified about 2 months ago",
    "categories": "Business",
    "full_readme": "What does Yelp Scraper do?\n\nYelp Scraper is an Apify actor that allows you to extract data from Yelp quickly. It can extract business details, ratings, and reviews without using the Yelp API.\n\nYelp Scraper can scrape:\n\nBusiness name\nAddress\nPhone number\nRating\nReview text\nWhy scrape Yelp?\n\nYelp is a popular platform for finding local businesses, with millions of reviews and ratings. It is an excellent source of data for businesses looking to improve their online presence or conduct market research.\n\nHere are some ways you could use Yelp data:\n\nAnalyze customer sentiment and improve your product or service based on feedback\nIdentify popular businesses in a specific area to inform business decisions\nTrack competitors and monitor customer sentiment towards them\n\nIf you would like more inspiration on how scraping Yelp could help your business or organization, check out our industry pages.\n\nHow to scrape Yelp\n\nIt's easy to scrape Yelp with Yelp Scraper. Just follow these few steps, and you'll get your data in a few minutes.\n\nClick on Try for free.\nEnter the search terms or location you want to scrape.\nClick on Run.\nWhen Yelp Scraper has finished, preview or download your data from the Dataset tab.\nHow many results can you scrape with Yelp scraper?\n\nYelp scraper can return up to 240 results on average. However, you have to keep in mind that scraping yelp.com has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping Yelp cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nOutput\n\nHere's an example of Yelp Scraper's output:\n\n{\n    \"businessName\": \"Example Business\",\n    \"address\": \"123 Main St\",\n    \"phoneNumber\": \"(555) 555-1234\",\n    \"rating\": 4.5,\n    \"reviewText\": \"Great service and delicious food!\"\n}\nTips for scraping Yelp\nUse relevant search terms to get the most accurate results.\nBe mindful of Yelp's terms of service and follow them to avoid legal issues.\nIs it legal to scrape Yelp?\n\nNote that personal data is protected by GDPR in the European Union and by other regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. We also recommend that you read our blog post: is web scraping legal?\n\nNot your cup of tea? Build your own scraper\n\nYelp scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for xxx or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/Aups1T1CLxitcO5PENGaqplACIqtfB0JSvfnW1rIAkk/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9iZjU0VGZyS29KclFac3JabS9iM1NHSmhMNUhFU3YzZGE0Zi15ZWxwLWNvbXB1dGVyLWljb25zLWxvZ28taWNvbi1kZXNpZ24tcG5nLWZhdnBuZy1ETGk4dXdCeTA2M3VVSnZ5.webp",
    "author_url": "https://apify.com/yin",
    "author_avatar": "https://images.apifyusercontent.com/p2JmsQ8Vc_Pv9NTuTcaQfxEOiaKATh0d7daXUw0cO0M/rs:fill:192:192/aHR0cHM6Ly9jZG4uYXBpZnkuY29tL2ltZy9pY29ucy9hbm9ueW1vdXNfdXNlcl9waWN0dXJlLnBuZw.webp",
    "readme_summary": "The Yelp Scraper is an Apify actor that extracts data from Yelp, including business details, ratings, and reviews. It can scrape business name, address, phone number, rating, and review text. To use it, click on 'Try for free', enter the search terms or location you want to scrape, click on 'Run', and download your data from the Dataset tab once the scraper has finished. The scraper can return up to 240 results on average, but this may vary depending on various factors. The cost of scraping can be estimated by running a test scrape. The output of the scraper is a JSON object with the business name, address, phone number, rating, and review text. Be mindful of Yelp's terms of service and legal regulations when scraping. If the Yelp scraper doesn't meet your needs, you can build your own scraper using Apify's templates or open-source library. For any technical feedback or bugs, create an issue on the Actor’s Issues tab in Apify Console."
}