{
    "id": "alexey/pinterest-crawler",
    "url": "https://apify.com/alexey/pinterest-crawler",
    "title": "Pinterest Scraper · Apify",
    "name": "Pinterest Scraper",
    "pricing": "No credit card required",
    "description": "Our free Pinterest Scraper allows you to get \"pins\" along with a user's profile. This unofficial Pinterest API is designed to give you more details than you can see in the web interface. It also enables you to extract public data from Pinterest without limits.",
    "author_name": "Alexey Udovydchenko",
    "maintained_by": "Maintained by Community",
    "count_users": "666 users",
    "count_runs": "4.9k runs",
    "last_modified": "Modified over 1 year ago",
    "categories": "Social media",
    "full_readme": "What does Pinterest Scraper do?\n\nOur free Pinterest Scraper allows you to extract \"pins\" along with a user's profile.\n\nThis unofficial Pinterest API is designed to give you more details than you can see in the web interface. It also enables anyone to extract public data from Pinterest without limits.\n\nThe Pinterest data scraper supports the following features:\n\nScrape profiles - get metadata from the profile\nScrape pins with full details - different kinds of pins will be parsed accordingly\nHow to use Pinterest Scraper\n\nFor a step-by-step guide on how to use Pinterest Scraper, read How to scrape data on Pinterest in 5 easy steps, or watch our video tutorial on YouTube.\n\nHow much does Pinterest Scraper cost?\n\nIt will cost you approx. USD 0.25 to scrape 1,000 pins. The more results you want to scrape, the more time it will take and the more usage credits it will cost.\n\nApify provides you with USD 5 free usage credits to use every month on the Apify Free plan so you can get up to 20,000 pins from Pinterest Scraper for those credits. So 20,000 results will be completely free!\n\nBut if you need to get more data or to get your data regularly you should grab an Apify subscription. We recommend our $49/month Personal plan - you could get up to 200,000 Pinterest pins reviews every month with the $49 monthly plan!\n\nWhy scrape Pinterest?\n\nAutomatically gather data from this image sharing and social media service designed to enable the saving and discovery of images, animated GIFs, and videos.\n\nSo what can you do with that data? Here are some ideas:\n\nCollect data about your audience. How many subscribers do they have on average? Are they active on Pinterest? What sites do they have?\nFind the best subscribers. Make a shortlist of your ideal subscribers and actively pursue them by sending them DMs and offering partnerships!\nCollect data about your competitor's audience.\n\nIf you want more ideas, check out our industries pages for ways web scraping is already being used in a wide range of companies.\n\nSettings and proxies\nProfile names and URLs\n\nYou need to provide a list of profile names or Pinterest URLs (they can be mixed in any order).\n\nUsing proxies\n\nPinterest now allows access under any type of proxies.\n\nCustom proxies\n\nYou can also use proxies from other providers in the custom proxies fields (proxyURLs in the JSON settings).\n\nIs it legal to scrape Pinterest?\n\nWeb scraping is legal, but you should be aware that your results could contain personal data. Personal data is protected by GDPR in the European Union and by other regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping.",
    "icon": "https://images.apifyusercontent.com/rdHcTyJnGaY3x8OrHxxe9XygClPGEcFlJGEA49q-m0c/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9sa1VDRDBMYjNmSGlRTVM1bS84WUdzQ3Z4eVNjTTNOWGdpRi1waW50ZXJlc3QucG5n.webp",
    "author_url": "https://apify.com/alexey",
    "author_avatar": "https://images.apifyusercontent.com/8yakwdbgCTy_KkbUtg8KD8o50peMa3Mo5kCPlaXQMyM/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS93TTRGek5acUo4ektlQmk3eC9CN0ptRm5YaXdwczRqektpYy1wcm9maWxlMjAyMV8yNTAucG5n.webp",
    "readme_summary": "Our free Pinterest Scraper allows you to extract \"pins\" along with a user's profile. This unofficial Pinterest API is designed to give you more details than you can see in the web interface. It also enables anyone to extract public data from Pinterest without limits."
}