{
    "id": "junglee/free-amazon-product-scraper",
    "url": "https://apify.com/junglee/free-amazon-product-scraper",
    "title": "Free Amazon Product Scraper · Apify",
    "name": "Free Amazon Product Scraper",
    "pricing": "No credit card required",
    "description": "Gets you product data from Amazon. Unofficial API. Scrapes and downloads product information without using the Amazon API, including reviews, prices, descriptions, and ASIN.",
    "author_name": "Junglee",
    "maintained_by": "Maintained by Apify",
    "count_users": "1.7k users",
    "count_runs": "14.2k runs",
    "last_modified": "Modified 1 day ago",
    "categories": "E-commerce",
    "full_readme": "What is Free Amazon Product Scraper and how does it work?\n\nFree Amazon Product Scraper is a web scraping tool that enables you to extract product data from Amazon by using Amazon's category URLs.\n\nSimply insert the URL from Amazon in the input field and select the maximum number of items you want to scrape. Then download the data from the Dataset tab.\n\nFor an input example, check the Input tab.\n\n7 pages Amazon limitation\n\nAmazon sometimes restricts search terms to a maximum of 7 pages, please validate the number of pages in the URL. To overcome this limit, try to use one of the regular categories and combine it with the search terms. E.g. instead of just searching for Diamond rings, find Jewelry or Women's rings category and combine them with the search term.\n\nHow much will scraping with Free Amazon Product Scraper cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nNeed to find product pairs between Amazon and another online shop?\n\nTry our AI Product Matcher. This AI model was created to compare items from different web stores, identifying exact matches and comparing real-time data obtained via web scraping. With the AI Product Matcher, you can use scraped product data to monitor product matches across the industry, implement dynamic pricing for your website, replace or complement manual mapping, and obtain realistic estimates against your competition for upcoming promo campaigns.\n\nMost importantly, it is relatively easy to get started with (just follow this Product Matcher guide), and it can check thousands of pairs of products.\n\nWhy scrape Amazon products?\n\nScraping Amazon products can help you to:\n\nmonitor the performance of categories and subcategories on Amazon so you can put the performance of your own products into context.\ndiscover up-and-coming brands and products to benchmark your performance within its category based on views, conversions and reviews.\nfine-tune your advertising and messaging.\nSample output from Free Amazon Product Scraper\n{\n    \"title\": \"SanDisk 1TB Extreme microSDXC UHS-I Memory Card with Adapter - Up to 190MB/s, C10, U3, V30, 4K, 5K, A2, Micro SD Card- SDSQXAV-1T00-GN6MA\",\n    \"url\": \"https://www.amazon.com/dp/B09X7MPX8L\",\n    \"asin\": \"B09X7MPX8L\",\n    \"inStock\": true,\n    \"inStockText\": \"Only 8 left in stock - order soon.       Only 8 left in stock - order soon.\",\n    \"brand\": \"SanDisk\",\n    \"price\": {\n        \"value\": 145.5,\n        \"currency\": \"$\"\n    },\n    \"listPrice\": {\n        \"value\": 299.99,\n        \"currency\": \"$\"\n    },\n    \"shippingPrice\": null,\n        \"stars\": 4.8,\n        \"starsBreakdown\": {\n        \"5star\": 0.86,\n        \"4star\": 0.09,\n        \"3star\": 0.02,\n        \"2star\": 0.01,\n        \"1star\": 0.01\n    },\n    \"reviewsCount\": 36704,\n    \"answeredQuestions\": 151,\n    \"breadCrumbs\": \"Electronics › Computers & Accessories › Computer Accessories & Peripherals › Memory Cards › Micro SD Cards\",\n    \"thumbnailImage\": \"https://m.media-amazon.com/images/I/716kSUlHouL.__AC_SX300_SY300_QL70_FMwebp_.jpg\",\n    \"description\": null,\n    \"features\": [\n    \"Save time with card offload speeds of up to 190MB/s powered by SanDisk QuickFlow Technology (Up to 190MB/s read speeds, engineered with proprietary technology to reach speeds beyond UHS-I 104MB/s, requires compatible devices capable of reaching such speeds. Based on internal testing; performance may be lower depending upon host device interface, usage conditions and other factors. 1MB=1,000,000 bytes. SanDisk QuickFlow Technology is only available for 64GB, 128GB, 256GB, 400GB, 512GB, and 1TB capacities. 1GB=1,000,000,000 bytes and 1TB=1,000,000,000,000 bytes. Actual user storage less.)\",\n    \"Pair with the SanDisk Professional PRO-READER SD and microSD to achieve maximum speeds (sold separately)\",\n    \"Up to 130MB/s write speeds for fast shooting (Based on internal testing; performance may be lower depending upon host device interface, usage conditions and other factors. 1MB=1,000,000 bytes.)\",\n    \"4K and 5K UHD-ready with UHS Speed Class 3 (U3) and Video Speed Class 30 (V30) (Compatible device required. Full HD (1920x1080), 4K UHD (3840 x 2160), and 5K UHD (5120 X 2880) support may vary based upon host device, file attributes and other factors. See HD page on SanDisk site. UHS Speed Class 3 (U3) designates a performance option designed to support real-time video recording with UHS-enabled host devices. Video Speed Class 30 (V30), sustained video capture rate of 30MB/s, designates a performance option designed to support real-time video recording with UHS-enabled host devices. See the SD Association’s official website.)\",\n    \"Rated A2 for faster loading and in-app performance (A2 performance is 4000 read IOPS, 2000 write IOPS. Results may vary based on host device, app type and other factors)\"\n    ],\n    \"variantAsins\": [],\n    \"reviewsLink\": \"/SanDisk-Extreme-microSDXC-Memory-Adapter/product-reviews/B09X7MPX8L?reviewerType=all_reviews\",\n    \"delivery\": \"Thursday, January 26\",\n    \"fastestDelivery\": \"Sunday, January 22\",\n    \"returnPolicy\": \"Eligible for Return, Refund or Replacement within 30 days of receipt  Eligible for Return, Refund or Replacement within 30 days of receipt\",\n    \"support\": \"Free Amazon tech support included\",\n    \"variantAttributes\": [],\n    \"priceVariants\": null,\n    \"seller\": {\n        \"name\": \"Direct Suppliers US\",\n        \"id\": \"A210SJF12S88M5\",\n        \"url\": \"/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A210SJF12S88M5&asin=B09X7MPX8L&ref_=dp_merchant_link&isAmazonFulfilled=1\",\n        \"reviewsCount\": null,\n        \"averageRating\": null\n    },\n    \"bestsellerRanks\": null,\n    \"locationText\": \"Select your address\"\n}\nIs it legal to scrape Amazon?\n\nIt is legal to scrape publicly available data such as product descriptions, prices or ratings. Read our blog post on the legality of web scraping to learn more.\n\nNot your cup of tea? Build your own scraper\n\nFree Amazon Product Scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for xxx or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/hJpZ5QxVbMhG8LGApYsxrnhNVrtYRNDxOs_ue3P1GKo/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9YVkRUUWM0YTdNRFRxU1RNSi90aFBUcmhlNVN3dFhUWkNGaC1GcmVlX0FtYXpvbl9Qcm9kdWN0X1NjcmFwZXIucG5n.webp",
    "author_url": "https://apify.com/junglee",
    "author_avatar": "https://images.apifyusercontent.com/enEGfGMfQOShgB0snHpnOHGPBhPeEUZhrvbo7VE92AU/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMudXMtZWFzdC0xLmFtYXpvbmF3cy5jb20vVFg0clBKQkhiaFNLaTIzWHMvSFl6Umtmc204aGlOVEo3SnAtSnVuZ2xlZS5wbmc.webp",
    "readme_summary": "Gets you product data from Amazon. Unofficial API. Scrapes and downloads product information without using the Amazon API, including reviews, prices, descriptions, and ASIN."
}