{
    "id": "streamers/youtube-comments-scraper",
    "url": "https://apify.com/streamers/youtube-comments-scraper",
    "title": "💬 Youtube Comments Scraper · Apify",
    "name": "Youtube Comments Scraper",
    "pricing": "Pay $2.00 for 1,000 comments",
    "description": "This alternative YouTube Data API has no limits or quotas. Extract YouTube comments data from one or multiple YouTube videos: full comment text, posting date, author username, video title, videoId. Download YouTube comments in JSON, CSV, and Excel.",
    "author_name": "Streamers",
    "maintained_by": "Maintained by Apify",
    "count_users": "199 users",
    "count_runs": "2k runs",
    "last_modified": "Modified 4 days ago",
    "categories": "Videos\nSocial media\nEducation",
    "full_readme": "What is YouTube Comment Scraper?\n\nYouTube Comments Scraper is a data extraction tool created for scraping comments from YouTube. As soon as you provide a video URL, you will be able to extract:\n\nall comments from chosen YouTube videos\ncomment text, author name, and date posted\ntotal comments count\nHow do I use YouTube Comment Scraper?\n\nYouTube Comments Scraper is designed to be user-friendly, even for those who have never extracted data from YouTube before, Here’s how you can use YouTube Comment Scraper to extract YouTube comment data:\n\nCreate an Apify account.\nOpen YouTube Comments Scraper.\nAdd one or more YouTube video URLs to scrape comments.\nClick the “Start” button and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\n⬇️ Input example\n\nThe input for YouTube Comments Scraper should be a YouTube video URL. You can add as many URLs as you want or even import a CSV file or Google Sheet with a prepared list of URLs. Then choose how many results you would like to extract and click Start. Click on the input tab for a full explanation of an input example in JSON.\n\n{\n  \"videoUrls\": [\n    \"<https://www.youtube.com/watch?v=dQw4w9WgXcQ>\"\n  ]\n}\n⬆️ Output sample\n\nThe scraped YouTube comments will be shown as a dataset which you can find in the Storage tab. Note that the output is organized as a table for viewing convenience, but it doesn’t show all the fields:\n\n\n\n\nYou can preview all the fields and choose in which format to download the YouTube comments you’ve extracted: JSON, Excel, HTML table, CSV, or XML. Here below is the same dataset in JSON:\n\n{\n    \"comment\": \"This is up there with their best songs.\",\n    \"cid\": \"UgxRn0_LUxzRP2MybPR4AaABAg\",\n    \"author\": \"@Nonie_Jay\",\n    \"videoId\": \"bJTjJtRPqYE\",\n    \"pageUrl\": \"https://www.youtube.com/watch?v=bJTjJtRPqYE\",\n    \"commentsCount\": 171,\n    \"title\": \"Halestorm - Unapologetic [Official Audio]\"\n  },\n  {\n    \"comment\": \"Way better in SHOW 😂 ❤️it Lizzy!!\",\n    \"cid\": \"UgzggDW9vLDoz6Di0Vd4AaABAg\",\n    \"author\": \"@julesharger2786\",\n    \"videoId\": \"bJTjJtRPqYE\",\n    \"pageUrl\": \"https://www.youtube.com/watch?v=bJTjJtRPqYE\",\n    \"commentsCount\": 171,\n    \"title\": \"Halestorm - Unapologetic [Official Audio]\"\n  },\n  {\n    \"comment\": \"Can't believe it's been almost 5 years since this album came out!! ❤❤\",\n    \"cid\": \"UgzU858E1UQw5IoHvDl4AaABAg\",\n    \"author\": \"@mondler107\",\n    \"videoId\": \"bJTjJtRPqYE\",\n    \"pageUrl\": \"https://www.youtube.com/watch?v=bJTjJtRPqYE\",\n    \"commentsCount\": 171,\n    \"title\": \"Halestorm - Unapologetic [Official Audio]\"\n  },\n...\nWant to try other YouTube APIs and scrapers?\n\nUse the dedicated scrapers below if you want to scrape specific public data from YouTube. Each of them is built particularly for the relevant scraping case be it videos, comments, or channel data. Feel free to browse them:\n\n📨 Youtube Channel Email Finder\t✂️ Youtube Shorts Scraper\t📹 YouTube Scraper\t📀 YouTube and All Videos PRO Scraper\nFAQ\nIs YouTube comments scraping legal?\n\nOur YouTube scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. However, you should be aware that your results could contain personal data. You should not scrape personal data unless you have a legitimate reason to do so.\n\nIf you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nDo I need proxies to scrape YouTube comments?\n\nIf you run the scraper on the Apify platform, for successful YouTube scraping you will need residential proxies which are included in Apify's monthly Starter plan ($49).\n\nFor more details about how our pricing works, platform credits, proxies, and usage, see the platform pricing page.\n\nCan I integrate YouTube Comments Scraper with other apps?\n\nLast but not least, YouTube Comments Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with LangChain, Make, Trello, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, Asana, and more.\n\nYou can also use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever YouTube Comment Scraper successfully finishes a run.\n\nCan I use YouTube Comments Scraper with the API?\n\nYes. You can do so using Apify API which will enable you to manage, schedule, and run any Apify Actors, including this one. The API also lets you access any datasets, monitor Actor performance, fetch results, create and update versions, and more. To access the API using Node.js, use the apify-client NPM package. To access the API using Python for scraping YouTube comments, use the apify-client PyPi package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nHow to use data after web scraping YouTube comments?\n\nThe data extracted from YouTube Comment Scraper can be used for a variety of purposes, including:\n\nSentiment analysis to understand user feedback and reactions.\nTracking trending topics or keywords through comment frequency.\nStudying user engagement and interaction with videos or channels.\nIncorporating user suggestions to enhance products or content.\nUnderstanding the audience's interests and demographics.\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for YouTube Comment Scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/20xMIU54-RZXEM_UZzYRrlG13xuBNL_LVKfQ450oviE/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9wN1VNZHBRbmpLbW1wUjIxRC9YSzNpOXZlNzVqaVhTa0VxMy1Zb3V0dWJlX2NvbW1lbnRzLnBuZw.webp",
    "author_url": "https://apify.com/streamers",
    "author_avatar": "https://images.apifyusercontent.com/70VurDNEbRFqlXLcK9_ODhuHQG8QzdXS2p4VprNqDnU/rs:fill:192:192/aHR0cHM6Ly93d3cuZ3JhdmF0YXIuY29tL2F2YXRhci81YjY1ZDdlNmUwNDZjYjZiODZhZDU2ZDQ3MjU3Mzc0MT9kPWh0dHBzJTNBJTJGJTJGY2RuLmFwaWZ5LmNvbSUyRmltZyUyRmFub255bW91c19vcmdhbml6YXRpb25fcGljdHVyZS5wbmc.webp",
    "readme_summary": "This alternative YouTube Data API has no limits or quotas. Extract YouTube comments data from one or multiple YouTube videos: full comment text, posting date, author username, video title, videoId. Download YouTube comments in JSON, CSV, and Excel."
}