{
    "id": "glosterr/soccerstats-scraper",
    "url": "https://apify.com/glosterr/soccerstats-scraper",
    "title": "Soccerstats football scraper · Apify",
    "name": "SoccerSTATS.com Scraper",
    "pricing": "No credit card required",
    "description": "Actor to get football data from popular football leagues for 2021-2022 and 2020-2021 seasons. Soccer data includes matchweeks, tables, and schedules from 15+ European football leagues.",
    "author_name": "glosterr",
    "maintained_by": "Maintained by Community",
    "count_users": "226 users",
    "count_runs": "1.4k runs",
    "last_modified": "Modified almost 2 years ago",
    "categories": "News\nSports",
    "full_readme": "SoccerSTATS.com Scraper\n\nDescription: Actor to get football data from popular football leagues for 2021-2022 and 2020-2021 seasons. Soccer data includes matchweeks, tables, and schedules from 15+ European football leagues.\n\nOur SoccerSTATS.com Scraper provides an unofficial SoccerSTATS API for extracting the data on match results, schedules, progress over the weeks, etc. Using this scraper, you can pull data from the soccerstats.com website; it works best with leagues and matches pages.\n\nFeatures\n\nSo far, there are four main types of soccer stats data you can collect:\n\nresults from league tables containing statistics of how every team has been performing within the current league: the games played, wins vs. losses, goal differences, etc. It can contain leagues happening in one or different countries.\nthe entire season schedule for one or multiple leagues.\nall available statistics of the current matchday for selected leagues.\nget the soccer games data from a specific range of matchdays— for instance, data from week 1 till week 7.\nCost of usage\n\nFollowing our basic plan, the scraper's run will extract you 1,000 results for less than 1 USD credits. For more details about the plans we offer, platform credits, and usage, see the platform pricing page.\n\nIf you're not sure how much credit you've got on your plan and whether you might need to upgrade, you can always check your limits in the Settings -> Usage and Billing tab in your Console. The easiest way to know how many credits your actor will need is to perform a test run.\n\nTutorial\n\nFor a more detailed explanation on how to scrape Soccerstats.com, see a quick How to scrape SoccerSTATS tutorial. And if you need more ideas on how to use extracted data, check out our industries pages showing examples of how enterprises use data scraped from the web in their workflows, projects, and missions.\n\nInput parameters\n\nIf this actor is run on our Platform, our brand new user-friendly interface will help you out in configuring all the necessary and optional parameters of this scraper before running it. This scraper recognizes the following input parameters:\n\ninformationType will define what category of information you're scraping from SoccerSTATS: TABLES will scrape the entire league table and form a separate data block for every team with their names, current position on the chart, the number of games played, won, lost, points gained, etc.\n\nCURRENTWEEK corresponds with the current matchday feature. Matchday, in this case, is a relative term since some games happen a few days apart. This parameter will deliver a dataset containing all games happening at home and away this week, + which week number it is of the season, halftime, and final scores. It will also contain the results of planned games that don't have scores yet.\nSELECTEDWEEKS corresponds with the range of matchdays feature and will allow getting matchday results within a time range of choice, e.g., from week 2 till 7 of this season. The time range can be defined using the startWeek and endWeek inputs. If you are using a different Information type input - TABLES, for example, you can safely ignore this pair of values.\nFULLSCHEDULE will get you the entire season schedule from start to finish, with scores and who was playing home/away. Note that this parameter provides everything but the matchday digit. So if you really need the matchday number as a part of your output, you can instead run the SELECTEDWEEKS and manually add the first and the last weeks. For example \"1\" as startWeek and \"34\" as endWeek parameter.\n\nselectedLeagues (optional). You can scrape these available leagues (with numbered countries being the lower league divisions): brazil, czechrepublic, germany, germany2, denmark, england, england2, spain, spain2, france, france2, greece, netherlands, italy, italy2, poland, portugal, russia, turkey.\n\nseason - lets you scrape the data from current or past seasons. So far, the available season inputs are: 2021-2022, 2020-2021.\n\nNote: You can follow the descriptions in the input editor to build your inputs easier.\n\nExample\n{  \n\t\"informationType\":  \"CURRENTWEEK\",  \n\t\"selectedLeagues\":  [\"England\"],  \n\t\"startWeek\":  1,  \n\t\"endWeek\":  10,  \n\t\"proxyConfig\": {  \n\t\t\"useApifyProxy\":  true \n\t},  \n\t\"season\":  \"2021-2022\"  \n}\nOutput\n\nThe output from SoccerSTATS.com Scraper is stored in the Apify Dataset. After the run is finished, you can choose to present and download the contents of the dataset in various data formats (JSON, XML, RSS, HTML Table).\n\nExample\n\nHere's the piece of the output you'd get if you run a task with the input parameters above:\n\n{\n  \"matchWeek\": \"14\",\n  \"date\": \"30-11\",\n  \"home\": \"Newcastle Utd\",\n  \"score\": \"1 - 1\",\n  \"away\": \"Norwich City\",\n  \"ht\": \"0 - 0\",\n  \"season\": \"2021-2022\",\n  \"league\": \"england\"\n},\n{\n  \"matchWeek\": \"14\",\n  \"date\": \"30-11\",\n  \"home\": \"Leeds Utd\",\n  \"score\": \"1 - 0\",\n  \"away\": \"Crystal Palace\",\n  \"ht\": \"0 - 0\",\n  \"season\": \"2021-2022\",\n  \"league\": \"england\"\n},\n{\n  \"matchWeek\": \"14\",\n  \"date\": \"01-12\",\n  \"home\": \"Southampton\",\n  \"score\": \"2 - 2\",\n  \"away\": \"Leicester City\",\n  \"ht\": \"2 - 1\",\n  \"season\": \"2021-2022\",\n  \"league\": \"england\"\n},\n...\n\nHow to use the extracted football stats data:\n\nQuickly collect the sports data from the current and previous season and use it for news and sports journalism.\nCombine automatic monitoring of football stats with other sports-related websites for better sports insights.\nScrape the match history for the most accurate game forecasts.\nBuild your own SoccerSTATS database - for customized sports analysis dashboards.\nBack up your sports betting decisions with data in sports arbitrage tactics.\nSupport team performance monitoring to help identify the causes, correlations, and shifts in betting decisions.\nPlanned features\nWe're planning to add more leagues and more league divisions.\nAdd more season inputs (the website offers soccer season data till 2013).\nAdd a possibility to scrape data on players.\nScraping live scores.\nOther sports scrapers\n\nWe've got a few other football APIs and sport-related scrapers in stock for you; for instance, see this Transfermarkt Scraper.\n\nYour feedback\n\nWe're always working on improving the performance of our actors. So if you've got any feedback about the work of our SoccerSTATS API, do not hesitate to drop a line to Apify support. If you stumble upon a bug, feel free to create an issue on the Github page, and we'll get right to it.",
    "icon": "https://images.apifyusercontent.com/8-AlYFNsP03ygzBuiU6xSGW0hCHz3Aejo5cnD8NJgrg/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9QNm1La0ZkZk1NM1dFSEk4di92OG9NNHBQTGdNQVdEb0g4SC1mb290YmFsbC0xNTc5MzBfXzM0MC5wbmc.webp",
    "author_url": "https://apify.com/glosterr",
    "author_avatar": "https://images.apifyusercontent.com/VcSLvEA2KNTqqM46aTWA7RcIvMSIDju3z5LCoNgpkck/rs:fill:192:192/aHR0cHM6Ly9saDMuZ29vZ2xldXNlcmNvbnRlbnQuY29tL2EtL0FGZFp1Y3FGZjl4LTQ3VEJGT3FzVl9CWEtVUHhyQzVlbEZHWXE4UE40cnZYPXM5Ni1j.webp",
    "readme_summary": "Actor to get football data from popular football leagues for 2021-2022 and 2020-2021 seasons. Soccer data includes matchweeks, tables, and schedules from 15+ European football leagues."
}