{
    "id": "lexis-solutions/google-ads-scraper",
    "url": "https://apify.com/lexis-solutions/google-ads-scraper",
    "title": "Google Ads Scraper · Apify",
    "name": "Google Ads Scraper",
    "pricing": "Pay $5.00 for 1,000 ads",
    "description": "Find and scrape any company's current and past ads on Google's ad network. Get ad copy, shown dates and locations, impressions, and more. Download and analyze data from the Google Ads Transparency Center (Google Ad Library) for competitive analysis.",
    "author_name": "Lexis Solutions",
    "maintained_by": "Maintained by Community",
    "count_users": "27 users",
    "count_runs": "58 runs",
    "last_modified": "Modified 6 days ago",
    "categories": "Business\nSocial media\nMarketing",
    "full_readme": "What is the Google Ads Scraper?\n\nThe Google Ads Scraper is designed to extract data from Google's Ads Transparency Center. It enables users to gather information about ads displayed on Google's advertising network, focusing on transparency and the details of advertisers. Users can search Google ads by company, domain, or country, and filter ads by date range and format.\n\nWhat data can the Google Ads Scraper extract?\n\nThe Google Ads Scraper can extract the following data from the Ads Transparency Center:\n\nAdvertiser name\nAdvertiser ID\nAd ID\nAd as image\nAd as text\nAd as HTML\nAd shown countries\nAd last shown date\nAd impressions (if available)\nWhat use cases does the Google Ads Scraper have?\n👀 Competitive analysis\n💻 Market research\n📊 Data journalism\nHow to use the Google Ads Scraper\nCreate a free Apify account\nOpen Google Ads Scraper\nAdd one or more Google Transparency Center URLs to the input\nClick Start and wait for the results\nDownload the results in JSON, XML or CSV format or connect the actor to your backend via API\n📥 Input\n\nTo run the actor, you'll need at least one Google Transparency Center URL.\n\nOpening the Google Transparency Center in your browser, you can see a search form like below.\n\nHere you can use the search form to filter the ads by:\n\nDates - the date range when the ad was shown\nCountries - the countries where the ad was shown\nFormat - the format of the ad (text, image, video)\nAdvertiser - the name of the advertiser, or the domain of the advertiser's website\n\nOnce you've set up the search form, click enter, and the URL in your browser will change. Copy this URL and paste it into the input field in the actor.\n\nSample URLs you can use:\n\nhttps://adstransparency.google.com/advertiser/AR09717407487665111041?region=anywhere - all ads from the advertiser \"Facebook Technologies LLC\", shown anywhere in the world, in any format, in any date range\n\nhttps://adstransparency.google.com/advertiser/AR09717407487665111041?region=DE&preset-date=Last+7+days&format=TEXT - all text ads from the advertiser \"Facebook Technologies LLC\", shown in Germany, in the last 7 days\n\n📤 Output\n\nThe results are stored in the default dataset associated with the actor. Each item is an ad, having the following format:\n\n{\n  \"id\": \"1940414785234249426\",\n  \"advertiserName\": \"DigitalOcean, LLC\",\n  \"lastShownAt\": \"Sep 28, 2023\",\n  \"format\": \"Text\",\n  \"image\": \"https://tpc.googlesyndication.com/archive/simgad/5901216088332964125?f=.png\",\n  \"shownCountries\": [\n    \"Argentina\",\n    \"France\",\n    \"Mexico\",\n    \"Portugal\",\n    \"Spain\",\n    \"United Kingdom\",\n    \"Europe\"\n  ],\n  \"advertiserId\": \"AR16111588221938302977\",\n  \"creativeId\": \"CR18224966324914749441\",\n  \"textContent\": \"Sponsored\\nDigitalOcean\\nwww.digitalocean.com/\\nDigitalOcean® Developer Cloud\\nSee why more than a million developers choose DigitalOcean. Try for free.\",\n  \"htmlContent\": \"<!DOCTYPE html><html>...</html>\",\n  \"copy\": \"DigitalOcean® Developer Cloud\\nSee why more than a million developers choose DigitalOcean. Try for free.\"\n}\nHow many Google Ads can the Google Ads Scraper extract?\n\nThe Google Ads Scraper currently uses infinite scroll to load all the ads on the page. This means that the actor will keep scrolling until it reaches the end of the page, and then it will start extracting the ads. By default, the actor will scroll 10 times. To control the number of scrolls, you can use the scrollsAmount input field.\n\nWhy use the Google Ads Scraper?\n\n⚡️ Fast - The scraper is fast and efficient, allowing you to scrape ads in a programmatic way.\n\n🤙 Easy to use - The scraper is easy to use and requires no coding knowledge. All you need to do is input the companies you want to scrape and the scraper will do the rest.\n\n☑️ Well-Maintained - The scraper is maintained by the Lexis Solutions team, ensuring that it is always up-to-date and working properly.\n\nFAQ\n\nHow to find a company's ads on Google?\n\nTo find a company's ads on Google, you can use the Google Ads Transparency Center. This tool allows you to search for ads by advertiser name, domain, or country.\n\nHow to search for ads on Google?\n\nGoogle Ads Transparency Center allows you to search for ads by advertiser name, domain, or country. You can also filter ads by date range and format. If you need to obtain the data programmatically, you can use the Google Ads Scraper.\n\nWhat is the Google Ads Transparency Center?\n\nThe Google Ads Transparency Center is a website that allows users to view ads that are displayed on Google's advertising network. It also provides information about the advertisers who are running these ads.\n\nWhat is the Google Ads Scraper?\n\nThe Google Ads Scraper is a web scraping tool designed specifically for Google's Ads Transparency Center. This tool offers an effective way to mine valuable data from ads displayed on Google's advertising network.\n\nIs Scraping Google Ads Legal?\n\nScraping public information from Google's Ads Transparency Center is legal as long as you are not violating any terms of service or privacy policies. However, it is important to note that scraping ads can be considered a violation of the terms of service of some websites, so it is always best to check before scraping.\n\nHow much does it cost?\n\nThe cost for using the Google Ads Scraper is shown on the top of this page. You can also check the Apify Store page for more information.\n\nRoadmap 🚴‍♀️\n\nCurrently the Google Ads Scraper supports scraping text ads. We are planning to add support for scraping image ads and video ads in the future.\n\nNeed to scrape ads from Bing?\n\n👉 Check out our Bing Ads Scraper\n\nNeed to scrape ads from TikTok?\n\n👉 Check out our TikTok Ads Scraper\n\n👀 p.s.\n\nGot feedback or need an extension?\n\nLexis Solutions is a certified Apify Partner. We can help you with custom solutions or data extraction projects.\n\nContact us over Email or LinkedIn\n\nImage Credit: Google Transparency Center",
    "icon": "https://images.apifyusercontent.com/NuAytkU0V-0e2yn89ywiqlduAiKERHR_NLy4nRfdBNw/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS8zWTVvTTd5c3RpcGFjeGFtYS9ISGltaXdCSzgzcGpHNll6Yi1hZHdvcmRzLnBuZw.webp",
    "author_url": "https://apify.com/lexis-solutions",
    "author_avatar": "https://images.apifyusercontent.com/pk6PTaFfoiKLiyOFIFnbNexcjNVRlj6LRjJ3XbTwblI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9EZXZia1kzYWRNVEJ1b0VDdC9IQUVBTmppNDNwSEpmRGZiYS1sb2dvLWdyYWRpZW50LmpwZw.webp",
    "readme_summary": "The Google Ads Scraper is designed to extract data from Google's Ads Transparency Center. It enables users to gather information about ads displayed on Google's advertising network, focusing on transparency and the details of advertisers. Users can search Google ads by company, domain, or country, and filter ads by date range and format. The Google Ads Scraper can extract data such as advertiser name, advertiser ID, ad ID, ad as image, ad as text, ad as HTML, ad shown countries, ad last shown date, and ad impressions (if available). It can be used for competitive analysis, market research, and data journalism. To use the Google Ads Scraper, you need to create a free Apify account, open the actor, add Google Transparency Center URLs to the input, and click Start. The results can be downloaded in JSON, XML, or CSV format or connected to your backend via API. The input requires at least one Google Transparency Center URL. The output is stored in the default dataset associated with the actor, with each item representing an ad and containing information such as ID, advertiser name, last shown date, format, image, shown countries, advertiser ID, creative ID, text content, HTML content, a"
}