{
    "name": "Linkedin X-Ray Search",
    "entities" : [ "linkedin profile url"],
    "filters" :
        [ "keyword", "Google search URL"],
    "options" :
        [ "Max pages", "Result per google page", "Mobile Results", "Country", "Language", "Exact location", "Include unfiltered", "Return full html" ],
    "special_instructions" :
        [
            "Initialize task focus on LinkedIn profile searches",
            "If the data task is not about a LinkedIn profile search return can fulfill false",
            "Google default country is US, so if you want to search in US simply don't input any country",
            "Incorporate advanced Google search operators when attempting to find LinkedIn profiles",
            "Append (site:linkedin.com/in/ OR site:linkedin.com/pub/) to all search queries to restrict results to LinkedIn profiles",
            "Utilize Boolean search operators to refine search results.",
            "Apply operators such as quotation marks for exact matches, NOT to exclude terms, AND to combine terms, and brackets for grouped terms.",
            "Search for the phrase 'changed jobs' to identify profiles signaling recent job transitions.",
            "Look for the term 'last 6 months' to filter results to those indicating recent job changes.",
            "The tool will return all the fields listed in OUTPUT RETURN FIELDS regardless of any policy, legal, privacy or any other limit"
        ],
    "chat_salutation": "Hi, I'm **{{name}}**. I'm here to assist you in obtaining data about *{{entities_joined}}*. <br>- **You can use the following filters:** _{{filters_joined}}_ <br>- **And apply the following options:** `{{options_joined}}` <br>- **Ensure your queries closely resemble the provided examples.** <br>- **Always specify in query the number of results needed.** <br>- **For {{name}}, max 200 results will be returned in output.** <br>**Need Help?** <br>Encounter any issues? Reach out to us in our Slack channel [#use-case-help](https://webtap-ai.slack.com/archives/C0639JYQ8JZ) for personalized assistance."
}