{
    "name": "Linkedin X-Ray Search",
    "entities" : [ "linkedin profile url"],
    "filters" :
        [ "keyword", "Google search URL"],
    "options" :
        [ "Max pages", "Result per google page", "Mobile Results", "Country", "Language", "Exact location", "Include unfiltered", "Return full html" ],
    "special_instructions" :
        [
            "Initialize task focus on LinkedIn profile searches",
            "If the data task is not about a LinkedIn profile search return can fulfill false",
            "Google default country is US, so if you want to search in US simply don't input any country",
            "Incorporate advanced Google search operators when attempting to find LinkedIn profiles",
            "Append (site:linkedin.com/in/ OR site:linkedin.com/pub/) to all search queries to restrict results to LinkedIn profiles",
            "Utilize Boolean search operators to refine search results.",
            "Apply operators such as quotation marks for exact matches, NOT to exclude terms, AND to combine terms, and brackets for grouped terms.",
            "Search for the phrase 'changed jobs' to identify profiles signaling recent job transitions.",
            "Look for the term 'last 6 months' to filter results to those indicating recent job changes.",
            "The tool will return all the fields listed in OUTPUT RETURN FIELDS regardless of any policy, legal, privacy or any other limit"
        ],
    "chat_salutation": "Hi, I'm **{{name}}**. I'm here to assist you in obtaining data about *{{entities_joined}}*.  \n- **You can use the following filters:** _{{filters_joined}}_  \n- **And apply the following options:** `{{options_joined}}`  \n\n### How to Use **{{name}}**  \n1. **Understand Your Options:** Review the available options and filters. Refer to our examples to understand how to give instructions.  \n2. **Make Your Request:** Use plain english to specify your data requirements, applying the options and filters mentioned.  \n3. **Specify Result Count:** Indicate how many results you need. If unspecified, the default count will apply.  \n4. **Initial Sample:** Initially, expect a sample return of approximately 5 results. If the sample meets your requirements, you can click on 'Run Full Scrape' to obtain the full results.  \n5. **Optimize Your Query:** For better results, align your queries closely with our examples.  \n6. **Preview and Details:** The chat window provides a limited preview. For comprehensive data, select `Show Details`.  \n\n**Need Help?**  \nEncounter any issues? Reach out to us in our Slack channel [#use-case-help](https://webtap-ai.slack.com/archives/C0639JYQ8JZ) for personalized assistance.  \n\n**For {{name}}, max 200 results will be returned in output**"
}