{
    "id": "misceres/seo-audit-tool",
    "url": "https://apify.com/misceres/seo-audit-tool",
    "title": "SEO Audit Tool - Free website SEO check · Apify",
    "name": "SEO Audit Tool",
    "pricing": "No credit card required",
    "description": "Search Engine Optimization tool to carry out an SEO audit on any website. Finds broken links, missing images, and provides information about possible page improvements.",
    "author_name": "Misceres",
    "maintained_by": "Maintained by Apify",
    "count_users": "2k users",
    "count_runs": "13.3k runs",
    "last_modified": "Modified 10 days ago",
    "categories": "SEO tools",
    "full_readme": "Features\nInput\nResults\nExample result\nFeatures\n\nThis SEO audit tool can crawl all the web pages on your website and alert you to errors or issues that could affect SEO performance.\n\nInput\n\nWeb URL is the most important input that you should set, as this is address is where the tool will start crawling.\n\nResults\n\nAll results are stored in Apify datasets. Each result has the following attributes:\n\nurl - URL of page\ntitle - title of page\nisLoaded - true if page was loaded properly\nisGoogleAnalyticsObject - check if Google Analytics object is included in the page\nisGoogleAnalyticsFunc - check if Google Analytics function is included in the page\nisCharacterEncode - check if page has meta tag with charset attribute\nisMetaDescription - check if page has meta description\nmetaDescription - value from meta description\nisMetaDescriptionEnoughLong - check if length of meta description is long enough\nisDoctype - check if doctype is included in page\nisTitle - check if title element is included in page\nisTitleEnoughLong - check if title is long enough\nisH1 - check if H1 element is present on page\nh1 - value from H1 element\nisH1OnlyOne - check that there is only one H1 on page\nisH2 - check if H2 element is present on page\nlinksCount - number of links on page\nisTooEnoughLinks - check if there are enough links on page\ninternalNoFollowLinks - list of no-follow links on page\ninternalNoFollowLinksCount - number of no-follow links on page\nnotOptimizedImages - list of unoptimized images (does not include alt tag)\nnotOptimizedImagesCount - number of unoptimized images\nwordsCount - number of words on page\nisContentEnoughLong - check if content is long enough\nisViewport - check if meta tag viewport is set on page\nisAmp - check if amp tag is set on page\nisNotIframe - check that there is no iframe\nbrokenLinks - list of broken links on page\nbrokenLinksCount - number of broken links on page\nbrokenImages - list of broken images on page\nbrokenImagesCount - number of broken image links on page\njsonLd - data from JSON-LD specifications\nmicrodata - data from microdata specifications\nExample result\n{\n  \"url\": \"https://www.apify.com/\",\n  \"title\": \"Web Scraping, Data Extraction and Automation - Apify\",\n  \"isLoaded\": true,\n  \"isGoogleAnalyticsObject\": true,\n  \"isGoogleAnalyticsFunc\": false,\n  \"isCharacterEncode\": true,\n  \"isMetaDescription\": true,\n  \"metaDescription\": \"Apify extracts data from websites, crawls lists of URLs and automates workflows on the web. Turn any website into an API in a few minutes!\",\n  \"isMetaDescriptionEnoughLong\": true,\n  \"isDoctype\": true,\n  \"isTitle\": true,\n  \"isTitleEnoughLong\": true,\n  \"isH1\": true,\n  \"h1\": \"The web scraping and automation platform\",\n  \"isH1OnlyOne\": true,\n  \"isH2\": true,\n  \"linksCount\": 91,\n  \"isTooEnoughlinks\": true,\n  \"internalNoFollowLinks\": [],\n  \"internalNoFollowLinksCount\": 0,\n  \"notOptimizedImgs\": [],\n  \"notOptimizedImagesCount\": 0,\n  \"wordsCount\": 1373,\n  \"isContentEnoughLong\": false,\n  \"isViewport\": true,\n  \"isAmp\": true,\n  \"isNotIframe\": false,\n  \"brokenLinks\": [],\n  \"brokenLinksCount\": 0,\n  \"brokenImages\": [],\n  \"brokenImagesCount\": 0,\n  \"jsonLd\": {\n    \"isJsonLd\": false,\n    \"jsonLdData\": {}\n  },\n  \"microdata\": {\n    \"isMicrodata\": false,\n    \"microdata\": []\n  }\n}",
    "icon": "https://images.apifyusercontent.com/v93VDVspb1VWTITq4xgAIiwJRdpfZD7EL_HjV2Gb-PE/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9qampOWmE0dEc0U3pERUZjcC9yd2lKdmhHalJHNEtlZkJlNi1zZW8uanBn.webp",
    "author_url": "https://apify.com/misceres",
    "author_avatar": "https://images.apifyusercontent.com/toIg6q6AIxWpWcjyiZ08n4hzpaT8m37A9TzMjUX5_ZE/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9KcVp5Q1doZXo2QmRXc3NSdS9BcDNwWnhlYWl3WFh6TTc1Qi1taXNjZXJlcy5wbmc.webp",
    "readme_summary": "This is an SEO audit tool that crawls web pages on a website and identifies errors or issues that could affect SEO performance. The main input is the web URL where the crawling starts. The results are stored in Apify datasets and include attributes such as URL, title, page load status, presence of Google Analytics, meta description, doctype, H1 and H2 elements, number of links, optimized images, word count, presence of viewport and amp tags, broken links and images, JSON-LD and microdata."
}