{
    "id": "junglee/amazon-bestsellers",
    "url": "https://apify.com/junglee/amazon-bestsellers",
    "title": "⭐️ Amazon Bestsellers Scraper · Apify",
    "name": "Amazon Bestsellers Scraper",
    "pricing": "Pay $5.00 for 1,000 items",
    "description": "Scrape the Amazon Best Sellers categories and extract details on top 100 most popular items on Amazon. Download product name, price, URL, and thumbnail image. Best used on .com, .co.uk, .de, .fr, .es, and .it domains. Download your data in various formats: HTML table, JSON, CSV, Excel, and more.",
    "author_name": "Junglee",
    "maintained_by": "Maintained by Apify",
    "count_users": "187 users",
    "count_runs": "997 runs",
    "last_modified": "Modified 1 day ago",
    "categories": "E-commerce",
    "full_readme": "⭐️ What is Amazon Best Sellers Scraper?\n\nThis Amazon Best Sellers Scraper allows you to scrape the 100 top-selling items on Amazon. It extracts data from Amazon Best Sellers pages in structured formats such as JSON, XML, CSV, or Excel. With this Amazon API, you will be able to:\n\nextract data from different domains: US, GB, DE, FR, ES, and IT.\nextract all Amazon Best Seller product details: name, price, URL, and thumbnail image.\nscrape Amazon Best Seller categories and subcategories.\nbesides Amazon Best Seller categories, you can now also scrape the following Amazon categories with this scraper: Most Wished, Movers and Shakers, New Releases, and Gift Ideas. For examples of URLs that be scraped, head over to the Input section.\n\nIf you would prefer a more general Amazon product data scraper, you should try Amazon Scraper instead.\n\n📚 How do I scrape Amazon Best Sellers?\n\nAmazon Best Sellers Scraper was designed for an easy start even if you've never extracted data from the web before. Here's how you can scrape bestsellers with this tool:\n\nCreate a free Apify account using your email.\nOpen Amazon Best Sellers Scraper.\nAdd one or more Amazon URLs to scrape product info.\nClick \"Start\" and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\n\nFor a step-by-step guide on how to scrape Amazon Best Seller products, follow our tutorial.\n\n📦 How many results can you scrape with Amazon Best Seller scraper?\n\nAmazon Best Sellers scraper can return up to tens of thousands of results on average. However, you have to keep in mind that scraping amazon.com has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\n🎯 Need to do product matching between Amazon and another online shop?\n\nUse the AI Product Matcher. This AI model allows you to compare items from different web stores, identifying exact matches and comparing real-time data obtained via web scraping. With the AI Product Matcher, you can use scraped product data to monitor product matches across the industry, implement dynamic pricing for your website, replace or complement manual mapping, and obtain realistic estimates against your competition for upcoming promo campaigns.\n\nMost importantly, it is relatively easy to get started with (just follow this guide).⬇️\n\n⬇️ Input parameters\n\nYou can scrape Amazon Best Sellers by Amazon URLs from 6 different Amazon domains: .com, .de. .co.uk, .fr, .es and .it. You can get all the details from a chosen category and its subcategories. You can add as many URLs as you want.\n\nHere's an input example of acceptable Amazon URLs:\n\nBest Sellers: https://www.amazon.com/Best-Sellers-Appliances/zgbs/appliances/ref=zg_bs_nav_appliances_0\nMovers and Shakers: https://www.amazon.de/-/en/gp/movers-and-shakers/garden/ref=zg_bsms_nav_garden_0\nNew Releases: https://www.amazon.co.uk/gp/new-releases/ref=zg_bsms_tab_bsnr\nMost Wished: https://www.amazon.es/gp/most-wished-for/ref=zg_bs_tab_mw\nMost Gifted: https://www.amazon.fr/gp/most-gifted/books/ref=zg_mg_nav_books_0\n⬆️ Output example\n\nThe scraped Amazon items will be shown as a dataset which you can find in the Output or Storage tabs. Note that the output will first be organized as a table for viewing convenience:\n\nYou can preview all the fields and choose in which format to download the data you’ve extracted: JSON, Excel, HTML table, CSV, or XML. Here below is the same dataset in JSON:\n\n [{\n  \"position\": 1,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Amazon Fire TV Stick 4K, brilliant 4K streaming quality, TV and smart home controls, free and live TV\",\n  \"price\": 22.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/all-new-fire-tv-stick-4k-with-alexa-voice-remote/dp/B08XVYZ1Y5/ref=zg_bs_g_electronics_sccl_1/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/41GYmjbeVSL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 2,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Amazon Fire TV Stick with Alexa Voice Remote (includes TV controls), free &amp; live TV without cable or satellite, HD streaming device\",\n  \"price\": 19.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/fire-tv-stick-with-3rd-gen-alexa-voice-remote/dp/B08C1W5N87/ref=zg_bs_g_electronics_sccl_2/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/51TjJOTfslL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 3,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Amazon Echo Dot (5th Gen) | The helpful assistant with clear vocals, deeper bass, and easy voice controls to assist you | Charcoal\",\n  \"price\": 22.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/All-New-release-Smart-speaker-Charcoal/dp/B09B8V1LZ3/ref=zg_bs_g_electronics_sccl_3/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/518cRYanpbL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 4,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Apple AirTag\",\n  \"price\": 28.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Apple-MX532AM-A-AirTag/dp/B0933BVK6T/ref=zg_bs_g_electronics_sccl_4/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/713xuNx00oS._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 5,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Apple AirTag 4 Pack\",\n  \"price\": 88.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Apple-MX542AM-A-AirTag-Pack/dp/B0932QJ2JZ/ref=zg_bs_g_electronics_sccl_5/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/71gY9E+cTaS._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 6,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Blink Video Doorbell | simple setup, two-year battery life, HD video, motion alerts, Works with Alexa — battery or wired (Black)\",\n  \"price\": 29.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Blink-Video-Doorbell/dp/B08SG2MS3V/ref=zg_bs_g_electronics_sccl_6/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/41te-uzWxDL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 7,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Apple AirPods (2nd Generation) Wireless Earbuds with Lightning Charging Case Included. Over 24 Hours of Battery Life, Effortless Setup. Bluetooth Headphones for iPhone\",\n  \"price\": 99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Apple-AirPods-Charging-Latest-Model/dp/B07PXGQC1Q/ref=zg_bs_g_electronics_sccl_7/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/61Zh467pKjL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 8,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"All-new Echo Show 5 (3rd Gen, 2023 release) | Smart display and alarm clock with clearer sound | Charcoal \",\n  \"price\": 39.99,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/All-new-Echo-Show-5/dp/B09B2SBHQK/ref=zg_bs_g_electronics_sccl_8/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/61dIsuhh4AL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 9,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Wall Charger, Surge Protector, QINLIANF 5 Outlet Extender with 4 USB Charging Ports (4.8A Total) 3-Sided 1680J Power Strip Multi Plug Adapter Spaced for Home Travel Office (3U1C)\",\n  \"price\": 15.97,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Charger-Protector-QINLIANF-Extender-Charging/dp/B08R6S1M1K/ref=zg_bs_g_electronics_sccl_9/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/61Hh-YlfJOL._AC_UL600_SR600,400_.jpg\"\n},\n{\n  \"position\": 10,\n  \"category\": \"Amazon Best Sellers: Best Electronics\",\n  \"categoryUrl\": \"https://www.amazon.com/Best-Sellers-Electronics/zgbs/electronics/\",\n  \"name\": \"Apple EarPods Headphones with Lightning Connector. Microphone with Built-in Remote to Control Music, Phone Calls, and Volume. Wired Earbuds for iPhone\",\n  \"price\": 16.59,\n  \"currency\": \"$\",\n  \"numberOfOffers\": 1,\n  \"url\": \"https://www.amazon.com/Apple-EarPods-Lightning-Connector-White/dp/B01M0GB8CC/ref=zg_bs_g_electronics_sccl_10/134-0062779-1101052?psc=1\",\n  \"thumbnail\": \"https://images-na.ssl-images-amazon.com/images/I/41-aexp44tL._AC_UL600_SR600,400_.jpg\"\n},\n...\n☝️ Tips and tricks\nBy default, this Amazon scraper extracts the 37 top Best Seller subcategories. A deeper level of extraction can be added to allow you to scrape the top-selling items from the first level of the main categories' sub-divisions.\nThe default depth of the crawl is limited to two subcategories. There is a way around this restriction. Start on the main category, scrape two departments. Then remove duplicate category URLs from there and feed them back into the scraper again.\n❓FAQ\nDo I need proxies to scrape Amazon?\n\nFor the most reliable results of scraping, you will need to use some sort of proxy along with the scraper to prevent its detection by target websites. You can use both Apify Proxy and custom HTTP or SOCKS5 proxy servers.\n\nTo engage custom proxies specifically, you will need to specify them in the scheme://user:password@host:port format. Multiple proxies should be separated by a space or new line and the URL scheme can be either HTTP or SOCKS5. User and password might be omitted, but the port must always be present.\n\nCan I integrate Amazon Best Sellers Scraper with other apps?\n\nYes. Amazon Best Sellers can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, LangChain, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nOr you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever this Amazon web scraper successfully finishes a run.\n\nCan I use Amazon Best Sellers Scraper with API?\n\nYes, you can do so by using Apify API. It gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify Actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nTo access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nHow can you use Amazon Best Sellers data?\n\nIf you're web scraping Amazon for retail or market research, the Amazon Best Sellers list can tell you a lot about the top trends in e-commerce. Competing directly against top-selling items across Amazon can be difficult, but it also can be a source of inspiration for new products for e-commerce retailers. Data collected on those top-selling items can help you:\n\nstay ahead of the competition\nimprove sales for your business\ntrack up-and-coming products\nadjust your product prices to market levels\nNot your cup of tea? Build your own scraper\n\nAmazon Best Sellers Scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it). Or let us know if you need a custom scraping solution.\n\nResources on how to scrape data from Amazon Best Sellers\nPlatform pricing page with pricing specifications.\nVideo guide ▷ on how to choose the right subscription plan.\nStep-by-step guide on how to use Amazon Best Sellers scraper.\nInput tab with all the technical parameters of this scraper.\nIs web scraping legal on the legal aspects of web scraping.\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Amazon Best Sellers or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/OAXVPE6GbdCfRu6tV_b5osR6c10XqqSbevS48xAk2Hw/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9pSGFpUjhWSVV0MTNvbGJYZy83OEo3Z25aaGM2UEdadEVXZi1BbWF6b25fQmVzdHNlbGxlcnMucG5n.webp",
    "author_url": "https://apify.com/junglee",
    "author_avatar": "https://images.apifyusercontent.com/enEGfGMfQOShgB0snHpnOHGPBhPeEUZhrvbo7VE92AU/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMudXMtZWFzdC0xLmFtYXpvbmF3cy5jb20vVFg0clBKQkhiaFNLaTIzWHMvSFl6Umtmc204aGlOVEo3SnAtSnVuZ2xlZS5wbmc.webp",
    "readme_summary": "Scrape the Amazon Best Sellers categories and extract details on top 100 most popular items on Amazon. Download product name, price, URL, and thumbnail image. Best used on .com, .co.uk, .de, .fr, .es, and .it domains. Download your data in various formats: HTML table, JSON, CSV, Excel, and more."
}