{
    "id": "lukaskrivka/keywords-extractor",
    "url": "https://apify.com/lukaskrivka/keywords-extractor",
    "title": "Keywords Extractor · Apify",
    "name": "Keywords Extractor",
    "pricing": "No credit card required",
    "description": "Use our free website keyword extractor to crawl any website and extract keyword counts on each page.",
    "author_name": "Lukáš Křivka",
    "maintained_by": "Maintained by Community",
    "count_users": "447 users",
    "count_runs": "6.6k runs",
    "last_modified": "Modified over 2 years ago",
    "categories": "Marketing",
    "full_readme": "Keyword Extractor\n\nCan deeply crawl a website and counts how many times are provided keywords found on the page.\n\nHow to use\nYou can pass in any number of keywords that you want to count.\nYou can combine Start URLs, Pseudo Urls and link selector to traverse any number of pages accross websites. Check our scraping tutorial on how to use these.\nYou can specify maxDepth and maxPagesPerCrawl to limit the scope of the scrape. Start URLs have depth 0. So if you want just the start URLs, set maxDepth to 0, etc.\nYou can pick case sensitive search and search through scripts.\nYou can choose to scrape with or without browser. Browser is more expensive but allows JavaScript rendering and waiting.\nFor browser, you can use many additional features\nHow are keywords determined\n\nThe text is split into words by word boundaries. Each word is then compared with each keyword. In the future, we may add other types of boundaries to choose from.\n\nExample Output\n\nFor keywords:\n\n[\"watch\", \"watches\", \"rolex\"]\n\nstarting on https://www.chrono24.com/watches/mens-watches--62.htm\n\n[\n    {\n        \"url\": \"https://www.chrono24.com/watches/mens-watches--62.htm\",\n        \"depth\": 0,\n        \"result\": {\n            \"watch\": 63,\n            \"watches\": 81,\n            \"rolex\": 57\n        }\n    },\n    {\n        \"url\": \"https://www.chrono24.com/user/index.htm\",\n        \"depth\": 1,\n        \"result\": {\n            \"watch\": 9,\n            \"watches\": 13,\n            \"rolex\": 1\n        }\n    },\n    {\n        \"url\": \"https://www.chrono24.com/info/watch-collection.htm\",\n        \"depth\": 1,\n        \"result\": {\n            \"watch\": 56,\n            \"watches\": 23,\n            \"rolex\": 1\n        }\n    },\n...\n]",
    "icon": "https://images.apifyusercontent.com/OodBafDku7UVx_xP7x_wsN4DLYIauaI1fk5hdov1yIU/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9mZ0NnMjY4Umc5WXJ2cngyNC9qb2NnOFNiVGpKSnBxTDhiNi1rZXl3b3JkLXJlc2VhcmNoLXRvb2xzLTEtNzYweDQwMC5wbmc.webp",
    "author_url": "https://apify.com/lukaskrivka",
    "author_avatar": "https://images.apifyusercontent.com/k_avqmVwjEXP1LCaEENbtk2maruHqYN9M4rAJrvX5nc/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9tUFN5RzM1TGZmajV5YnRnei8zeE5UZlFXajhzdlpBamg1ci1iaWdnZXJfcGhvdG8uanBn.webp",
    "readme_summary": "Use our free website keyword extractor to crawl any website and extract keyword counts on each page. Can deeply crawl a website and counts how many times are provided keywords found on the page. You can pass in any number of keywords that you want to count. You can combine Start URLs, Pseudo Urls and link selector to traverse any number of pages accross websites. Check our scraping tutorial on how to use these. You can specify maxDepth and maxPagesPerCrawl to limit the scope of the scrape. Start URLs have depth 0. So if you want just the start URLs, set maxDepth to 0, etc. You can pick case sensitive search and search through scripts. You can choose to scrape with or without browser. Browser is more expensive but allows JavaScript rendering and waiting. For browser, you can use many additional features. The text is split into words by word boundaries. Each word is then compared with each keyword. In the future, we may add other types of boundaries to choose from. Example Output: For keywords: [\"watch\", \"watches\", \"rolex\"] starting on https://www.chrono24.com/watches/mens-watches--62.htm"
}