{
    "id": "petr_cermak/transfermarkt",
    "url": "https://apify.com/petr_cermak/transfermarkt",
    "title": "⚽ Scrape Transfermarkt · Apify",
    "name": "Transfermarkt Scraper",
    "pricing": "No credit card required",
    "description": "⚽ Use this free tool as an API for the Transfermarkt website. Scrape and extract data from competition, club or player pages, or almost any Transfermarkt page. Download your data as HTML table, JSON, CSV, Excel, XML, and RSS feed.",
    "author_name": "Petr Cermak",
    "maintained_by": "Maintained by Community",
    "count_users": "2.1k users",
    "count_runs": "33.1k runs",
    "last_modified": "Modified 10 days ago",
    "categories": "News\nSports",
    "full_readme": "Features\n\nUsing the Transfermarkt scraper, you can extract data from all transfermarkt.com pages and domains. It works best with competition, club or player pages, but supports other page types as well.\n\nTransfermarkt Scraper requires only the start page URL. The page type will be determined automatically, and the scraper will extract all the sports data accordingly. It is fairly simple to use as it only has 3 other input parameters to work with, other than the start page URL.\n\nHow to use the extracted Transfermarkt statistics data:\n\nScrape live scores for the most accurate predictions of match outcomes\nMonitor transfermarkt and other soccer-related websites simultaneously and combine extracted data\nCollect the statistics from the past games needed for analysis and sports results forecasts\nCreate data-based rules to form an accurate online sports betting strategy\nOptimize live monitoring and analysis of what causes the changes in betting rates as well as what information influences betting decisions.\nCost of usage\n\nUsing our basic plan, the scraper's run will cost you around 2.5 USD credits per 1000 scraped results. For more details about the plans we offer, platform credits and usage, see the platform pricing page.\n\nIf you're not sure how much credit you've got on your plan and whether you might need to upgrade, you can always check your limits in the Settings -> Usage and Billing tab in your Console. The easiest way to know how many credits your actor will need is to perform a test run.\n\nTutorial\n\nFor a more detailed explanation on how to scrape Transfermarkt, read the Transfermarkt scraper tutorial on our blog. For more ideas on how to use web scraping data, check out our industries pages for ways web scraping results are already being used across the projects and businesses of various scale and direction.\n\nInput parameters\n\nThe Transfermarkt Scraper accepts following parameters:\n\nstartUrl (required): The start page URL, from which the scraper will be fending off.\nparallels: Specifies how many parallel crawlers will be used; defaults to value 1.\ncrawlDepth: defines how deep the crawler will navigate from the start page. Defaults to 1 (extracts data from the start page only), but if you set up a higher value, the crawler will go deeper into the links this page contains.\npageDepth: defines how far in pagination the run will be extended. By default it's set to unlimited - so if there's, say, 50 indexed pages of results, the crawler will not stop until it will finish scraping all of them.\nExample\n{\n    \"startUrls\": [\n        {\n            \"url\": \"https://www.transfermarkt.com/lionel-messi/profil/spieler/28003\"\n        }\n    ],\n    \"proxyConfig\": {\n        \"useApifyProxy\": true\n    },\n    \"crawlDepth\": 1,\n    \"pageDepth\": 1\n};\nOutput\n\nThe output from Transfermarkt Scraper is stored in the Apify Dataset. After the run is finished, you can choose to present and download the contents of the dataset in different data formats (JSON, XML, RSS, HTML Table...)\n\nExample\n\nHere's an example output of the scraper when run with the input parameters from the previous example.\n\n{\n  \"id\": \"28003\",\n  \"url\": \"https://www.transfermarkt.com/lionel-messi/profil/spieler/28003\",\n  \"type\": \"player\",\n  \"nameInHomeCountry\": \"Lionel Andrés Messi Cuccitini\",\n  \"dateOfBirth\": \"Jun 24, 1987\",\n  \"placeOfBirth\": \"Rosario\",\n  \"age\": \"34\",\n  \"height\": \"1,69 m\",\n  \"citizenship\": [\n    \"Argentina\",\n    \"Spain\"\n  ],\n  \"position\": \"attack - Right Winger\",\n  \"foot\": \"left\",\n  \"playerAgent\": \"Relatives\",\n  \"currentClub\": \"Paris Saint-Germain\",\n  \"joined\": \"Aug 10, 2021\",\n  \"contractExpires\": \"Jun 30, 2023\",\n  \"contractOption\": \"Option for a further year\",\n  \"outfitter\": \"adidas\",\n  \"socialMedia\": \"\",\n}\nOther sports scrapers\n\nWe have other sport-related scrapers in stock for you; for instance, see this Soccer Stats Scraper.\n\nYour feedback\n\nWe're always working on improving the performance of our actors. So if you've got any feedback about the work of our Transfermarkt API, do not hesitate to drop us a line in support@apify.com. If you do so much as to find a bug, please create an issue on the Github page and we'll get to it.",
    "icon": "https://images.apifyusercontent.com/egZoVSW8tmedT3V-iiQKMRcZ62EJ4Ukdoz2NDMAJUbA/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS94Q0NLRzRncWZvYWhRSnJFeS9qY0JpUloybkFvbzhLRjZoUC10cmFuc2Zlcm1hcmt0LnBuZw.webp",
    "author_url": "https://apify.com/petr_cermak",
    "author_avatar": "https://images.apifyusercontent.com/l1gPQf8fkdtA7vaimFoqF7ckRe0Za0_AXRRDfOBXl6g/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS8yc1c1emhUdm1yZ2E2VDg1Ry81WlJ5bU1QS1BiWGo4bjZ4Mi1wcm9maWxlXzEuanBn.webp",
    "readme_summary": "Use this free tool as an API for the Transfermarkt website. Scrape and extract data from competition, club or player pages, or almost any Transfermarkt page. Download your data as HTML table, JSON, CSV, Excel, XML, and RSS feed. The Transfermarkt Scraper requires only the start page URL. The page type will be determined automatically, and the scraper will extract all the sports data accordingly. It is fairly simple to use as it only has 3 other input parameters to work with, other than the start page URL."
}