{
    "id": "svpetrenko/quora-scraper",
    "url": "https://apify.com/svpetrenko/quora-scraper",
    "title": "Quora Scraper · Apify",
    "name": "Quora Scraper",
    "pricing": "No credit card required",
    "description": "Unofficial Quora API for scraping questions and answers for each question.",
    "author_name": "Sviatozar Petrenko",
    "maintained_by": "Maintained by Community",
    "count_users": "310 users",
    "count_runs": "5.5k runs",
    "last_modified": "Modified 4 months ago",
    "categories": "Social media\nLead generation",
    "full_readme": "What does Quora Scraper do?\n\nQuora Scraper lets you scrape questions found with Quora's search and answers for each of them. The result will include basic information for each question and answer, including their contents, urls etc. You can use this scraper as an unofficial Quora API.\n\nWhy scrape Quora?\n\nQuora is one of the biggest knowledge bases on the Internet. Naturally, there are lots of ways to utilize the information this scraper would provide.\n\nFor example, you can simply use it to quickly search for answers you are interested in and store them for future reference. Or, you can use the acquired knowledge for business research in a particular domain area or feed the data to your academic machine learning projects.\n\nIf you feel that this scraper is missing some functionality, feel free to contact support\n\nHow much will it cost to scrape Quora?\n\nCost usage depends on the type of proxy you use and the number of questions and answers that are scraped. For example, using Apify's automatic proxy (United states) the scraper was able to parse 698 questions with their answers using $0.131. Therefore, with Apify's $5 free usage, you'd be able to parse 5 / 0.131 * 698 = ~26 000 questions.\n\nHow to scrape Quora?\nGo to Quora Scraper on Apify\nClick Try for free button\nEnter scraper Input (see below): search query and proxy configuration. Using Apify's automatic proxy will be good.\nClick the Start button\nWhen the run has finished, you'll see the table of questions in the default dataset, which you can export in any format you'd like. You'll see the answers for each question in the default key-value store.\nIs it legal to scrape Quora?\n\nOur scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. We therefore believe that our scrapers, when used for ethical purposes by Apify users, are safe. However, you should be aware that your results could contain personal data. Personal data is protected by the GDPR in the European Union and by other regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping.\n\nInput\n\nQuora Scraper has some required input options: search query (the scraper will use it to find questions and their answers) and proxy configuration (without using proxy, many requests might get blocked, so be sure to select some; NOTE: residential proxy will likely not work with this scraper). Click on the Input tab for more information.\n\nOutput\n\nQuora Scraper will add questions to the default dataset. You can download the dataset in various formats such as JSON, HTML, CSV, or Excel. For each question, in the default Key-Value store there will be an entry with the key of this format: qid_123456_answers, where 123456 will be replaced by the actual qid of the question (one of the fields extracted by the scraper).",
    "icon": "https://images.apifyusercontent.com/DIgXryq6DjlwoF21fi_yXCul6MUG-W0_Lu5JaiSIBS8/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9kaDRrT3FwZGhrY3NIdmJFQS9aYVlwNXV6ckFaZkVzQm1Rdy1xdW9yYS5wbmc.webp",
    "author_url": "https://apify.com/svpetrenko",
    "author_avatar": "https://images.apifyusercontent.com/PqC9R9a_i9-z4TfdLjL71k0-ksicYRmG5Yg3kNZBJag/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9vd2tYOXhuOUViUmtTV3FORi9ucXo0cVp0TFRNeEJHeko2YS1tZS5qcGc.webp",
    "readme_summary": "# What does Quora Scraper do?\n\nQuora Scraper lets you scrape questions found with\n[Quora's](https://www.quora.com/) search and answers for each of them. The\nresult will include basic information for each question and answer, including\ntheir contents, urls etc. You can use this scraper as an unofficial Quora API.\n\n# How to scrape Quora?\n\n  1. Go to [Quora Scraper](https://apify.com/svpetrenko/quora-scraper) on Apify\n  2. Click **Try for free** button\n  3. Enter scraper Input (see below): search query and proxy configuration. Using Apify's automatic proxy will be good.\n  4. Click the Start button\n  5. When the run has finished, you'll see the table of questions in the **default dataset** , which you can export in any format you'd like. You'll see the answers for each question in the **default key-value store**.\n\n# Input\n\nQuora Scraper has some required input options: search query (the scraper will\nuse it to find questions and their answers) and proxy configuration (without\nusing proxy, many requests might get blocked, so be sure to select some;\n_NOTE: residential proxy will likely not work with this scraper_ ). Click on\nthe [Input tab](https://apify.com/svpetrenko/quora-scraper/input"
}