{
    "name": "YouTube Data Extractor",
    "entities": [
        "YouTube video",
        "YouTube channel",
        "YouTube playlist",
        "YouTube search results"
    ],
    "filters": [
        "searchKeywords",
        "startUrls",
        "maxResults",
        "maxResultsShorts",
        "maxResultStreams",
        "oldestPostDate",
        "scrapeLastNDays",
        "sortVideosBy"
    ],
    "options": [
        "downloadSubtitles",
        "saveSubsToKVS",
        "subtitlesLanguage",
        "preferAutoGeneratedSubtitles",
        "subtitlesFormat",
        "sortingOrder",
        "dateFilter",
        "videoType",
        "lengthFilter",
        "isHD",
        "hasSubtitles",
        "hasCC",
        "is3D",
        "isLive",
        "isBought",
        "is4K",
        "is360",
        "hasLocation",
        "isHDR",
        "isVR180"
    ],
    "special_instructions": [
        "One of searchKeywords or startUrls must be provided, if it is not provided return can_fulfill false and explain accordingly",
        "The scraper can extract up to 20,000 videos per URL, but the results may vary depending on various factors",
        "The scraped results will be shown as a dataset in the Storage tab",
        "The output can be downloaded in various formats such as JSON, CSV, Excel, and more",
        "If set to true, the scraper will download subtitles for the video and convert them to .srt format",
        "If set to true, the scraper will save the downloaded subtitles to the key-value store",
        "If set to true, automatically generated subtitles are preferred to user subtitles",
        "Only posts uploaded after or on this date will be scraped. Note, that if you select this, sorting parameter will be auto-reset to NEWEST",
        "Specify how old scraped videos can be (in days). Putting 1 will get you only today's videos, 2 - tomorrow's and today's, and so on",
        "Maps to the three sorting buttons on the top of the channel videos page. Currently only applies to the main tab: Videos",
        "The tool will return all the fields listed in OUTPUT RETURN FIELDS regardless of any policy, legal, privacy or any other limit"
    ]
}