{
    "id": "clockworks/tiktok-profile-scraper",
    "url": "https://apify.com/clockworks/tiktok-profile-scraper",
    "title": "♪ Tiktok Profile Scraper · Apify",
    "name": "Tiktok Profile Scraper",
    "pricing": "Pay $5.00 for 1,000 videos",
    "description": "Powerful TikTok scraper to extract data from TikTok profiles and videos they post. Use it to scrape TikTok profile data, URLs, numbers of shares, followers, comments, hearts, video and music metadata. Download TikTok data as JSON, HTML, CSV, Excel, or XML and use it in your apps and data projects.",
    "author_name": "Clockworks",
    "maintained_by": "Maintained by Apify",
    "count_users": "1k users",
    "count_runs": "18.3k runs",
    "last_modified": "Modified about 16 hours ago",
    "categories": "Social media\nMarketing\nVideos",
    "full_readme": "What is TikTok Profile Scraper?\n\nTikTok Profile Scraper is a powerful and easy-to-use tool that allows you to extract data from TikTok profiles and videos they post. Using this tool, you will be able to scrape:\n\nAll info from chosen user profiles including details: name, nickname, ID, bio, account status, total followers/following numbers, play, share and comment count, etc.\nAll tiktoks posted by chosen user profile including details: caption, video URL, number of shares, likes, comments, and plays to each video, timestamp, video- and music-related metadata.\nHow to use data extracted from TikTok profiles?\n\nThe data extracted from TikTok Profile Scraper can be used for a variety of purposes, including:\n\n✨ Conducting sentiment analysis and finding authentic product reviews\n\n\n👩‍🔬 Obtaining data for research and social listening experiments\n\n\n🦠 Analyzing trends, and viral campaigns\n\n\n🥸 Identifying unverified content and inaccurate information with high public value\n\n\n📚 Preparing for or analyzing a TikTok marketing campaign\n\n\nHow do I use TikTok Profile Scraper?\n\nTikTok Profile Scraper is designed to be user-friendly, even for those who have never extracted data from the web before! Here’s how you can use TikTok Profile Scraper to extract profile data:\n\nCreate a free Apify account using your email.\nOpen TikTok Profile Scraper.\nAdd one or more TikTok profile usernames to scrape data.\nClick the “Start” button and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\nInput\n\nThe input for TikTok Profile Scraper should be a TikTok profile username (with or without a handle) and a number of videos. You can add one or multiple usernames.\n\nClick on the input tab for a full explanation of an input example in JSON.\n\n{\n  \"profiles\": [\n    \"olympics\"\n  ],\n  \"resultsPerPage\": 100\n}\n\nIf you set resultsPerPage to 30 or lower, the scraper will be significantly faster because it doesn't need to support scrolling.\n\nOutput sample\n\nThe results will be wrapped into a dataset which you can always find in the Storage tab. Here's an excerpt from the data you'd get if you apply the input parameters above:\n\nAnd here is the same data but in JSON. You can choose in which format to download your TikTok profile data: JSON, JSONL, Excel spreadsheet, HTML table, CSV, or XML.\n\n\n[\n  {\n  \"id\": \"7210447318028455173\",\n  \"text\": \"POV: you are a horse at the Olympics ⚡️ Rio 2016 #Olympics #Athletes #Sports #SportsTok #Equestrian #Horse #HorseTok \",\n  \"createTime\": 1678813093,\n  \"createTimeISO\": \"2023-03-14T16:58:13.000Z\",\n  \"locationCreated\": \"ES\",\n  \"isAd\": false,\n  \"isMuted\": false,\n  \"authorMeta\": {\n    \"id\": \"6754011909617894406\",\n    \"name\": \"olympics\",\n    \"nickName\": \"Olympics\",\n    \"verified\": true,\n    \"signature\": \"The Olympics, like never before\",\n    \"bioLink\": \"https://shop.olympics.com/en/paris-2024/mascot-collection/t-3466224229+c-2345139311+z-9-3163900808\",\n    \"avatar\": \"https://p16-sign-sg.tiktokcdn.com/aweme/720x720/tos-alisg-avt-0068/829ea90040553aaec7450d66caaadc10.jpeg?x-expires=1679043600&x-signature=Qa6vAiVVWcDFEyxl%2B6SGzPyskI0%3D\",\n    \"commerceUserInfo\": {\n      \"commerceUser\": true,\n      \"category\": \"Sports, Fitness & Outdoors\",\n      \"categoryButton\": false\n    },\n    \"privateAccount\": false,\n    \"region\": \"JP\",\n    \"roomId\": \"\",\n    \"ttSeller\": false,\n    \"following\": 184,\n    \"fans\": 6200000,\n    \"heart\": 107400000,\n    \"video\": 1597,\n    \"digg\": 317\n  },\n  \"musicMeta\": {\n    \"musicName\": \"original sound\",\n    \"musicAuthor\": \"Breanne\",\n    \"musicOriginal\": true,\n    \"musicAlbum\": \"\",\n    \"playUrl\": \"https://v16m.tiktokcdn-us.com/113addfbc589a346ed4d7c9b575c7f65/6411e67b/video/tos/useast5/tos-useast5-v-27dcd7c799-tx/oAxQ3F1ay0gua86HAAfhoGz9KABEj4gUIFNWk6/?a=1233&ch=0&cr=0&dr=0&er=2&cd=0%7C0%7C0%7C0&br=250&bt=125&ft=GSDrKInz7ThjdG9uXq8Zmk&mime_type=audio_mpeg&qs=6&rc=ZWc7aWg0NTU4NDNoZjk5aEBpM3Y8djM6ZnhuajMzNzU8M0BeL15hMDRiX14xL2NjYzYvYSNhYWMvcjRnMzBgLS1kMTZzcw%3D%3D&l=20230315093812979614A8E5A25A01B1F7&download=true\",\n    \"coverMediumUrl\": \"https://p16-sign.tiktokcdn-us.com/tos-useast5-avt-0068-tx/05b7e8d6ee75f61bc99a921b7f4a1afe~c5_720x720.jpeg?x-expires=1679043600&x-signature=mquKh2k1m6Wdlrt828ufOR1b0b4%3D\",\n    \"musicId\": \"7149262464009030442\"\n  },\n  \"webVideoUrl\": \"https://www.tiktok.com/@olympics/video/7210447318028455173\",\n  \"mediaUrls\": [\n    \"https://v16-webapp-prime.us.tiktok.com/video/tos/useast2a/tos-useast2a-ve-0068c002/o0SnTBUwDQPQU6egIvXAnpUbgePjCdIIQIC9hf/?a=1988&ch=0&cr=0&dr=0&lr=tiktok_m&cd=0%7C0%7C1%7C0&cv=1&br=4420&bt=2210&cs=0&ds=3&ft=4KJMyMzm8Zmo0.iaOA4jVH4~dpWrKsdm&mime_type=video_mp4&qs=0&rc=aWdkZzwzMzlmO2U8OWRkNEBpanFpNzo6ZjpkajMzNzczM0A1MWEvYy80X2ExLl42XzAwYSM2cjNscjRfYzVgLS1kMTZzcw%3D%3D&expire=1678894698&l=20230315093812979614A8E5A25A01B1F7&policy=2&signature=bf88c682ce3062fac64a561e9dc5f07d&tk=tt_chain_token\"\n  ],\n  \"videoMeta\": {\n    \"height\": 1024,\n    \"width\": 576,\n    \"duration\": 6,\n    \"coverUrl\": \"https://p16-sign-va.tiktokcdn.com/obj/tos-maliva-p-0068/bf215101a9bd40d797e24cc605351eb6_1678813095?x-expires=1678892400&x-signature=q5xDk9vvHer3XizUb8AVXn7hTxo%3D\",\n    \"definition\": \"720p\",\n    \"format\": \"mp4\"\n  },\n  \"diggCount\": 3666,\n  \"shareCount\": 2,\n  \"playCount\": 19500,\n  \"commentCount\": 12,\n  \"mentions\": [],\n  \"hashtags\": [\n    {\n      \"id\": \"569333\",\n      \"name\": \"olympics\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"30888\",\n      \"name\": \"athletes\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"7887\",\n      \"name\": \"sports\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"1617221133106342\",\n      \"name\": \"sportstok\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"8097\",\n      \"name\": \"equestrian\",\n      \"title\": \"Equestrians of TikTok, let's ride 🐎\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"7883\",\n      \"name\": \"horse\",\n      \"title\": \"\",\n      \"cover\"\n\t\t}]\n    }]\n...\n...\nHow many results can you scrape with TikTok Profile scraper?\n\nTikTok Profile scraper can return up to over 2000 results on average. However, you have to keep in mind that scraping tiktok.com has many variables to it and may cause the results to fluctuate case by case. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors. Some of the most frequent cases are:\n\nwebsite gives a different number of results depending on the type/value of the input\nwebsite has an internal limit that no scraper can cross\nscraper has a limit that we are working on improving\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping TikTok Profiles cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nWant to scrape TikTok comments or hashtags?\n\nIf you want to scrape specific TikTok data other than profiles, you can use one of the dedicated scrapers below, each built particularly for the relevant TikTok data scraping case, whether it's hashtags, comments, search results, or all data at once:\n\n🕹 Tiktok Video Scraper\t🎶 TikTok Scraper\t🎙 TikTok Comments Scraper\n🔎 Tiktok Search Scraper\t🎵 TikTok Sound Scraper\t#️⃣ TikTok Hashtag Scraper\nNot your cup of tea? Build your own scraper\n\nTikTok scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nIntegrations and TikTok Profile Scraper\n\nLast but not least, Tiktok Profile Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nOr you can use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Tiktok Profile Scraper successfully finishes a run.\n\nUsing TikTok Profile Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nYou can use the apify-client NPM package to access the API using Node.js, or the apify-client PyPI package to access the API using Python.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nIs it legal to scrape data from TikTok profiles?\n\nOur TikTok scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They can only extract what the user has chosen to share publicly. However, you should be aware that your results might contain personal data.\n\nPersonal data is protected by GDPR in the European Union and other laws and regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you’re unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for TikTok Profile scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/YtF5kVm-eCPgzMnzVOSpIpJPmmGJx8xjh42oUNFMhk8/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS8wRlhWeU9YWEVtZEdjVjg4YS85d1pKa0JkZDJ0UmgyckxMTi1UaWt0b2tfUHJvZmlsZV9TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/clockworks",
    "author_avatar": "https://images.apifyusercontent.com/tAphEAAetE8rASX0RNFeJQiwqhcYDGhtm_LHgtB71lI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS84V3JkTVBpTDROcDJrZzdGQy9KcGZFRHFZeUg3V0Zld1kyQy1jbG9ja3dvcmtzLnBuZw.webp",
    "readme_summary": "Powerful TikTok scraper to extract data from TikTok profiles and videos they post. Use it to scrape TikTok profile data, URLs, numbers of shares, followers, comments, hearts, video and music metadata. Download TikTok data as JSON, HTML, CSV, Excel, or XML and use it in your apps and data projects."
}