{
    "id": "clockworks/tiktok-video-scraper",
    "url": "https://apify.com/clockworks/tiktok-video-scraper",
    "title": "♪ Tiktok Video Scraper · Apify",
    "name": "Tiktok Video Scraper",
    "pricing": "Pay $5.00 for 1,000 videos",
    "description": "Powerful TikTok scraper to extract data from chosen TikToks. Use it to scrape TikTok video and profile data: URLs, numbers of shares, followers, hashtags, hearts, video and music metadata. Download TikTok data as JSON, HTML, CSV, Excel, or XML and use it in your apps and data projects.",
    "author_name": "Clockworks",
    "maintained_by": "Maintained by Apify",
    "count_users": "297 users",
    "count_runs": "3.4k runs",
    "last_modified": "Modified about 16 hours ago",
    "categories": "Marketing\nVideos\nSocial media",
    "full_readme": "What is TikTok Video Scraper?\n\nTikTok Video Scraper is a powerful and easy-to-use tool that allows you to extract data from chosen TikTok videos. Using this tool, you will be able to scrape:\n\nAll data from chosen videos: caption, video URL, number of plays, hearts, comments, shares, mentions country of creation, timestamp, paid or non-paid status, hashtags used, video- and music-related metadata.\nBasic creator info from TikToks posted with chosen videos: name, ID, avatar, bio, account status, total followers/following numbers, given/received likes count, etc.\nHow much will scraping TikTok Video cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nHow to use data extracted from TikTok videos?\n\nThe data extracted from TikTok Video Scraper can be used for a variety of purposes, including:\n\n✨ Conduct sentiment analysis and find authentic product reviews\n\n\n👩‍🔬 Obtain data for research and social listening experiments\n\n\n🦠 Analyze trends, viral campaigns and content of specific creators\n\n\n🥸 Identify unverified content and inaccurate information with high public value\n\n\n📚 Prepare for or analyze a TikTok marketing campaign\n\n\nHow do I use TikTok Video Scraper?\n\nTikTok Video Scraper is designed to be user-friendly, offering a smooth start for those who have never extracted data from the web before. Here’s how you can use TikTok Video Scraper to extract video data:\n\nCreate a free Apify account using your email.\nOpen TikTok Video Scraper.\nAdd one or more TikTok videos to scrape data.\nClick the “Start” button and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\nInput\n\nThe input for TikTok Video Scraper should be one or multiple TikTok video URLs. You can always find those on top of the page in the TikTok web app.\n\nClick on the input tab for a full explanation of an input example in JSON.\n\n{\n  \"postURLs\": [\n    \"https://www.tiktok.com/@olympics/video/7208589533632269574\",\n    \"https://www.tiktok.com/@olympics/video/7210447318028455173\",\n    \"https://www.tiktok.com/@olympics/video/7200420986661965061\"\n  ]\n}\nOutput sample\n\nThe results will be wrapped into a dataset which you can find in the Storage tab. Here's an excerpt from the data you'd get if you apply the input parameters above:\n\nAnd here is the same data but in JSON. You can choose in which format to download your TikTok video data: JSON, JSONL, Excel spreadsheet, HTML table, CSV, or XML.\n\n[{\n  \"id\": \"7200420986661965061\",\n  \"text\": \"The crossover you never expected. This is fire! 🔥 📹: (IG) robworling14 #Olympics #Athletes #Sports #IceSkating #Hockey #Football #Soccer \",\n  \"createTime\": 1676478656,\n  \"createTimeISO\": \"2023-02-15T16:30:56.000Z\",\n  \"locationCreated\": \"ES\",\n  \"isAd\": true,\n  \"authorMeta\": {\n    \"id\": \"6754011909617894406\",\n    \"name\": \"olympics\",\n    \"nickName\": \"Olympics\",\n    \"verified\": true,\n    \"signature\": \"The Olympics, like never before\",\n    \"bioLink\": null,\n    \"avatar\": \"https://p16-sign-sg.tiktokcdn.com/aweme/720x720/tos-alisg-avt-0068/829ea90040553aaec7450d66caaadc10.jpeg?x-expires=1679058000&x-signature=khyGKyozz08NQRy%2BMW6YYWK1jzU%3D\",\n    \"privateAccount\": false,\n    \"roomId\": \"\",\n    \"ttSeller\": false\n  },\n  \"musicMeta\": {\n    \"musicName\": \"Chill Vibes\",\n    \"musicAuthor\": \"Tollan Kim\",\n    \"musicOriginal\": false,\n    \"musicAlbum\": \"Chill Vibes\",\n    \"playUrl\": \"https://sf16-ies-music-sg.tiktokcdn.com/obj/tos-alisg-ve-2774/0582a256505b4d9f91f351acd30e4aa8\",\n    \"coverMediumUrl\": \"https://p16-sg.tiktokcdn.com/aweme/200x200/tos-alisg-v-2774/30a0e8c075b041ec83b79ebdf33ba2d7.jpeg\",\n    \"musicId\": \"7084465663108089857\"\n  },\n  \"webVideoUrl\": \"https://www.tiktok.com/@olympics/video/7200420986661965061\",\n  \"mediaUrls\": [\n    \"https://v16-webapp-prime.us.tiktok.com/video/tos/useast2a/tos-useast2a-pve-0068/ogbhZC5MIdLCkh9AxtxztgvIRbAfQjooICvxUq/?a=1988&ch=0&cr=0&dr=0&lr=tiktok_m&cd=0%7C0%7C1%7C0&cv=1&br=4096&bt=2048&cs=0&ds=3&ft=4KJMyMzm8Zmo09UQOA4jVWu4dpWrKsdm&mime_type=video_mp4&qs=0&rc=NDQ2OTs2aTw0OTQ1NGVmZEBpams6dGU6ZmdqaTMzNzczM0A2YjEzX14xXjExMTBgXzJhYSNrZ2dicjRvZWpgLS1kMTZzcw%3D%3D&expire=1678908004&l=20230315131930AB77DDD1E220AB070C2A&policy=2&signature=1e76d240026833cdc17da7bc7527ab27&tk=tt_chain_token\"\n  ],\n  \"videoMeta\": {\n    \"height\": 1024,\n    \"width\": 576,\n    \"duration\": 34,\n    \"coverUrl\": \"https://p16-sign-va.tiktokcdn.com/obj/tos-maliva-p-0068/oAodkfzWICg9nIIb0thEqRAACB5oLLNZ9xtvxD?x-expires=1678906800&x-signature=c%2F34WoEMGEKAWQ6q%2BbRsCjRJ7FI%3D\",\n    \"definition\": \"720p\",\n    \"format\": \"mp4\"\n  },\n  \"diggCount\": 7529,\n  \"shareCount\": 59,\n  \"playCount\": 120500,\n  \"commentCount\": 82,\n  \"mentions\": [],\n  \"hashtags\": [\n    {\n      \"id\": \"569333\",\n      \"name\": \"olympics\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"30888\",\n      \"name\": \"athletes\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"7887\",\n      \"name\": \"sports\",\n      \"title\": \"\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"5547\",\n      \"name\": \"iceskating\",\n      \"title\": \"It's time to wrap up warm and show us what you can do on the ice!\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"18560\",\n      \"name\": \"hockey\",\n      \"title\": \"Whether you're hitting the ice or getting ready for the World Juniors, we're celebrating the entire #Hockey community on TikTok.\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"5282\",\n      \"name\": \"football\",\n      \"title\": \"Can't keep calm when #Football is on.\",\n      \"cover\": \"\"\n    },\n    {\n      \"id\": \"6192\",\n      \"name\": \"soccer\",\n      \"title\": \"It's called #Soccer.\",\n      \"cover\": \"\"\n    }\n  ],\n  \"effectStickers\": []\n},\n]\n...\nWant to scrape TikTok search results, profiles, or comments?\n\nIf you want to extract specific TikTok data beyond just videos, you can use one of the specialized scrapers below, each built particularly for the relevant TikTok data scraping case, whether it's profiles, comments, search results, or all data at once:\n\n🕹 Tiktok Video Scraper\t🧛 TikTok Profile Scraper\t🎙 TikTok Comments Scraper\n🔎 Tiktok Search Scraper\t🎵 TikTok Sound Scraper\t#️⃣ TikTok Hashtag Scraper\nNot your cup of tea? Build your own scraper.\n\nTikTok Video scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nIntegrations and TikTok Video Scraper\n\nLast but not least, Tiktok Video Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nOr you can use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Tiktok Video Scraper successfully finishes a run.\n\nUsing TikTok Video Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nYou can use the apify-client NPM package to access the API using Node.js, or the apify-client PyPI package to access the API using Python.\n\nCheck out the Apify API reference docs for full details, or click on the API tab for code examples.\n\nIs it legal to scrape data from TikTok videos?\n\nOur TikTok scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They can only extract what the user has chosen to share publicly. However, you should be aware that your results might contain personal data.\n\nPersonal data is protected by GDPR in the European Union and other laws and regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you’re unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for TikTok Video scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/P5EgMazmmA78Wl2k_PcxGRuV0mc2w0L6ql3NkfYrQsY/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9TNWg3elJMZktGRXI4cGRqNy9wU0ZSR0JreDJ1d2dtWGJwOS1UaWt0b2tfVmlkZW9fU2NyYXBlci5wbmc.webp",
    "author_url": "https://apify.com/clockworks",
    "author_avatar": "https://images.apifyusercontent.com/tAphEAAetE8rASX0RNFeJQiwqhcYDGhtm_LHgtB71lI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS84V3JkTVBpTDROcDJrZzdGQy9KcGZFRHFZeUg3V0Zld1kyQy1jbG9ja3dvcmtzLnBuZw.webp",
    "readme_summary": "Powerful TikTok scraper to extract data from chosen TikToks. Use it to scrape TikTok video and profile data: URLs, numbers of shares, followers, hashtags, hearts, video and music metadata. Download TikTok data as JSON, HTML, CSV, Excel, or XML and use it in your apps and data projects."
}