{
    "id": "misceres/indeed-scraper",
    "url": "https://apify.com/misceres/indeed-scraper",
    "title": "💼 Indeed Scraper · Apify",
    "name": "Indeed Scraper",
    "pricing": "Pay $5.00 for 1,000 results",
    "description": "Scrape jobs posted on Indeed. Get detailed information from this job portal about saved and sponsored jobs. Specify the search based on location with the output attributes position, location, and description.",
    "author_name": "Misceres",
    "maintained_by": "Maintained by Apify",
    "count_users": "1k users",
    "count_runs": "41.1k runs",
    "last_modified": "Modified 3 days ago",
    "categories": "Jobs",
    "full_readme": "What does Indeed Scraper do?\n\nIndeed Scraper allows you to extract job data from Indeed's job listings: job title, description, company name, location, salary, ratings, employment type, and more. To get that data, just type in the job title and location and click \"Save & Start\" button. Alternatively, provide search URLs or a URL to scrape company jobs in the format of https://www.indeed.com/cmp/Google/jobs\n\nWhat job listing data can I extract?\n\nWith this Indeed API, you will be able to extract the following data from Indeed:\n\n🧑‍💼 Job title\t⏱ Time of posting\n📃 Job description\t🔗 URLs\n⭐️ Reviews and ratings\t📍 Company name and location\n💵 Salary\t🕐 Employment type\nCan I use Indeed API to scrape Indeed job postings?\n\nAs of June 2023, Indeed provides a range of APIs for developers at no cost. However, it appears that these APIs are primarily geared towards the hiring side of the platform. While they can be valuable for integrating Indeed into applicant tracking systems, tracking applicant conversions, or scheduling interviews, they are not suitable for job searching purposes.\n\nPreviously, the Publisher Jobs API (Get Job and Job Search) used to be available and geared specifically for job searching, but they have been deprecated. Specifically, the Job Search API allowed users to gather data such as position names, company names, location, time of posting, and job descriptions. These changes have led users to seek out alternatives to Indeed APIs, such as this Indeed Scraper.\n\nWhy scrape Indeed?\n\n🕵️ Conduct job market research or analysis by salary, rating, newness, etc.\n\n✨ Monitor hiring trends for skills and technology gaps\n\n🗂 Create a custom database for available positions\n\n📩 Automate the job search to speed up and simplify the process\n\n💸 Salary benchmarking\n\n🤺 Competition tracking\n\nHow do I use Indeed Scraper?\n\nIndeed Scraper was designed for an easy start even if you've never extracted data from the web before. Here's how you can scrape Indeed job data with this tool:\n\nCreate a free Apify account using your email.\nOpen Indeed Scraper.\nAdd one or more job search URLs to scrape their info.\nClick \"Start\" and wait for the data to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\n\nIf you need guidance on how to run the scraper, you can follow our step-by-step tutorial 🔗 or video guide ▷ on YouTube.\n\nInput\n\nThe input for Indeed Scraper should be a job position, location and number of results. For a fuller explanation of input in JSON, head over to the input tab.\n\n{\n\"country\": \"US\",\n\"location\": \"San Francisco\",\n\"maxConcurrency\": 5,\n\"maxItems\": 100,\n\"position\": \"data analyst\",\n\"saveOnlyUniqueItems\": true\n} \nOutput sample\n\nThe results will be wrapped into a dataset which you can find in the Storage tab. Here's an excerpt from the JSON dataset you'd get if you apply the input parameters above:\n\nAnd here is the same data but in JSON. You can choose in which format to download your Indeed data: JSON, JSONL, Excel spreadsheet, HTML table, CSV, or XML.\n\n[{\n  \"positionName\": \"Power BI Report Analyst with Finance Oracle ERP (OTC/PTP/RTR)\",\n  \"salary\": null,\n  \"jobType\": [\n    \"Fulltime\"\n  ],\n  \"company\": \"Purple Drive Technologies\",\n  \"companyLogo\": \"https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e01ca5b3407aa673eb3e185ba14064b1\",\n  \"location\": \"500 Almanor Avenue, Sunnyvale, CA 94085\",\n  \"rating\": 3.8,\n  \"reviewsCount\": 4,\n  \"url\": \"https://www.indeed.com/company/Purple-Drive-Technologies/jobs/Power-Bi-Report-Analyst-Finance-Oracle-Erp-cd84b0a277f6128d?fccid=b50885016c495d25&vjs=3\",\n  \"id\": \"cd84b0a277f6128d\",\n  \"postedAt\": \"Today\",\n  \"scrapedAt\": \"2023-03-18T19:39:01.111Z\",\n  \"description\": \"Key words to search in resume:\\n\\n Finance (Revenue, FP&A, QTC/OTC, P2P, R2R, Sales Compensation) functional knowledge, Oracle EBS or any other Finance ERP knowledge to understand finance data and create visuals within PowerBI.\\n\\n\\n Microsoft Power BI\\n\\nRequired Skill:\\n\\n Analyze data in Excel, compare data in different excels using VLOOKUP, upload data from excel to Power BI\\n\\n\\n Create visualizations for data in Power BI, work on reports/dashboards based upon defined request and requirements from stakeholders and maintain a catalog of reports’ use and purpose.\\n\\n\\n Report Analyst is responsible for data analysis, data visualization solutions on Power BI to support our various business stakeholders. Backend/Coding knowledge is not needed, it is only good to have\\n\\n\\n Maintain queue of report requests from initiation through to completion, including their detailed requirements.\\n\\n\\n Participate in business analysis activities to maintain reports and enhancements requests as needed.\\n\\n\\n Enforce rules and procedures for cleaning, integrating, and reconciling information/data from various sources.\\n\\n\\n Assist end users with troubleshooting reports, Work with stakeholders to define and understand their data/reporting needs.\\n\\n\\n Create report standards and best practices or guidelines for repeatable processes.\\n\\n\\n Develop testing plan along with performing tests to deliver high quality solutions.\\n\\n\\n Analyze report / data issues and provide recommended approaches to solve.\\n\\n\\n Accountability for meeting commitments as scheduled and achieving high customer satisfaction.\\n\\n\\n Keep other team members and management fully informed of progress, emerging issues, corrective actions, and escalating appropriately as the situation demands\\n\\nGood to Have skill:\\n\\n Bachelor’s degree in information systems or related field preferred\\n\\n\\n 7+ years expertise with PowerBI dashboards, analyzing data and visualization using Finance data – MUST TO HAVE\\n\\n\\n Prior experience with Tableau, Oracle BI tool-OBIEE – NICE TO HAVE\\n\\n\\n Backend coding, query writing with PL/SQL, MS SQL/MySQL Server- NICE TO HAVE\\n\\n\\n Familiarity with BI and Data Warehousing concepts.\\n\\n\\n Candidate will be responsible for analyzing business problems to determine the best way to apply BI capabilities to deliver solutions. Should maintain and grow working knowledge of enterprise data assets and data-centric business processes within Finance Org\\n\\n\\n Strong analytical, conceptual, and problem-solving abilities. Ability to work independently with minimal guidance from management, Ability to learn and apply new concepts quickly, Ability to meet tight deadlines.\\n\\n\\n Analyze business requirements, visualize, and analyze data for reporting.\\n\\n\\n Evaluate business requests for new or modified capabilities to determine feasibility, cost and time required, compatibility with current systems, and computer capabilities.\\n\\n\\n Create and review/approve functional design documents and specifications on change requests and assignments within a project while maintaining documentation and abstracts in conformance with standards.\\n\\n\\n Analyze reporting needs for business consumption using BI tools.\\n\\n\\n Provide detailed source analysis and data mappings/transformations to BI developers to implement new data sources and integrations.\\n\\n\\n Devise and deliver testing plans and testing data to validate BI solutions, Coordinate user testing\\n\\n\\n Facilitate BI solutions ensuring changes follow appropriate Change and Release Management processes.\\n\\n\\n Provide consultancy to business units for detailed information on data availability, location, lineage, and quality.\\n\\n\\n Perform data analysis, profiling, and quality assessment to ensure the integrity of business data to necessary levels.\\n\\nJob Type: Full-time\\nSchedule:\\n\\n 8 hour shift\\n\\nWork Location: One location\",\n  \"descriptionHTML\": \"<p>Key words to search in resume:</p>\\n<ul>\\n <li>Finance (Revenue, FP&amp;A, QTC/OTC, P2P, R2R, Sales Compensation) functional knowledge, Oracle EBS or any other Finance ERP knowledge to understand finance data and create visuals within PowerBI.</li>\\n</ul>\\n<ul>\\n <li>Microsoft Power BI</li>\\n</ul>\\n<p>Required Skill:</p>\\n<ul>\\n <li>Analyze data in Excel, compare data in different excels using VLOOKUP, upload data from excel to Power BI</li>\\n</ul>\\n<ul>\\n <li>Create visualizations for data in Power BI, work on reports/dashboards based upon defined request and requirements from stakeholders and maintain a catalog of reports&#x2019; use and purpose.</li>\\n</ul>\\n<ul>\\n <li>Report Analyst is responsible for data analysis, data visualization solutions on Power BI to support our various business stakeholders. Backend/Coding knowledge is not needed, it is only good to have</li>\\n</ul>\\n<ul>\\n <li>Maintain queue of report requests from initiation through to completion, including their detailed requirements.</li>\\n</ul>\\n<ul>\\n <li>Participate in business analysis activities to maintain reports and enhancements requests as needed.</li>\\n</ul>\\n<ul>\\n <li>Enforce rules and procedures for cleaning, integrating, and reconciling information/data from various sources.</li>\\n</ul>\\n<ul>\\n <li>Assist end users with troubleshooting reports, Work with stakeholders to define and understand their data/reporting needs.</li>\\n</ul>\\n<ul>\\n <li>Create report standards and best practices or guidelines for repeatable processes.</li>\\n</ul>\\n<ul>\\n <li>Develop testing plan along with performing tests to deliver high quality solutions.</li>\\n</ul>\\n<ul>\\n <li>Analyze report / data issues and provide recommended approaches to solve.</li>\\n</ul>\\n<ul>\\n <li>Accountability for meeting commitments as scheduled and achieving high customer satisfaction.</li>\\n</ul>\\n<ul>\\n <li>Keep other team members and management fully informed of progress, emerging issues, corrective actions, and escalating appropriately as the situation demands</li>\\n</ul>\\n<p>Good to Have skill:</p>\\n<ul>\\n <li>Bachelor&#x2019;s degree in information systems or related field preferred</li>\\n</ul>\\n<ul>\\n <li>7+ years expertise with PowerBI dashboards, analyzing data and visualization using Finance data &#x2013; MUST TO HAVE</li>\\n</ul>\\n<ul>\\n <li>Prior experience with Tableau, Oracle BI tool-OBIEE &#x2013; NICE TO HAVE</li>\\n</ul>\\n<ul>\\n <li>Backend coding, query writing with PL/SQL, MS SQL/MySQL Server- NICE TO HAVE</li>\\n</ul>\\n<ul>\\n <li>Familiarity with BI and Data Warehousing concepts.</li>\\n</ul>\\n<ul>\\n <li>Candidate will be responsible for analyzing business problems to determine the best way to apply BI capabilities to deliver solutions. Should maintain and grow working knowledge of enterprise data assets and data-centric business processes within Finance Org</li>\\n</ul>\\n<ul>\\n <li>Strong analytical, conceptual, and problem-solving abilities. Ability to work independently with minimal guidance from management, Ability to learn and apply new concepts quickly, Ability to meet tight deadlines.</li>\\n</ul>\\n<ul>\\n <li>Analyze business requirements, visualize, and analyze data for reporting.</li>\\n</ul>\\n<ul>\\n <li>Evaluate business requests for new or modified capabilities to determine feasibility, cost and time required, compatibility with current systems, and computer capabilities.</li>\\n</ul>\\n<ul>\\n <li>Create and review/approve functional design documents and specifications on change requests and assignments within a project while maintaining documentation and abstracts in conformance with standards.</li>\\n</ul>\\n<ul>\\n <li>Analyze reporting needs for business consumption using BI tools.</li>\\n</ul>\\n<ul>\\n <li>Provide detailed source analysis and data mappings/transformations to BI developers to implement new data sources and integrations.</li>\\n</ul>\\n<ul>\\n <li>Devise and deliver testing plans and testing data to validate BI solutions, Coordinate user testing</li>\\n</ul>\\n<ul>\\n <li>Facilitate BI solutions ensuring changes follow appropriate Change and Release Management processes.</li>\\n</ul>\\n<ul>\\n <li>Provide consultancy to business units for detailed information on data availability, location, lineage, and quality.</li>\\n</ul>\\n<ul>\\n <li>Perform data analysis, profiling, and quality assessment to ensure the integrity of business data to necessary levels.</li>\\n</ul>\\n<p>Job Type: Full-time</p>\\n<p>Schedule:</p>\\n<ul>\\n <li>8 hour shift</li>\\n</ul>\\n<p>Work Location: One location</p>\",\n  \"externalApplyLink\": null\n},\n{\n  \"positionName\": \"Business Systems Analyst (Analytics & Insights)\",\n  \"salary\": null,\n  \"jobType\": null,\n  \"company\": \"Saama Technologies Inc\",\n  \"companyLogo\": \"https://d2q79iu7y748jz.cloudfront.net/s/_logo/a0051cbc87d486301c5fc005abaa7c88\",\n  \"location\": \"San Francisco, CA\",\n  \"rating\": 3.6,\n  \"reviewsCount\": 43,\n  \"url\": \"https://www.indeed.com/rc/clk?jk=24e1fe226a1412b8&fccid=f7cbfaf9ddc3fe8a&vjs=3\",\n  \"id\": \"24e1fe226a1412b8\",\n  \"postedAt\": \"1 day ago\",\n  \"scrapedAt\": \"2023-03-18T19:39:01.328Z\",\n  \"description\": \"\\n Title – Business Systems Analyst (Analytics & Insights) Location - South SFO, CA (3-4 days onsite)\\n  Does solving complex business problems and real-world challenges interest you? Do you enjoy seeing the impact your contributions make on a daily basis? Are you passionate about using data analytics to provide game changing solutions to the Global 2000 clients? Do you thrive in a dynamic work environment that constantly pushes you to be the best you can be and more? Are you ready to work with smart colleagues who drive for excellence in everything they do?\\n  If you possess a solutions mindset, strong architecting skills, and commitment to be part of a tremendous journey, come join our growing, global team. See what Saama can do for your career and for your journey.\\n  Key relationships:\\n \\n   All project team members at onsite & offshore\\n   Enterprise Architecture Teams\\n   Data Modelers\\n   Business Teams\\n   Upstream & Downstream Application teams\\n   PMO Teams - Internal & Client\\n   Operations support teams at Onsite and Offshore\\n \\n  What We Value\\n \\n   Integrity: doing the right thing \\n  Solutions: solving core, complex business challenges\\n   Collaboration: working as one team\\n   Innovation: changing the game\\n   Transparency: communicating openly\\n   Enjoy & Celebrate: having fun\\n \\n  Competencies:\\n \\n   Results-oriented and a self-starter who enjoys a challenge and needs minimal support and direction.\\n   Works well in structured environment handling multiple threads\\n   Takes initiative; challenges status quo\\n   Learns quickly; takes smart risks & experiments.\\n   Consulting skills; identifies key requirements in dynamic environments.\\n   Positive Attitude, Communication & Influence skills. Able to communicate effectively and credibly with clients, and other team members. Effective in both written and spoken communication.\\n   Stays the course despite challenges & setbacks\\n \\n  What you will do\\n \\n   Partner with internal stakeholders to identify and analyze requirements to define scope, objectives, and feasibility analysis. Create a comprehensive Product Requirement Document and detailed Product Roadmap for Genentech’s NLP Platform\\n   Prepare robust technical reports and create diagrams, workflow maps, or other visuals to facilitate enhanced system understanding\\n   Produce detailed wireframes and mockups using visualization tools for prototyping\\n   Work closely with Data Management & Architecture teams to maintain awareness of accessibility, compliance, and security policies and guidelines\\n   Lead portions of large tasks or projects; build and maintain project management skills\\n   Participate in the implementation of system patches, updates, and maintenance\\n   Collaborate with Product Managers, Project Managers/Scrum Masters, Architects, Engineers, Developers, Quality Assurance, and User Experience Designers on scope, solutions, constraints, and risks\\n   Collaborate with cross-functional IT organization to streamline solution implementations to maintain records of system integrations, changes, and incidents\\n   Develop and execute test plans, as well as other quality assurance measures; lead testing such as user acceptance, performance, security, usability, etc.\\n   Provide timely dissemination of communications for system changes; determine support and resource requirements associated with each change\\n \\n  Must Have\\n \\n   Experience of working in end-to-end software development lifecycle\\n   [Non-negotiables] Hands-on expertise with Jira, Confluence, Trello, Lucid Chart and Google Suite\\n   [Non-negotiables] Be on-site 3-4 days a week and/or as required by product team\\n   [Non-negotiables] Excellent communication (written and oral) and presentation skills; solid business acumen of US Commercial Market in Pharma industry; well-honed influencing skills are essential\\n   Demonstrated success in handling initiatives of high complexity, high profile, and large-scale programs\\n   Self-motivated and team-oriented; able to work both autonomously and effectively as part of a geographically dispersed team\\n   Must have for data and hands on experience with data related initiatives\\n   Understanding and experience in ML and data science concepts is preferred\\n \\n  Education and Work Experience\\n \\n   Masters or Bachelor’s degree in Computer, IT, Software or related field required\\n \\n  Work Environment\\n  This job operates in a professional office environment. This role routinely uses standard office equipment, including but not limited to, computers, phones, and photocopiers.\\n  Physical Demands\\n  This position requires the frequent and repetitive use of a computer, keyboard, and mouse. Hand and finger dexterity is required.\\n  Other Duties\\n  Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\\n  EEO\\n  Saama Technologies, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\\n  This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\\n\\n\",\n  \"descriptionHTML\": \"<div>\\n <p><b>Title &#x2013; Business Systems Analyst (Analytics &amp; Insights)</b><br> <b>Location - South SFO, CA (3-4 days onsite)</b></p>\\n <p> Does solving complex business problems and real-world challenges interest you? Do you enjoy seeing the impact your contributions make on a daily basis? Are you passionate about using data analytics to provide game changing solutions to the Global 2000 clients? Do you thrive in a dynamic work environment that constantly pushes you to be the best you can be and more? Are you ready to work with smart colleagues who drive for excellence in everything they do?</p>\\n <p> If you possess a solutions mindset, strong architecting skills, and commitment to be part of a tremendous journey, come join our growing, global team. See what Saama can do for your career and for your journey.</p>\\n <p><b> Key relationships:</b></p>\\n <ul>\\n  <li> All project team members at onsite &amp; offshore</li>\\n  <li> Enterprise Architecture Teams</li>\\n  <li> Data Modelers</li>\\n  <li> Business Teams</li>\\n  <li> Upstream &amp; Downstream Application teams</li>\\n  <li> PMO Teams - Internal &amp; Client</li>\\n  <li> Operations support teams at Onsite and Offshore</li>\\n </ul>\\n <p><b> What We Value</b></p>\\n <ul>\\n  <li> Integrity: doing the right thing </li>\\n  <li>Solutions: solving core, complex business challenges</li>\\n  <li> Collaboration: working as one team</li>\\n  <li> Innovation: changing the game</li>\\n  <li> Transparency: communicating openly</li>\\n  <li> Enjoy &amp; Celebrate: having fun</li>\\n </ul>\\n <p><b> Competencies:</b></p>\\n <ul>\\n  <li> Results-oriented and a self-starter who enjoys a challenge and needs minimal support and direction.</li>\\n  <li> Works well in structured environment handling multiple threads</li>\\n  <li> Takes initiative; challenges status quo</li>\\n  <li> Learns quickly; takes smart risks &amp; experiments.</li>\\n  <li> Consulting skills; identifies key requirements in dynamic environments.</li>\\n  <li> Positive Attitude, Communication &amp; Influence skills. Able to communicate effectively and credibly with clients, and other team members. Effective in both written and spoken communication.</li>\\n  <li> Stays the course despite challenges &amp; setbacks</li>\\n </ul>\\n <p><b> What you will do</b></p>\\n <ul>\\n  <li> Partner with internal stakeholders to identify and analyze requirements to define scope, objectives, and feasibility analysis. Create a comprehensive Product Requirement Document and detailed Product Roadmap for Genentech&#x2019;s NLP Platform</li>\\n  <li> Prepare robust technical reports and create diagrams, workflow maps, or other visuals to facilitate enhanced system understanding</li>\\n  <li> Produce detailed wireframes and mockups using visualization tools for prototyping</li>\\n  <li> Work closely with Data Management &amp; Architecture teams to maintain awareness of accessibility, compliance, and security policies and guidelines</li>\\n  <li> Lead portions of large tasks or projects; build and maintain project management skills</li>\\n  <li> Participate in the implementation of system patches, updates, and maintenance</li>\\n  <li> Collaborate with Product Managers, Project Managers/Scrum Masters, Architects, Engineers, Developers, Quality Assurance, and User Experience Designers on scope, solutions, constraints, and risks</li>\\n  <li> Collaborate with cross-functional IT organization to streamline solution implementations to maintain records of system integrations, changes, and incidents</li>\\n  <li> Develop and execute test plans, as well as other quality assurance measures; lead testing such as user acceptance, performance, security, usability, etc.</li>\\n  <li> Provide timely dissemination of communications for system changes; determine support and resource requirements associated with each change</li>\\n </ul>\\n <p><b> Must Have</b></p>\\n <ul>\\n  <li> Experience of working in end-to-end software development lifecycle</li>\\n  <li> [Non-negotiables] Hands-on expertise with Jira, Confluence, Trello, Lucid Chart and Google Suite</li>\\n  <li> [Non-negotiables] Be on-site 3-4 days a week and/or as required by product team</li>\\n  <li> [Non-negotiables] Excellent communication (written and oral) and presentation skills; solid business acumen of US Commercial Market in Pharma industry; well-honed influencing skills are essential</li>\\n  <li> Demonstrated success in handling initiatives of high complexity, high profile, and large-scale programs</li>\\n  <li> Self-motivated and team-oriented; able to work both autonomously and effectively as part of a geographically dispersed team</li>\\n  <li> Must have for data and hands on experience with data related initiatives</li>\\n  <li> Understanding and experience in ML and data science concepts is preferred</li>\\n </ul>\\n <p><b> Education and Work Experience</b></p>\\n <ul>\\n  <li> Masters or Bachelor&#x2019;s degree in Computer, IT, Software or related field required</li>\\n </ul>\\n <p> <b>Work Environment</b></p>\\n <p> This job operates in a professional office environment. This role routinely uses standard office equipment, including but not limited to, computers, phones, and photocopiers.</p>\\n <p><b> Physical Demands</b></p>\\n <p> This position requires the frequent and repetitive use of a computer, keyboard, and mouse. Hand and finger dexterity is required.</p>\\n <p><b> Other Duties</b></p>\\n <p> Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.</p>\\n <p><b> EEO</b></p>\\n <p> Saama Technologies, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p>\\n <p> This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.</p>\\n</div>\\n<p></p>\",\n  \"externalApplyLink\": \"https://www.indeed.com/applystart?jk=24e1fe226a1412b8&from=vj&pos=bottom&mvj=0&spon=0&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjkZm6RCuBOjvJ-BgzO1TnPl8EZNoFLzyHkpvcd7-Y9bg&vjfrom=serp&astse=337c23049493ec1c&assa=644\"\n}]\n...\nHow many results can you scrape with Indeed scraper?\n\nIndeed scraper can return over 1000 results on average - on a good day.\n\nYou have to keep in mind that scraping Indeed is dynamic and subject to change. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors.\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nHow much will scraping Indeed cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nWant to scrape Glassdoor or Upwork?\n\nIf you want to extract specific job listing data other than Indeed, you can use one of the specialized job listing scrapers:\n\n📗 Upwork Scraper\t🔍 Google Jobs Scraper\n🚪 Glassdoor Scraper\t🧢 Crunchbase.com Scraper\n💼 Clutch.co Scraper\t👔 LinkedIn Company Search Scraper\nIntegrations and Indeed Scraper\n\nIndeed Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nYou can also use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Indeed Scraper successfully finishes a run.\n\nUsing Indeed Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nYou can use the apify-client NPM package to access the API using Node.js, or the apify-client PyPI package to access the API using Python. Check out the Apify API reference docs for full details, or click on the API tab for code examples.\n\nIs it legal to scrape Indeed data?\n\nOur scrapers are ethical and do not extract any private user data. They only extract what the user has chosen to share publicly, on the website. However, you should be aware that your results could contain personal data. You should not scrape personal data unless you have a legitimate reason to do so.\n\nIf you're unsure whether your reason is legitimate, consult your lawyers. You should not scrape personal data unless you have a legitimate reason to do so. If you’re unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nNot your cup of tea? Build your own scraper.\n\nIndeed scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Indeed Scraper or simply found a bug, please create an issue on the actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/mRiDbPl6WgY0BowDdq8xI4I_lZi_HlQDWJSdy0kG6MU/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9oTXZOU3B6M0puSGdsNWpraC8zQ3lqZkI1UDVZZW1zRERBNS1JbmRlZWRfU2NyYXBlci5wbmc.webp",
    "author_url": "https://apify.com/misceres",
    "author_avatar": "https://images.apifyusercontent.com/toIg6q6AIxWpWcjyiZ08n4hzpaT8m37A9TzMjUX5_ZE/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9KcVp5Q1doZXo2QmRXc3NSdS9BcDNwWnhlYWl3WFh6TTc1Qi1taXNjZXJlcy5wbmc.webp",
    "readme_summary": "Scrape jobs posted on Indeed. Get detailed information from this job portal about saved and sponsored jobs. Specify the search based on location with the output attributes position, location, and description."
}