{
    "id": "glenn/gif-scroll-animation",
    "url": "https://apify.com/glenn/gif-scroll-animation",
    "title": "Create animated GIFs of any scrolling web page · Apify",
    "name": "GIF Scroll Animation",
    "pricing": "No credit card required",
    "description": "Free tool to automatically create an animated GIF of any scrolling web page. Useful for testing UX, showcasing your work, and capturing any website as a GIF, including clickable elements and animations. Includes settings to adjust speed, wait before scrolling, slow down on-page animations, and more.",
    "author_name": "Glenn Goossens",
    "maintained_by": "Maintained by Apify",
    "count_users": "3.6k users",
    "count_runs": "60.9k runs",
    "last_modified": "Modified 4 months ago",
    "categories": "Videos",
    "full_readme": "Features\n\nOur free GIF Scroll Animation actor is an automation tool to let you capture any scrolling web page as a GIF.\n\nAll content on the full page will be recorded, just as if you were scrolling the page yourself and recording it. But because it's automated, the pace of scrolling will be smooth.\n\nIt can be tricky to get a good recording of animations that appear when scrolling down a page. You might not scroll smoothly and the final result could look jerky or awkward. This GIF maker will automate the process, so that you just give it a URL and it will capture a wonderfully smooth animated recording of the page scrolling.\n\nWhy use it?\n\nIf you want to showcase your website (or any website) or share it somewhere online, you might prefer to capture a scrolling GIF. That lets you avoid problems with browser support and you embed the GIF anywhere you like, such as on social media or in comments.\n\nThe tool can also be used to visually check pages and make sure that the user experience is good. It can let you see what the page will look like to a real person scrolling down the page and highlight problems with the layout or design. The GIF maker would be especially useful if you have to do this regularly for a lot of pages, so that you can avoid manually going to each page and interacting with it in a browser.\n\nHow it works\n\nIt's very simple to use. You give the actor a URL, it visits the web page and takes screenshots. The screenshots are then used as frames and turned into a GIF.\n\nThere are several settings you can change if you want to change the frame rate, wait before scrolling, compress the GIF, change the viewport, and a bunch of other customizable options. Or you can just give it a URL and go with the default settings.\n\nTutorial\n\nHere's a quick step-by-step guide to teach you how to make an animated scrolling GIF of any web page using GIF Scroll Animation. There's also a one-second history of the GIF and some awesome reaction GIFs to blow your mind...\n\nOutput\nExample\n\nScrolling GIF for www.franshalsmuseum.nl:\n\nStorage\n\nThe GIF files are stored in the Apify key-value store. The original GIF will always be saved. Additional GIFs might also be stored if you customize the compression method. You can also find links to the GIFs in the Dataset.\n\nInput parameters\nField\tType\tRequired\tDefault\tDescription\nurl\tstring\tYes\t\tWebsite URL\nframeRate\tinteger\tNo\t7\tNumber of frames per second (fps).\nscrollDown\tboolean\tYes\t\tWhen true, the actor will scroll down the page and capture it to create the GIF.\nscrollPercentage\tinteger\tNo\t10\tAmount to scroll down determined as a percentage of the viewport height. (%)\nrecordingTimeBeforeAction\tinteger\tNo\t1\tAmount of time to capture the screen before doing any action like scrolling down or clicking. (ms)\nclickSelector\tinteger\tNo\t\tUsed to click an element and record it.\nrecordingTimeAfterClick\tinteger\tNo\tAmount of time to record the screen after clicking an element with the click selector.\t\nwaitToLoadPage\tinteger\tNo\t0\tSet time to wait at the beginning so that page is fully loaded (ms).\ncookieWindowSelector\tstring\tNo\t\tCSS selector to remove cookie pop-up window if one is present.\nslowDownAnimations\tboolean\tNo\tfalse\tWhen selected, slows down animations on the page so they can be properly captured.\nlossyCompression\tboolean\tNo\ttrue\tLossy LZW compression of GIF using Giflossy.\nloslessCompression\tboolean\tNo\tfalse\tLossless compression of GIF using Gifsicle.\nviewportWidth\tinteger\tNo\t1366\tInner width of browser window (pixels)\nviewportHeight\tinteger\tNo\t768\tInner height of browser window (pixels)\nInput example\n{\n  \"url\": \"https://www.franshalsmuseum.nl/en/\",\n    \"frameRate\": 7,\n    \"scrollDown\": true,\n    \"recordingTimeBeforeAction\": 1500,\n    \"cookieWindowSelector\": \".cookiebar\"\n}",
    "icon": "https://images.apifyusercontent.com/er_wcKRN-PrSmz6rX8A6-bMQW2AcWS1q7tyoso6MtnU/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS92RDloR2NoYXVudm5QcmNRci80Nzh4UmJlYmRoWVRybnlRcC1HSUZfU2Nyb2xsX0FuaW1hdGlvbi5wbmc.webp",
    "author_url": "https://apify.com/glenn",
    "author_avatar": "https://images.apifyusercontent.com/Hx3ukWCUD3LupcYIaBP1GVC9-s6On9_f0wEDLYG_Z-o/rs:fill:192:192/aHR0cHM6Ly9hdmF0YXJzLmdpdGh1YnVzZXJjb250ZW50LmNvbS91LzQ4OTU2OTMz.webp",
    "readme_summary": "The GIF Scroll Animation actor is a free tool that allows you to capture any scrolling web page as a GIF. It records all content on the full page, providing a smooth scrolling experience. This tool is useful for showcasing websites, sharing them online, and visually checking pages for user experience. To use it, you simply provide a URL and the actor visits the web page, takes screenshots, and turns them into a GIF. There are customizable settings to adjust the frame rate, wait before scrolling, compress the GIF, change the viewport, and more. The GIF files are stored in the Apify key-value store and links to the GIFs can be found in the Dataset. The input parameters include the website URL, frame rate, scroll down option, scroll percentage, recording time before action, click selector, recording time after click, wait to load page, cookie window selector, slow down animations option, lossy compression, lossless compression, viewport width, and viewport height."
}