{
    "id": "apify/instagram-comment-scraper",
    "url": "https://apify.com/apify/instagram-comment-scraper",
    "title": "Instagram Comment Scraper · Apify",
    "name": "Instagram Comment Scraper",
    "pricing": "No credit card required",
    "description": "Add one or more Instagram post URLs to scrape all comments fast. Get post ids, position, timestamp, owner ids, usernames, profile pics, and URLs. Download data in structured formats such as JSON, CSV, XML, Excel, and HTML and use in reports, spreadsheets, and applications.",
    "author_name": "Apify",
    "maintained_by": "Maintained by Apify",
    "count_users": "4.2k users",
    "count_runs": "134.4k runs",
    "last_modified": "Modified about 1 month ago",
    "categories": "Social media\nMarketing\nLead generation",
    "full_readme": "What is Instagram Comment Scraper?\n\nInstagram Comment Scraper allows you to extract comments from one or more Instagram post URLs.\n\nHow many results can you scrape with Instagram Comments scraper?\n\nNote that the actor returns a maximum of 50 comments per post. It only extracts comments shown to Instagram users who are not logged in. That means the results may differ from what you see when logged in to your Instagram account. To try it out, open an incognito window on your browser and copy the post URL. The comments you’ll see there are the comments that this actor will save in a dataset. You have to keep in mind that scraping Instagram is dynamic and subject to change. There’s no one-size-fits-all-use-cases number. The maximum number of results may vary depending on the complexity of the input, location, and other factors.\n\nTherefore, while we regularly run Actor tests to keep the benchmarks in check, the results may also fluctuate without our knowing. The best way to know for sure for your particular use case is to do a test run yourself.\n\nWhy scrape Instagram comments?\n\nScraping comments on Instagram posts can give you quick insights into how an audience is reacting to marketing campaigns and enable you to spot misinformation or abuse, track audience engagement, or help you monitor how competing content is being received.\n\nIf you want more ideas, check out our industries pages for ways web scraping is already being used in a wide range of companies.\n\nHow to scrape Instagram comments and likes\n\nInstagram Comment Scraper is designed to be fast and easy to use so there aren't too many parameters or settings. Just follow the steps below:\n\nCreate a free Apify account.\nOpen Instagram Comment Scraper\nAdd one or more Instagram post URLs to scrape.\nClick Start and wait for the datasets to be extracted.\nDownload your data in JSON, XML, CSV, Excel, or HTML.\nInstagram Comment Scraper tutorial\n\nIf you want more guidance on how to use Instagram Comment Scraper, this video tutorial shows you how to do it in just a few minutes\n\nHow much will scraping Instagram comments cost you?\n\nWhen it comes to scraping, it can be challenging to estimate the resources needed to extract data as use cases may vary significantly. That's why the best course of action is to run a test scrape with a small sample of input data and limited output. You’ll get your price per scrape, which you’ll then multiply by the number of scrapes you intend to do.\n\nWatch this video for a few helpful tips. And don't forget that choosing a higher plan will save you money in the long run.\n\nIs it legal to scrape Instagram comments?\n\nOur Instagram scrapers are ethical and do not extract any private user data, such as email addresses, gender, or location. They only extract what the user has chosen to share publicly. We therefore believe that our scrapers, when used for ethical purposes by Apify users, are safe. However, you should be aware that your results could contain personal data. Personal data is protected by the GDPR in the European Union and by other regulations around the world. You should not scrape personal data unless you have a legitimate reason to do so. If you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog posts on the legality of web scraping and ethical scraping.\n\nIntegrations and Instagram Comment Scraper\n\nInstagram Comment Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. Integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Instagram Profile Scraper successfully finishes a run.\n\nUsing Instagram Comment Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.To access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package. Check out the Apify API reference docs for full details or click on the API tab for code examples.\n\nInput example\n\nThe input for Instagram Comment Scraper should be JSON containing the Instagram username or usernames you want to scrape.\n\n{\n  \"directUrls\": [\n    \"https://www.instagram.com/p/CH-MgQOn-7E/\"\n  ],\n  \"resultsLimit\": 24\n}\nOutput example\n\nThe structure of each item in Instagram posts when scrolling looks like this:\n\n{\n\"id\": \"17949788698583607\",\n\"postId\": \"CH-MgQOn-7E\",\n\"text\": \"Imagine scrolling to find the end of these comments!😂\",\n\"position\": 20,\n\"timestamp\": \"2021-11-19T13:54:13.000Z\",\n\"ownerId\": \"47340566177\",\n\"ownerIsVerified\": false,\n\"ownerUsername\": \"gabriel2005120\",\n\"ownerProfilePicUrl\": \"https://scontent-msp1-1.cdninstagram.com/v/t51.2885-19/s150x150/217945584_120518610274794_7725650845991377322_n.jpg?_nc_ht=scontent-msp1-1.cdninstagram.com&_nc_cat=106&_nc_ohc=vJx0Cg9blGUAX9QrHVC&edm=AABBvjUBAAAA&ccb=7-4&oh=9d6174f78b6feee553d365b2c66d22b4&oe=61A5CE72&_nc_sid=83d603\"\n}\n\nYou can manage the results in any language (Python, PHP, Node.js/NPM). See the Apify API docs to learn more about getting results from the Instagram scraper.\n\nIntegrations and Instagram Comment Scraper\n\nLast but not least, Instagram Comment Scraper can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more. Or you can use webhooks to carry out an action whenever an event occurs, e.g. get a notification whenever Instagram API Scraper successfully finishes a run.\n\nUsing Instagram Comment Scraper with the Apify API\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more.\n\nTo access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nWant to scrape Instagram hashtags, posts, or profiles?\n\nYou can use the other dedicated scrapers below if you want to scrape specific Instagram data. You'll have fewer settings to change and faster results. Just enter one or more Instagram usernames or URLs and click to scrape.\n\n➡️ Instagram Hashtag Scraper\n➡️ Instagram Post Scraper\n➡️ Instagram Profile Scraper\n➡️ Quick Instagram Posts Checker\n➡️ Instagram Tagged Scraper\n➡️ Instagram Reel Scraper\n\n\nNeed something more advanced?\n\nTry our more advanced Instagram Scraper or Instagram API Scraper if you need more options and are comfortable with changing settings.\n\nNot your cup of tea? Build your own scraper\n\nInstagram Comments scraper doesn’t exactly do what you need? You can always build your own! We have various scraper templates in Python, JavaScript, and TypeScript to get you started. Alternatively, you can write it from scratch using our open-source library Crawlee. You can keep the scraper to yourself or make it public by adding it to Apify Store (and find users for it).\n\nOr let us know if you need a custom scraping solution.\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Instagram Comments scraper or simply found a bug, please create an issue on the Actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/t0yQPjHtubi6_F44KcHHsdjSOQ3q8OvWV9jJyd3k9gY/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9TYkswMFgwSllDUGJsRDJ3cC9mRTR0SGE3d0w5dERBWWhOSi1JbnN0YWdyYW1fQ29tbWVudF9TY3JhcGVyLnBuZw.webp",
    "author_url": "https://apify.com/apify",
    "author_avatar": "https://images.apifyusercontent.com/lI97nKRfQNn-301fZooeDiLELKwBtOreoKdvb-R9XnI/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9ac2NNd0ZSNUg3ZUN0V3R5aC9ZcXRrUW1FeFpwbU1kNmRKUS1hcGlmeV9zeW1ib2xfd2hpdGVfYmcucG5n.webp",
    "readme_summary": "Instagram Comment Scraper is an Apify Actor that allows you to extract comments from one or more Instagram post URLs. It can scrape a maximum of 50 comments per post and only extracts comments shown to Instagram users who are not logged in. The results may differ from what you see when logged in to your Instagram account. Scraping Instagram comments can provide insights into audience reactions, track engagement, and monitor competing content. To use the actor, create a free Apify account, add the post URLs to scrape, and download the data in structured formats such as JSON, CSV, XML, Excel, or HTML. The actor can be integrated with various cloud services and web apps, and it can be used with the Apify API for programmatic access. The input example shows the required JSON format, and the output example demonstrates the structure of the scraped comments. If you need to scrape other Instagram data, there are dedicated scrapers available. If the provided scraper doesn't meet your requirements, you can build your own using Apify's scraper templates or request a custom scraping solution."
}