{
    "id": "mstephen190/proxy-scraper",
    "url": "https://apify.com/mstephen190/proxy-scraper",
    "title": "Fast proxy tester and scraper · Apify",
    "name": "Proxy Scraper",
    "pricing": "No credit card required",
    "description": "Free proxy scraper and checker. Search dozens of free proxy websites. Get list of 100% working public proxies in seconds. Automatically test proxies based on target URL and maximum timeout.",
    "author_name": "Matthias Stephens",
    "maintained_by": "Maintained by Community",
    "count_users": "2.2k users",
    "count_runs": "75.9k runs",
    "last_modified": "Modified 3 months ago",
    "categories": "Automation\nDeveloper tools\nOther",
    "full_readme": "What is Proxy Scraper?\n\nThis online proxy scraper searches a number of different free-proxy websites and scrapes all of them. Then, optionally, it can test each of those proxies for you on a specified target and timeout, then only return back the proxies which pass the test.\n\nWhy use Proxy Scraper?\n\nThere are lots of free public proxies available out there, such as Geonode and free-proxy-list.net. All proxies listed on these sites vary in terms quality, speed, and security. Some of them are painfully slow, while others don't work at all.\n\nThis proxy scraper tool is the best way to quickly obtain a list of working public proxies. It uses multithreading to run its automated tests in true concurrency while it scrapes multiple proxies simultaneously, and has a straightforward configuration process, fast runtimes, and reliable outputs.\n\nProxy Scraper performs two key tasks every time you run it:\n\nIt scrapes all currently available proxies from 17 different free proxy websites and APIs\nIt individually tests each proxy\n\nThis makes the process of retrieving data from free proxy websites much more accessible, as it removes the need to check each proxy manually.\n\nJust need to scrape the web using proxies?\n\nIf you only want to use proxy servers for web scraping, Apify Proxy gives you both residential and datacenter proxies, intelligent proxy rotation, and a large pool of IP addresses. Even better, if you run your web scrapers on the Apify platform, our industry-leading browser fingerprinting research will make your scraping bots indistinguishable from humans.\n\nHow to use Proxy Scraper\nChoose which proxies to use while scraping the proxies.\nSelect 'true' or 'false' to choose whether or not to test the proxies and only return the ones that pass.\nSelect 'true' or 'false' to choose whether or not to run the actor in debug mode.\nChoose the name of the key-value store in which to save a .txt of the proxies.\nSelect your preferred 'build', 'timeout', and 'memory' options.\nClick Start.\nView and download your data in any of the available formats.\nWhat are Proxy Scraper's limitations?\n\nCurrently, Proxy Scraper can find anywhere from 20-60 reliable proxies out of the 2,500 that it scrapes every run. In the future, Proxy Scraper will scrape proxies from more than just the 17 sources currently being used.\n\nHow much does it cost to use Proxy Scraper?\n\nWith an Apify Free plan, you can run the scraper 400 times (about 10 times a day to get a fresh list of working proxies). You get 4,000 runs with a Personal plan, and 40,000 runs with a Team plan. Check out Apify pricing to see which plan is best for you.\n\nInput example\n{\n    \"testProxies\": true,\n    \"testTimeout\": 7,\n    \"testTarget\": \"https://google.com\",\n    \"kvStoreName\": \"reliable-proxies-store\",\n    \"pushToKvStore\": true,\n    \"datasetName\": \"test-dataset\"\n}\nOutput example\n\nThe output will be an array of objects looking like this:\n\n{\n  \"host\": \"164.27.6.74\", // string\n  \"port\": 8080, // number\n  \"full\": \"164.27.6.74:8080\" // string\n}\nWhat's happening under the hood?\nAll of the current proxies from these free proxy resources are added to the request queue (with certain filters applied):\nhttps://free-proxy-list.net/\nhttps://www.sslproxies.org/\nhttps://www.us-proxy.org/\nhttps://www.socks-proxy.net/\nhttps://proxylist.geonode.com\nhttps://geonode.com/free-proxy-list/\nhttps://spys.one/en/\nhttps://vpnoverview.com/privacy/anonymous-browsing/free-proxy-servers/\nhttps://hidemy.name/en/proxy-list/\nhttps://www.proxynova.com/proxy-server-list/\nhttps://free-proxy-list.com/\nhttps://anonymouse.cz/proxy-list/\nhttps://www.coderduck.com/free-proxy-list\nhttps://www.proxyrack.com/free-proxy-list/\nhttps://www.proxy-list.download\nhttps://www.proxyscan.io/\nhttp://pubproxy.com\n\nEach site is scraped, and the results are stored temporarily in a global state\n\nEach scraped proxy is tested by making a request to a target URL specified by you with a specific timeout set. If the request fails, the proxy is removed from the list.\n\nAll duplicate results are cleaned from the list.\n\nThe proxies are finally pushed to the dataset.",
    "icon": "https://images.apifyusercontent.com/kw1nLpHVyb6m4hZNNd_DBlV4KAHzuNBMSYOTIbRt6No/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9VdmtlWDRuMER2SWtjeUlZMy9TOHhNUlBmaG5qYmRoTHpLNi1TY3JlZW5fU2hvdF8yMDIyLTAyLTI3X2F0XzE5LjQzLjA1LnBuZw.webp",
    "author_url": "https://apify.com/mstephen190",
    "author_avatar": "https://images.apifyusercontent.com/xM75kIxnJ9Lq0VwWh7NiZnD_9BhogWXLR45igANFPF0/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9nR1h0cGtrTmRQN200TGZHcS9pbzJjSmU0eUNEUGdBWnN1Zy1wcm9maWxlLnBuZw.webp",
    "readme_summary": "Free proxy scraper and checker. Search dozens of free proxy websites. Get list of 100% working public proxies in seconds. Automatically test proxies based on target URL and maximum timeout."
}