{
    "id": "lukaskrivka/google-maps-with-contact-details",
    "url": "https://apify.com/lukaskrivka/google-maps-with-contact-details",
    "title": "📩📍 Google Maps Email Extractor · Apify",
    "name": "📩📍 Google Maps Email Extractor",
    "pricing": "No credit card required",
    "description": "Enhance your Google Maps data with contact details of scraped Google places. Scan websites of chosen places on Google Maps for contact details and get email address, website, location, address, zipcode, phone number, and relevant social media links. Download the data in JSON, CSV, and Excel.",
    "author_name": "Lukáš Křivka",
    "maintained_by": "Maintained by Community",
    "count_users": "1.2k users",
    "count_runs": "4k runs",
    "last_modified": "Modified 8 days ago",
    "categories": "Marketing\nBusiness\nLead generation",
    "full_readme": "What is Google Maps Email Extractor tool?\n\nIt's a tool that allows to extract places data from Google Maps and enhance the results with available contact details such as email addresses and socials. It does so by merging contact data available on Google Maps with other contact details from place's website. To get that data, just insert the task, run or dataset ID of Google Maps Scraper and click \"Save & Start\" button. With this scraping tool, you can:\n\n📈 Extract business contacts data from Google Maps places at scale\n\n\n📩 Extract place names, addresses, phone numbers, and other details from companies registered on the platform\n\n\n👨‍🍳 Get restaurant data, business address information, reviews, opening hours and more\n\n\n☄️ Get more than 200 results per search\n\n\n💿 Work with already acquired datasets from Google Maps\n\n\n⬇️ Download contact details data in Excel, CSV, JSON, and other formats\n\n\nWhat business data can I extract from Google Maps?\n\nWith this Google Maps API, you will be able to extract the following Google Maps data:\n\n🌆 Place name and place ID\t✍️ Place description and URL\n📱 Social media links\t🏛 Place category and opening hours\n📮 Address, location and postal code\t📞 Phone number\n📥 Website and email\t🌐 Geolocation (latitude and longitude)\nHow do I get contact details from Google Maps?\nPick Google Maps places or queries to extract data from.\nUse Google Maps Scraper 🔗 to crawl google.com/maps and extract information. You must not enable the \"only data from search page\" option because you need to populate the website field.\nCopy the dataset ID with extracted info. (You can also copy run ID and task ID if you want to run the Google Maps Scraper again as part of the whole flow)\nPaste the ID to Google Maps Email Extractor 🔗 and click Start.\nDownload your dataset containing contact details.\n\nIf you need guidance on how to run the scraper, you can follow our step-by-step tutorial 🔗.\n\nInput example\n\nYou can provide ID or full name of the Google Maps Scraper source (can be ID/name of a task, run or dataset)\n\nDataset ID example\n\nProvide an ID of a finished Google Maps Scraper run or its dataset. In this case, the Google Maps Scraper was already finished and this Email Extractor will only enhance it with contact details.\n\n{\n    \"googleMapsDatasetId\": \"AXu06pVFRUYhGQ9Su\"\n}\n\n\n\nTask ID example\n\nProvide an ID or full name of preconfigured Google Maps Scraper task. In this case, the task will be run first to scrape Google Maps and only after this Email Extractor will enhance it with contact details. This allows you to skip running Google Maps Scraper first. (Don't mind that the JSON input key mentions datasetId, it will work with task and name as well)\n\n{\n    \"googleMapsDatasetId\": \"lukaskrivka/google-maps-new-york-task\"\n}\n\n\nOptionally, you can also change the default Contact Details Scraper input.\n\nOutput example\n\nThe results will be wrapped into a dataset which you can find in the Storage tab. You can choose in which format to download your contact details data: JSON, JSONL, Excel spreadsheet, HTML table, CSV, or XML.\n\n☎️ Google Maps place data plus contact details\n\n  [{\n  \"title\": \"Veselka\",\n  \"subTitle\": null,\n  \"description\": \"Borscht & pierogi are menu highlights at this no-frills Ukrainian eatery.\",\n  \"price\": \"$$\",\n  \"menu\": \"https://veselka.getbento.com/menus/\",\n  \"categoryName\": \"Ukrainian restaurant\",\n  \"address\": \"144 2nd Ave, New York, NY 10003\",\n  \"locatedIn\": null,\n  \"neighborhood\": \"144 2nd Ave\",\n  \"street\": \"144 2nd Ave\",\n  \"city\": \"New York\",\n  \"postalCode\": \"10003\",\n  \"state\": \"New York\",\n  \"countryCode\": \"US\",\n  \"plusCode\": \"P2H7+J5 New York\",\n  \"website\": \"https://www.veselka.com/?utm_source=google&utm_medium=gmb&utm_campaign=veselka\",\n  \"phone\": \"(212) 228-9682\",\n  \"temporarilyClosed\": false,\n  \"claimThisBusiness\": false,\n  \"location\": {\n    \"lat\": 40.7290155,\n    \"lng\": -73.9871139\n  },\n  \"permanentlyClosed\": false,\n  \"totalScore\": 4.6,\n  \"placeId\": \"ChIJlxDiXJxZwokRp4HHbeYqXXU\",\n  \"categories\": [\n    \"Ukrainian restaurant\",\n    \"Breakfast restaurant\",\n    \"Diner\",\n    \"Hamburger restaurant\",\n    \"Lunch restaurant\",\n    \"Delivery Restaurant\",\n    \"Takeout Restaurant\",\n    \"Restaurant\",\n    \"Sandwich shop\"\n  ],\n\"media\": []\n  },\n  \"contactDetails\": {\n    \"emails\": [\n      \"irena@veselka.com\"\n    ],\n    \"phonesUncertain\": [\n      \"1903-1974\",\n      \"212-228-9682\",\n      \"917-301-2232\"\n    ],\n    \"twitters\": [\n      \"https://twitter.com/veselkanyc\"\n    ],\n    \"instagrams\": [\n      \"https://www.instagram.com/veselkanyc/\"\n    ],\n    \"facebooks\": [\n      \"https://www.facebook.com/veselkaNYC/\"\n    ],\n    \"youtubes\": [\n      \"https://www.youtube.com/watch?v=FMq7oBaLspg\"\n    }\n]\nNeed more map scraping tools?\n\nYou can use the dedicated scrapers below if you want to scrape specific Google Maps data. Each of them is built particularly for the relevant map scraping case be it reviews, gas prices, OCR from pins, or itineraries. Feel free to browse them:\n\n🧭 Google Maps Itinerary\t⛽ Gas Prices Scraper\n⭐️ Google Maps Reviews Scraper\t🍰 Easy Google Maps Scraper\n🍎 Apple Maps Scraper\t📍 OCR for Google Map pins\nFAQ\nCan I integrate Google Maps Email Extractor with other apps?\n\nLast but not least, Google Maps Email Extractor can be connected with almost any cloud service or web app thanks to integrations on the Apify platform. You can integrate with Make, Asana, Zapier, Slack, Airbyte, GitHub, Google Sheets, Google Drive, and more.\n\nYou can also use webhooks to carry out an action whenever an event occurs, e.g., get a notification whenever Google Maps Email Extractor successfully finishes a run.\n\nCan I use Google Maps Email Extractor with the API?\n\nThe Apify API gives you programmatic access to the Apify platform. The API is organized around RESTful HTTP endpoints that enable you to manage, schedule, and run Apify actors. The API also lets you access any datasets, monitor actor performance, fetch results, create and update versions, and more. To access the API using Node.js, use the apify-client NPM package. To access the API using Python, use the apify-client PyPI package.\n\nCheck out the Apify API reference docs for full details or click on the API tab for code examples.\n\nIs it legal to scrape contact details from Google Maps?\n\nOur Google Maps scrapers are ethical and do not extract any private user data. They only extract what businesses have chosen to share publicly. However, you should be aware that some results such as reviews could contain personal data. You should not scrape personal data unless you have a legitimate reason to do so.\n\nIf you're unsure whether your reason is legitimate, consult your lawyers. You can also read our blog post on the legality of web scraping and ethical scraping.\n\nHow can I use contact details data scraped from Google Maps?\n\n📬 Extract business contacts and emails on scale\n\n\n💿 Build a database with up-to-date contact information\n\n\n💼 Generate leads and business prospects\n\n\n📈 Conduct business analysis and market research\n\n\n🤺 Search, monitor and analyze competition\n\n\nYour feedback\n\nWe’re always working on improving the performance of our Actors. So if you’ve got any technical feedback for Google Maps with Contact Details Scraper or simply found a bug, please create an issue on the actor’s Issues tab in Apify Console.",
    "icon": "https://images.apifyusercontent.com/yAn3KwTY8i2cm4dn_XLTqptwfsNP7YqvjdU2kQRXy4s/rs:fill:92:92/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9Xbk14YnNSTE5iUGVZTDZnZS9Dbld3QmM4cEtnRXFheVNLUC1pbWFnZV8lMjgxJTI5LnBuZw.webp",
    "author_url": "https://apify.com/lukaskrivka",
    "author_avatar": "https://images.apifyusercontent.com/k_avqmVwjEXP1LCaEENbtk2maruHqYN9M4rAJrvX5nc/rs:fill:192:192/aHR0cHM6Ly9hcGlmeS1pbWFnZS11cGxvYWRzLXByb2QuczMuYW1hem9uYXdzLmNvbS9tUFN5RzM1TGZmajV5YnRnei8zeE5UZlFXajhzdlpBamg1ci1iaWdnZXJfcGhvdG8uanBn.webp",
    "readme_summary": "Enhance your Google Maps data with contact details of scraped Google places. Scan websites of chosen places on Google Maps for contact details and get email address, website, location, address, zipcode, phone number, and relevant social media links. Download the data in JSON, CSV, and Excel."
}